{
    "ABC News-0": {
        "source": "ABC News",
        "category": "US News",
        "title": "Speaker Mike Johnson and daughter were profiled attending 'purity ball' in 2015 German TV news segment",
        "date": "No Date Found",
        "image_url": "https://i.abcnewsfe.com/a/34b59d02-646c-47c9-bc66-a613c8629e51/mike-johnson-ht-lv-231219-1_1703023361209_hpMain_16x9.jpg",
        "image_path": "data/ABC News-0.png",
        "body": "Years before Mike Johnson would ascend to No. 2 in the presidential line of succession, a German TV news outlet profiled the future speaker of the House and his then-teenage daughter.\n\n\"This looks like a wedding,\" a news reporter says in German in a 2015 n-tv news segment that was unearthed by ABC News. \"But they are not bride and groom -- but rather father and ... daughter,\" the reporter adds, referring to Johnson and his then-13-year-old daughter, Hannah.\n\nThe German news segment documented Johnson and his family preparing for and then attending a purity ball, a controversial formal dance event, popular among some conservative Christians, that gained notoriety in the early 2000s. At a typical event, fathers and their teenage daughters dress in formal ball attire for a night that involves dinner and dancing and culminates with the daughter signing a pledge to her father to abstain from dating and to remain sexually abstinent until marriage.\n\nThe news segment examines purity balls and the general purity movement among conservative Christians through the lens of the Johnson family. It features clips of Johnson and his daughter at the ball with numerous other father-daughter pairs, and shows Johnson's daughter vowing to him to live a life of purity, as well as her signing a pledge.\n\nJohnson, his wife Kelly, and his daughter participated in interviews for the segment, which was posted on the German news channel's website.\n\nThe news segment also features interviews with Johnson's daughter, who is now in her 20s, and shows her at the purity ball pledging to her father \"to make a commitment to God, myself, my family, my friends, my future husband, and my future children ... to a lifetime of purity, including sexual purity,\" in between shots of Johnson nodding along in agreement.\n\nIn one brief interview clip, Johnson's wife Kelly Johnson, a Christian counselor, told the German news outlet, \"We don't talk to her about contraception. Sex before marriage is simply out of the question.\"\n\nJohnson, who was a little-known congressman before being elected speaker of the House in October, did not respond to a request for comment from ABC News.\n\nSince growing in popularity in the 1990s and early 2000s, purity balls and purity pledges have faced increased scrutiny from both inside and outside the Christian community, ranging from criticism that the practice places too much of a burden on young women to accusations that the balls themselves objectify young girls.\n\nLinda Kay Klein, author of the book \"Pure: Inside the Evangelical Movement That Shamed a Generation of Young Women and How I Broke Free,\" told ABC News that purity balls are not as common as other hallmarks of the purity movement, like purity rings, and that they tend to be more popular among more conservative Christian factions.\n\n\"In my book I talk about eternal girlhood,\" Klein said. \"There's this way in which purity culture attempts to create this eternal girlhood among girls -- you never really grow up, you never really have headship over your own life. You ultimately are there to be guided by and to support and to champion and to be led by somebody greater than you: a man.\"\n\n\"People often think about it from a purity ball perspective, like, 'Oh, that's creepy.' You've got the father with the daughter in a wedding-like ballgown,\" Klein said. \"But I actually find myself also thinking about what that means when you have your headship transferred over to your husband and what the girl has internalized from that.\"\n\nBooks like 1997's \"I Kissed Dating Goodbye\" by Joshua Harris helped spark the purity movement among many Christians, promoting a strict view of teaching abstinence before marriage.\n\nBut now, years later, Harris has pulled his once-popular book from circulation and has apologized for any role it may have played in causing harm. Harris no longer considers himself a Christian, according to The New York Times.\n\nJohnson's participation in the 2015 news segment is the latest example of the previously little-known legislator's staunchly conservative views, which have informed his political career and rise in Congress.\n\n\"Someone asked me today in the media, they said, 'It's curious, people are curious: What does Mike Johnson think about any issue under the sun?' I said, 'Well, go pick up a Bible off your shelf and read it. That's my worldview,'\" Johnson said in a recent Fox News interview.\n\nABC News previously reported on how Johnson, a Republican, has faced a litany of criticism from the left since clinching the speakership, including over his long history of working to curb gay rights, as well as his efforts to overturn the 2020 election on behalf of President Donald Trump.\n\nHowever, many Republican legislators and activists have championed what they describe as his strong Christian beliefs.\n\n\"We are just getting started, but people are going to come to know and love what he represents because he fights for things bigger than himself,\" Rep. Steve Scalise told reporters about Johnson after he was elected speaker.\n\nCNN recently reported that Johnson advocated for revisiting Supreme Court rulings related to contraception, gay sex bans, and same-sex marriage legalization, based on an analysis of over 100 of Johnson's interviews, speeches, and public comments throughout his career. When asked about Johnson's post-Roe comments, a spokesperson for Johnson told CNN that he \"views the cases as settled law.\"\n\n\"One of the primary purposes of the law in civil government is to restrain evil,\" Johnson said on one radio show in 2010, according to CNN. \"We have to acknowledge collectively that man is inherently evil and needs to be restrained.\"\n\nJohnson echoed that language in the German TV segment.\n\n\"There are predators out there, and there are prey,\" Johnson, dressed in a tuxedo, said in an interview at the purity ball, adding that he hopes his daughter will \"try and steer clear of the wolves like that.\"\n\n"
    },
    "ABC News-1": {
        "source": "ABC News",
        "category": "US News",
        "title": "His dad murdered his mom on an African safari. Now he says the US government is 'hell-bent' on taking what's left",
        "date": "No Date Found",
        "image_url": "https://i.abcnewsfe.com/a/d148c368-db02-4b73-bf76-79e1586ce384/Larry-Rudolph-ht-gmh-231218_1702925456885_hpMain_16x9.jpg",
        "image_path": "data/ABC News-1.png",
        "body": "Speaking out for the first time, the son of a wealthy Pennsylvania dentist who murdered his own wife on an African vacation -- and then tried to cover it up -- says he didn't believe his father, Larry Rudolph, could do such a thing until he saw \"horrifying\" photos from the scene and heard soul-crushing testimony at trial last year.\n\nIn an exclusive interview with ABC News, Julian Rudolph said his father now calls him from federal prison, where he's serving a life sentence, but Julian \"very rarely\" picks up, unable to forgive the man convicted of fatally shooting Bianca Rudolph in 2016 so he could collect nearly $5 million in life insurance and live freely with his longtime mistress.\n\n\"It's incomprehensible to me,\" said Julian, now 33.\n\nBut what Julian described as equally incomprehensible is the battle he's been waging with the U.S. government for much of the past year.\n\n\"They're treating my sister and I more like perpetrators than surviving victims of a violent crime,\" he said.\n\nJulian and his sister, AnaBianca, have been trying to recover millions of dollars they believe their father took from them after their mother's death. However, as the Justice Department sees it, several insurance companies were the ones defrauded out of millions of dollars, leading federal authorities to seize the bulk of Larry Rudolph's known assets and then move to reimburse the insurance companies.\n\nComplicating matters even more, Larry Rudolph's fortune had been slashed, allegedly by lavish spending before his arrest and by mounting legal woes afterward, so Julian and his sister insist that most of whatever's left should be theirs, not the federal government's. They accuse the Justice Department of hampering their recovery efforts, rather than helping them.\n\nThe Justice Department has maintained -- and two federal courts have so far agreed -- that it's just following the law and seeking justice for everyone affected.\n\n\"[Our] goal is to ensure that Lawrence Rudolph does not profit from a heinous crime,\" the U.S. attorney's office in Colorado, which is handling Rudolph's case, said in a statement to ABC News. \"The Department of Justice is working in good faith with attorneys for the children of the victim to resolve disputes over how that goal can best be accomplished.\"\n\nLarry Rudolph has said he wants the money seized to go to his children.\n\nThe ongoing dispute involves complicated issues of fairness, a clash of narrow legal arguments, and -- as one federal judge put it -- two sides who at times are \"speaking past each other.\"\n\nThat federal judge, who previously ruled against Julian and his sister, is now reevaluating the case and weighing whether to appoint a mediator.\n\nIn his interview with ABC News, Julian said there's more to it all than just the language of the law, noting that prosecutors have the authority to exercise \"discretion\" in enforcing the law.\n\n\"It's a matter of right and wrong,\" he said. \"I think we've been through enough.\"\n\nFrom what Julian said he remembers about growing up outside Pittsburgh, it was \"a pretty normal\" suburban life, with a seemingly \"peaceful\" home.\n\nHe said Larry Rudolph, now 68, was \"a good father,\" often \"generous\" and \"charismatic.\" And as a successful dentist, his father \"worked a lot,\" which allowed Bianca Rudolph to stay at home with Julian and his sister, according to Julian.\n\n\"She was an amazing mother,\" Julian said, choking up when first talking about her. \"I loved her. She was my best friend.\"\n\nJulian said he always had questions about exactly what happened in Africa, but his father insisted it was an accident and refused to talk about it whenever they would see each other.\n\nAs Julian understood it at the time, both of his parents, who moved to Arizona a few years earlier, had become avid hunters, and in October 2016 they jetted off to a remote nature preserve in the southern African country of Zambia to shoot wild game there.\n\nOn the final day of the trip, Bianca Rudolph suffered a fatal blast to the chest. Larry Rudolph claimed she accidentally shot herself while packing her shotgun to come home.\n\n\"And who wouldn't want to believe that?\" Julian said.\n\nIn the wake of the tragedy, he and his father would only see each other about once a year. Julian was living in Miami, building a personal injury law practice there. His sister was in Pittsburgh, pursuing her own dental career at her father's practice. And Larry Rudolph was still in Arizona, living what Julian saw as a \"nice lifestyle\" with someone he thought was a new girlfriend, Lori Milliron.\n\nHowever, Julian's \"unanswered questions\" lingered, he said.\n\nThen in late 2021, more than five years after Bianca Rudolph's death, the FBI arrested Larry Rudolph on murder and fraud charges.\n\nHe maintained to his children that the FBI had it all wrong and that \"the evidence is going to prove [it],\" Julian recalled.\n\n\"Of course you want to believe that what you're hearing is the truth,\" he added.\n\nSo when Larry Rudolph then asked a federal judge to release him from jail pending trial, both Julian and his sister, AnaBianca, submitted sworn affidavits to the court, expressing their full support for their father.\n\n\"[We] know him better than anyone else, and we know that he is innocent,\" they wrote.\n\nJulian told ABC News that he feels quite differently now.\n\n\"I can't stand by that original statement, because that was before we saw the evidence in the trial,\" he said.\n\nIt's unclear if Julian's sister agrees. She previously declined ABC News requests for an interview and, through Julian, recently declined again.\n\nLarry Rudolph's trial, held in a Denver federal courtroom last year, lasted more than two weeks. Julian and AnaBianca attended all of it.\n\n\"Every day going into that courtroom, I saw something new that broke my heart,\" Julian said.\n\nProsecutors detailed a diabolical plot and a life of lies: Milliron had secretly been Larry Rudolph's mistress for more than a decade. And on the hunting trip to Zambia in 2016, prosecutors said, Larry Rudolph shot his wife so he could collect her life insurance and fund a lavish new life with Milliron, who helped him try to cover it all up. She was convicted alongside Larry Rudolph, sentenced to 17 years in prison for acting as his accessory and for lying to investigators.\n\nProsecutors during the trial presented witness testimony, ballistics tests, and photos from the scene, including photos of Bianca Rudolph's bloody body.\n\n\"Nothing could have prepared us for those visuals, for that testimony,\" Julian said. \"It was horrific.\"\n\nAt the same time, according to Julian, \"the trial was eye-opening,\" and the evidence presented \"brought a lot of clarity and answered a lot of questions for us.\"\n\nFor that, he said, he's eternally \"grateful\" to the federal prosecutors, FBI agents and other U.S. officials who worked on the case and uncovered the truth.\n\nBut some of those same prosecutors are now the ones Julian said are \"hell-bent on fighting us in court.\"\n\nAfter Larry Rudolph murdered his wife, he kept the entire $14 million fortune they had built together over 34 years, even though half of that fortune should have become the property of her estate and passed on to Julian and his sister. Larry Rudolph also collected $4.8 million in life insurance claims from seven different companies, falsely telling them that Bianca had died in an accident.\n\nWhen the Justice Department uncovered Larry Rudolph's murderous scheme, it seized the bulk of his known remaining assets: two multimillion-dollar homes, two luxury cars, and $4.8 million still in bank accounts.\n\nBut lawyers for Larry Rudolph objected in January when the Justice Department proposed using a portion of those seized assets to reimburse the seven insurance companies he defrauded. His lawyers argued in court filings that, had Larry Rudolph not lied about his wife's death, the companies would have still paid out millions, but to his children as the beneficiaries behind their since-disqualified father.\n\nSo, Rudolph's lawyer's claimed, to now repay the insurance companies, instead of Julian and AnaBianca, \"would only serve to harm\" the children.\n\nEight days later, lawyers for Julian and his sister filed their own documents in court, similarly arguing that Julian and his sister should receive the insurance proceeds because under U.S. law they were the ultimate \"victims\" of their father's fraud. That argument failed in court, including on appeal.\n\nIn June, lawyers for Julian and AnaBianca filed revamped legal claims -- this time substantially based on Arizona state law -- seeking not only the insurance proceeds but also a share of Rudolph's confiscated homes and cars, and any money made from selling them, which the lawyers say have appreciated in value.\n\nUnder Arizona law, the key question is who those assets \"justly belong to,\" and allowing anyone but Bianca Rudolph's children to obtain them \"would be unconscionable,\" the lawyers argued in a filing two weeks ago.\n\nThey noted that an Arizona judge recently ordered Larry Rudolph to repay his children the nearly $7 million he took from their mother's estate, plus more than $3 million in estimated interest. And while they've found additional money to cover less than half of that total judgment, the assets seized by the Justice Department are \"the only remaining source\" for Julian and his sister to recover the rest, wrote John Sandweg and Chris Hotaling of the firm Nixon Peabody.\n\nAs part of his sentence, Larry Rudolph was also ordered to pay a $2 million fine, in addition to serving life behind bars and paying the insurance companies $4.8 million in restitution.\n\nIn court two weeks ago, Julian and AnaBianca's lawyers submitted statements from five of those companies -- accounting for three-quarters of the insurance proceeds at issue -- saying that the money they paid out rightfully belongs to Julian and his sister.\n\nThe federal government shouldn't \"profit from our mother's death,\" Julian told ABC News. \"It's the principle,\" he said. \"This is not about money.\"\n\nThe Justice Department disputes that it's trying to profit in any way from Bianca Rudolph's death, and in court documents it has accused Julian and his sister of \"attempting to shortcut\" the \"appropriate procedure,\" saying that if they are the rightful beneficiaries of the insurance policies, they can obtain the money they seek by filing their own claims directly with the insurance companies.\n\nIn an order last month, Senior U.S. District Court Judge William Martinez said he is highly skeptical of Julian and his sister's latest legal arguments, but he also said there are \"issues plaguing both sides,\" and that \"it is only fair to permit both parties a second bite at the apple.\"\n\n\"[I]t would be vastly preferable, and almost certainly far easier for all involved, if the parties could come to an agreement ... without the Court's involvement,\" Martinez added, saying that, even as he weighs the new legal arguments, he is considering whether to appoint an outside mediator to resolve the whole matter.\n\nIn his interview with ABC News, Julian said he's thought \"many times\" about just abandoning his legal battle with the Justice Department.\n\n\"I've said to myself, 'Just move on with your life,'\" he recalled. \"This has been a waking nightmare.\"\n\nBut he said he then remembers his mother, his sister, and the children he hopes to have with his fiancée -- children who will never meet their grandmother, Bianca Rudolph.\n\n\"I owe it to [all of them] to be here to fight,\" he said. \"I want to move on with my life ... but we have to get through this last step.\"\n\nAs for what moving on with his life looks like, Julian said he and his fiancée are planning to elope -- in part, at least, because of what would be missing if they had a more traditional wedding.\n\n\"Nothing will ever bring my mother back. Nothing will bring my father back,\" he said.\n\nABC News' Eva Pilgrim, Mike Repplier and Lindsey Schwartz also contributed to this report.\n\n"
    },
    "ABC News-2": {
        "source": "ABC News",
        "category": "US News",
        "title": "Nationwide swatting spree targeting Jewish institutions appears coordinated, coming from outside US: FBI ",
        "date": "No Date Found",
        "image_url": "https://i.abcnewsfe.com/a/b572a43b-d1ee-4df1-a5d9-8e62a0eea564/fbi-building-gty-lv-231219_1703038198469_hpMain.jpg",
        "image_path": "data/ABC News-2.png",
        "body": "A nationwide swatting spree targeting nearly 200 Jewish institutions over the weekend appears to have been a coordinated effort by an entity based outside the United States, the Federal Bureau of Investigation's top spokesperson said in a confidential memo to partner law enforcement agencies.\n\nThe communication, written by Assistant FBI Director Cathy Milhoan, and obtained by ABC News, says, \"At this time, based on similar language and specific email tradecraft used, it appears the perpetrators of these threats are connected. Additionally, these threats appear to be originating from outside of the United States.\"\n\nMilhoan continued, \"To date, none of these email threats have involved any actual explosive devices or credible risk of harm to congregants.\"\n\nMore than 30 of the 56 FBI field offices are investigating the threats, which violated multiple federal laws, according to Milhoan.\n\nA \"record number\" of 199 swatting incidents and false bomb threats were tracked between Friday and Saturday by the Secure Community Network, a non-profit that advises U.S. Jewish institutions on safety and security.\n\nThe non-profit tracked the swatting spree across multiple states, including 93 in California, 62 in Arizona, 15 in Connecticut, five in Colorado, and four in Washington state, according to a press release.\n\nAccording to SCN, swatting incidents are up over 540% from 2022, with more than 449 swatting incidents and bomb threats taking place this year.\n\nOctober and November have seen a 290% rise since last year, \"with a record 772 incidents logged,\" according to SCN's press release.\n\n\"The safety of all faith-based communities is one of the FBI's highest priorities. Once again, thank you for your partnership and your collaboration to keep our communities safe,\" Milhoan ended the letter.\n\n"
    },
    "ABC News-3": {
        "source": "ABC News",
        "category": "US News",
        "title": "Federal judge orders documents naming Jeffrey Epstein's associates to be unsealed",
        "date": "No Date Found",
        "image_url": "https://s.abcnews.com/images/US/epstein_hpEmbed_20220311-184030_3x4_992.jpg",
        "image_path": "data/ABC News-3.png",
        "body": "A federal judge in New York has ordered a vast unsealing of court documents in early 2024 that will make public the names of scores of Jeffrey Epstein's associates.\n\nThe documents are part of a settled civil lawsuit alleging Epstein's one-time paramour Ghislaine Maxwell facilitated the sexual abuse of Virginia Giuffre. Terms of the 2017 settlement were not disclosed.\n\nMaxwell is currently serving a 20-year prison sentence after she was convicted of sex trafficking and procuring girls for Epstein, who died by suicide in 2019 in a Manhattan jail while awaiting trial on federal sex trafficking charges.\n\nAnyone who did not successfully fight to keep their name out of the civil case could see their name become public -- including Epstein's victims, co-conspirators and innocent associates.\n\nJudge Loretta Preska set the release for Jan. 1, giving anyone who objects to their documents becoming public time to object. Her ruling, though, said that since some of the individuals have given media interviews their names should not stay private.\n\nThe documents may not make clear why a certain individual became associated with Giuffre's lawsuit, but more than 150 people are expected to be identified in hundreds of files that may expose more about Epstein's sex trafficking of women and girls in New York, New Mexico, the U.S. Virgin Islands and elsewhere. Some of the names may simply have been included in depositions, email or legal documents.\n\nSome of the people have already been publicly associated with Epstein. For instance, Harvard law professor Alan Dershowitz is publicly named in the judge's order. Certain minor victims will remain redacted.\n\nMaxwell, a longtime associate of Epstein, was convicted in 2021 of conspiring with Epstein to recruit, groom and abuse minors. In February, she asked the court to overturn her conviction and 20-year prison sentence.\n\nProsecutors subsequently urged a federal appeals court in June to uphold the conviction.\n\nFrom 1994 to 2004, Maxwell and Epstein worked together to identify girls, groom them and then entice them to travel and transport them to Epstein's properties in New York, Florida, New Mexico, and elsewhere, prosecutors said. The girls -- some of whom were as young as 14 years old -- were then sexually abused, often under the guise of a \"massage,\" they said.\n\nGiuffre alleged in her lawsuit against Maxwell that Maxwell recruited her at the age of 16 to years of sexual servitude to Epstein. She also accused Maxwell and Epstein of directing her, between 2000 to 2002, to have sex with a number of their prominent associates, most famously Britain's Prince Andrew. The lawsuit was settled in May 2017, just before a trial was to begin.\n\nPrince Andrew had repeatedly denied the allegations and attacked Giuffre's credibility and motives. He agreed to settle a sexual assault lawsuit from Giuffre last year for an undisclosed sum.\n\n\"Prince Andrew has never intended to malign Ms. Giuffre's character, and he accepts that she has suffered both as an established victim of abuse and as a result of unfair public attacks,\" according to a letter filed from Giuffre's lawyer. \"It is known that Jeffrey Epstein trafficked countless young girls over many years. Prince Andrew regrets his association with Epstein, and commends the bravery of Ms. Giuffre and other survivors in standing up for themselves and others.\"\n\n"
    },
    "ABC News-4": {
        "source": "ABC News",
        "category": "US News",
        "title": "California faces dangerous holiday travel conditions as storm hits coast: Latest forecast",
        "date": "No Date Found",
        "image_url": "https://i.abcnewsfe.com/a/c5ff6c0e-19c7-4ae5-a269-3a259715bfb2/west-coast-storm_1703104233317_hpEmbed_16x9.jpg",
        "image_path": "data/ABC News-4.png",
        "body": "A powerful rain storm is hitting the California coast causing dangerous travel conditions as the holiday rush begins.\n\nSignificant travel delays and road closures are likely, as there's a high risk of road flooding, especially in low-lying areas. Mudslides are also possible.\n\nThe storm will last from Wednesday to Friday.\n\nTwo to 5 inches of rain is forecast for the Los Angeles area. Five to 10 inches of rainfall is likely on and below south facing foothills and coastal slopes.\n\nThe National Weather Service issued its second-highest flood threat forecast for Santa Barbara and Ventura counties, which are the bull's-eye of the storm.\n\nA flood watch is in effect from the San Luis Obispo area in central California down to San Diego.\n\nFlash flooding is possible in and around recent burn scars (spots damaged by wildfires).\n\nDrivers should also be mindful of wind gusts, which could reach 50 mph.\n\nBy Friday night, the rain will end in Southern California and move east to Arizona. Flooding is possible in Phoenix.\n\n"
    },
    "ABC News-5": {
        "source": "ABC News",
        "category": "US News",
        "title": "Detroit officer accused of fatally punching 71-year-old man charged with manslaughter",
        "date": "No Date Found",
        "image_url": "https://i.abcnewsfe.com/a/20ba32b4-77f3-44ea-a401-7e2807e5ce58/detroit-cop-ho-mo-20231220_1703102193047_hpMain_4x3.JPG",
        "image_path": "data/ABC News-5.png",
        "body": "A Detroit police officer was charged with manslaughter for allegedly punching a 71-year-old man who prosecutors say then fell and hit his head and died from his injuries several weeks later.\n\nJuwan Marquise-Alexander Brown, 29, pleaded not guilty during his arraignment Wednesday morning. Brown said only his name during the hearing, which was conducted over Zoom. The magistrate entered a not guilty plea on his behalf.\n\nThe charge stems from an incident that occurred the evening of Sept. 1 while Brown was on duty. He had been dispatched to a Detroit bowling alley following a call that the victim -- Daryl Vance, of Detroit -- was being \"disorderly,\" the Wayne County Prosecutor's Office said.\n\nA \"verbal confrontation\" between Brown and Vance \"escalated,\" and the officer allegedly punched the victim in the face, causing him to fall and hit his head on the pavement, the prosecutor's office said.\n\nEmergency responders arrived and transported the victim to a local hospital for treatment, where he died on Sept. 21, the prosecutor's office said. The Wayne County Medical Examiner determined his death was caused by blunt force trauma to his head from the punch, according to the prosecutor's office.\n\nWayne County Prosecutor Kym Worthy charged Brown with manslaughter. He faces a 15-year sentence if convicted.\n\n\"Police officers frequently deal with citizens who are disorderly and verbally unpleasant. But the evidence in this case shows that the officer allegedly was the aggressor, and his actions went criminally beyond what was necessary in this situation,\" Worthy said in a statement. \"This behavior cannot be tolerated from our law enforcement.\"\n\nThe Detroit Police Department said Brown was terminated \"as a result of his actions\" in the incident though is exercising his contractual right to appeal the decision.\n\n\"During the pendency of an appeal, if sought, Mr. Brown will remain off DPD payroll and will not possess any law enforcement authority,\" the department said in a statement.\n\n\"The DPD will cooperate fully with Prosecutor Worthy's efforts toward obtaining a conviction for the charged offenses,\" the statement continued.\n\nDuring his arraignment on Wednesday, Brown's attorney, Matthew Forrest, had asked for a personal bond, arguing that the defendant has no criminal history and has been employed as a Detroit police officer for approximately seven years. He has extensive ties to the Detroit area and a 7-year-old son, Forrest said.\n\n\"When we were made aware that charges were filed, we arranged to have Mr. Brown turn himself in to be arraigned today,\" Forrest told the court. \"He is certainly not a flight risk. He is not a danger to the community. We would ask for a personal bond so that Mr. Brown can go back with his son.\"\n\nThe state asked for a \"reasonable\" bond left to the court's discretion.\n\nMagistrate William Burton ultimately set a $100,000 personal bond and said Brown is not to possess any weapons or have contact with any witnesses or the victim's family.\n\nA probable cause conference in the case has been scheduled for Jan. 3.\n\n"
    },
    "ABC News-6": {
        "source": "ABC News",
        "category": "US News",
        "title": "'Devastated': Passengers speak out after Bahamas-bound cruise diverted to New England, Canada over weather",
        "date": "No Date Found",
        "image_url": "https://i.abcnewsfe.com/a/7c1ccc0c-8a5d-4c3f-8a9e-95b360a041f9/cruise-ship-gty-jt-231219_1703022103718_hpMain.jpg",
        "image_path": "data/ABC News-6.png",
        "body": "Passengers of a cruise who were expecting a sunny getaway in the Bahamas this week were instead sailed to a much colder climate due to severe weather.\n\nThe MSC Meraviglia was forced to sail from Brooklyn, New York, to ports in New England and Canada on Saturday instead of its original destination in the Bahamas \"due to unseasonable and rapidly worsening weather that would have made it impossible to safely reach the southern Atlantic Ocean from New York City,\" the MSC cruise line said in a statement to ABC News.\n\nThe move came after heavy storms struck the East Coast and the Bahamas causing flooding, power outages and several deaths.\n\n\"The only alternative would have been to take the more extreme step of canceling the cruise -- and thousands of people's vacations -- outright,\" MSC said.\n\n\"The complexities involved in obtaining last-minute berths for unplanned stops and provisioning the ship along its new route left sailing to Canada and New England as the only viable option,\" the cruise line added.\n\nMSC also said it offered passengers a choice of sailing to the new destinations or canceling for future credit, \"which allows them to put the full value paid for this cruise toward another at their convenience.\"\n\nThe MSC Meraviglia is slated to arrive in the Port of Saint John in Canada on Thursday, the port wrote on X, the platform formerly known as Twitter.\n\nSpeaking to \"Good Morning America,\" Lakeya Allen, who said she arranged the trip with her best friend Val Montgomery as a joint family holiday to the Bahamas, said she was \"devastated\" by the divergence of the course.\n\n\"Good Morning America\" airs at 7 a.m. ET on ABC.\n\n\"So this is some of my kids' Christmas gifts,\" she said. \"[T]his was like, 'Hey, you guys, you got to go to [the] Bahamas.' We're from Chicago, so we wanted to change the weather. I never fathomed that we will be back in cold weather.\"\n\nAllen and Montgomery said they have been planning for the trip for almost a year, since last February.\n\n\"When they first sent out that message, I wish they would have given us options right in that message and we could at least have a choice,\" Montgomery told ABC News. \"We didn't have a choice at all.\"\n\nAllen also said they were given such short notice about the decision to change course, saying, \"It was beyond short. Yeah, it was unexpected.\"\n\nAs for the cruise, Montgomery said it's getting \"a little depressing because you can imagine as we’re making the most of it, but most people are walking around in coats, gloves and hats.\"\n\nThe cruise ship can accommodate up to 5,624 passengers and 1,608 crew members, the cruise line says on its website. It was unclear how many passengers were aboard the rerouted Bahamas cruise.\n\nChris Gray Faust, executive editor of review site Cruise Critic, told ABC News this kind of scenario and decision to change the cruise's itinerary is \"not necessarily out of the question,\" and that some other cruise lines were reportedly impacted by the inclement weather.\n\nFaust said that cruise lines typically have a \"contract of carriage\" clause that doesn't guarantee the ports the ship will travel to and allows the cruise operator to change the itinerary for various issues, including weather.\n\n\"Generally weather in December is fairly stable in Florida and the Bahamas, but it has been rough last weekend in particular,\" she said.\n\n"
    },
    "ABC News-7": {
        "source": "ABC News",
        "category": "US News",
        "title": "Charges dismissed against couple months after forceful arrest was caught on video at a Kenosha Applebee’s ",
        "date": "No Date Found",
        "image_url": "https://i.abcnewsfe.com/a/17294b08-f4c7-48b6-9fbf-a1a3a8d750bb/main-kenosha-arrest-applebees-police-03-ht-jt-230812_1691866168154_hpMain_16x9.jpg?w=992",
        "image_path": "data/ABC News-7.png",
        "body": "A Kenosha County Circuit Court dismissed charges against a couple who were forcefully arrested while eating dinner at an Applebee's with their 1-year-old child earlier this year.\n\nThe couple, Jermelle English, Jr. and Shanya Boyd, were dining with their son on July 20, when the police wrongfully suspected them of fleeing a nearby hit-and-run. The incident was caught on cell phone video.\n\nIn the video, obtained by ABC News, Kenosha police can be seen attempting to restrain English, while he still has his baby in his arms. In the viral video an Applebee's employee can be heard yelling, \"Get the baby,\" and \"Careful, the baby's head.\"\n\nAfter an employee successfully grabbed the baby from English, the officers tackled him to the ground and began to hit him several times, pinning him down, according to the video.\n\nAccording to the original complaint obtained by ABC News, the officer was looking for \"an African American male and African American female\" with a baby who had \"run toward Kohl's or Menards,\" the complaint says. The woman was described as wearing a red shirt with a bun on top of her head.\n\nThe officers later found the actual suspects hiding in the bathroom of the Applebee's.\n\nDespite not being the suspects officers were searching for, English and Boyd were both charged with resisting arrest and disorderly conduct, according to the charging docs. Boyd was also charged with possession of THC.\n\nAll charges against the couple were dismissed on Wednesday, court records show.\n\nEnglish was represented by Team Roc attorney Alex Spiro. Team Roc is a social justice organization and division of Roc Nation which is owned by Jay-Z.\n\nIn a statement to ABC News, Team ROC managing director Dania Diaz said English was the victim of racial profiling and should have never been charged in the first place.\n\n\"The officers' treatment of Jermelle and his family was unacceptable, unethical and traumatic,\" the statement said. \"Our hope is that today's development will allow Jermelle and his family to enjoy the holidays with some peace of mind and begin the process of healing after enduring such an incredibly painful experience.\"\n\nAfter the incident, Kenosha Police launched an internal investigation to determine whether the use of force was excessive.\n\nKenosha police announced in November both officers were found to have violated protocol. One officer received a four-day suspension and the other officer received a 10-day suspension, the statement said.\n\n\"The Kenosha Police Department is committed to providing the highest quality service to its citizens and guests. We strive to train our officers to the highest standard and will hold them accountable if they fall short of those standards,\" Kenosha police wrote in a statement.\n\n\"In addition to the suspension time, both officers are receiving supplemental training to correct the deficiencies that were identified in their response to this situation.\"\n\nABC News' Armando Garcia contributed to this report.\n\n"
    },
    "ABC News-8": {
        "source": "ABC News",
        "category": "US News",
        "title": "FBI investigating after South Carolina couple accused of harassing Black neighbors",
        "date": "No Date Found",
        "image_url": "https://i.abcnewsfe.com/a/5b1d8900-43ff-445c-a120-b2f902dd2a92/worden-butler-alexis-hartnett-ht-jt-231220_1703114129561_hpMain_4x3.jpg",
        "image_path": "data/ABC News-8.png",
        "body": "Federal agents are investigating allegations of racial discrimination after a South Carolina couple was accused of harassing and stalking their Black neighbors.\n\nThe Federal Bureau of Investigation said it executed \"court-authorized law enforcement activity\" at a residence in Conway on Wednesday.\n\n\"This action is related to an ongoing criminal civil rights investigation involving allegations of racial discrimination,\" Steve Jensen, FBI special agent in charge with the Columbia division, said in a statement.\n\n\"We are working jointly with the U.S. Attorney's Office, as well as our local and state partners, to thoroughly examine this matter, and we're dedicated to ensuring equality and fairness within our communities,\" he said.\n\nNo additional details on the ongoing investigation are being released at this time.\n\nThe FBI presence was seen at the home of a couple arrested last month for allegedly harassing their next-door neighbors.\n\nThe couple -- Worden Butler, 28, and Alexis Hartnett, 27, who are both white -- allegedly \"harassed and stalked the victims with racially motivated words and actions,\" according to a police report filed late last month.\n\nButler allegedly yelled racial slurs at one of the victims \"in reference to her being Black,\" the police report stated.\n\nOver Thanksgiving weekend, Butler and Hartnett allegedly erected a cross facing the victims' home and set it on fire, according to the police report. While the victims were being interviewed by responding officers, Hartnett allegedly used a racial slur directed toward the victims and \"continued this behavior even after being advised [by] officers to go back inside her home,\" according to the report.\n\n\"The victims feel that the suspects are a danger to their safety and the incidents are getting more frequent and threatening,\" the report stated.\n\nButler also allegedly shared on Facebook a picture of the victims' mailbox, which has their address on it, and posted, \"summoning the devil's army and I don't care if they and I both go down in the same boat,\" according to the police report.\n\nButler and Hartnett were arrested on Nov. 30 and charged with harassment in the second degree, a misdemeanor. Hartnett was also charged with assault in the third degree, a misdemeanor. They both were released the following day.\n\nABC News could not reach Butler and Hartnett and did not immediately receive a response from their attorney to a message seeking comment.\n\nHorry County Police Department Chief Joseph Hil called the reported incidents \"appalling and unacceptable.\"\n\n\"Such hate and harassment will not be tolerated in Horry County,\" Hill said in a statement last week. \"The individuals responsible will be held accountable for their actions and the hurt they have caused the victims and the greater Horry County community. In concert with our local and regional partners, we will pursue justice to the fullest extent of the law.\"\n\nSouth Carolina does not have a law allowing extra punishment for hate crimes.\n\nIn the past three years, a hate crime bill has made it through the South Carolina State House but stalled on the Senate floor, according to The Associated Press.\n\nIn the wake of the couple's arrest, organizations including the NAACP and the Council on American-Islamic Relations have called for a hate crime bill in South Carolina.\n\n"
    },
    "ABC News-9": {
        "source": "ABC News",
        "category": "US News",
        "title": "His dad murdered his mom on an African safari. Now he says the US government is 'hell-bent' on taking what's left",
        "date": "No Date Found",
        "image_url": "https://i.abcnewsfe.com/a/d148c368-db02-4b73-bf76-79e1586ce384/Larry-Rudolph-ht-gmh-231218_1702925456885_hpMain_16x9.jpg",
        "image_path": "data/ABC News-9.png",
        "body": "Speaking out for the first time, the son of a wealthy Pennsylvania dentist who murdered his own wife on an African vacation -- and then tried to cover it up -- says he didn't believe his father, Larry Rudolph, could do such a thing until he saw \"horrifying\" photos from the scene and heard soul-crushing testimony at trial last year.\n\nIn an exclusive interview with ABC News, Julian Rudolph said his father now calls him from federal prison, where he's serving a life sentence, but Julian \"very rarely\" picks up, unable to forgive the man convicted of fatally shooting Bianca Rudolph in 2016 so he could collect nearly $5 million in life insurance and live freely with his longtime mistress.\n\n\"It's incomprehensible to me,\" said Julian, now 33.\n\nBut what Julian described as equally incomprehensible is the battle he's been waging with the U.S. government for much of the past year.\n\n\"They're treating my sister and I more like perpetrators than surviving victims of a violent crime,\" he said.\n\nJulian and his sister, AnaBianca, have been trying to recover millions of dollars they believe their father took from them after their mother's death. However, as the Justice Department sees it, several insurance companies were the ones defrauded out of millions of dollars, leading federal authorities to seize the bulk of Larry Rudolph's known assets and then move to reimburse the insurance companies.\n\nComplicating matters even more, Larry Rudolph's fortune had been slashed, allegedly by lavish spending before his arrest and by mounting legal woes afterward, so Julian and his sister insist that most of whatever's left should be theirs, not the federal government's. They accuse the Justice Department of hampering their recovery efforts, rather than helping them.\n\nThe Justice Department has maintained -- and two federal courts have so far agreed -- that it's just following the law and seeking justice for everyone affected.\n\n\"[Our] goal is to ensure that Lawrence Rudolph does not profit from a heinous crime,\" the U.S. attorney's office in Colorado, which is handling Rudolph's case, said in a statement to ABC News. \"The Department of Justice is working in good faith with attorneys for the children of the victim to resolve disputes over how that goal can best be accomplished.\"\n\nLarry Rudolph has said he wants the money seized to go to his children.\n\nThe ongoing dispute involves complicated issues of fairness, a clash of narrow legal arguments, and -- as one federal judge put it -- two sides who at times are \"speaking past each other.\"\n\nThat federal judge, who previously ruled against Julian and his sister, is now reevaluating the case and weighing whether to appoint a mediator.\n\nIn his interview with ABC News, Julian said there's more to it all than just the language of the law, noting that prosecutors have the authority to exercise \"discretion\" in enforcing the law.\n\n\"It's a matter of right and wrong,\" he said. \"I think we've been through enough.\"\n\nFrom what Julian said he remembers about growing up outside Pittsburgh, it was \"a pretty normal\" suburban life, with a seemingly \"peaceful\" home.\n\nHe said Larry Rudolph, now 68, was \"a good father,\" often \"generous\" and \"charismatic.\" And as a successful dentist, his father \"worked a lot,\" which allowed Bianca Rudolph to stay at home with Julian and his sister, according to Julian.\n\n\"She was an amazing mother,\" Julian said, choking up when first talking about her. \"I loved her. She was my best friend.\"\n\nJulian said he always had questions about exactly what happened in Africa, but his father insisted it was an accident and refused to talk about it whenever they would see each other.\n\nAs Julian understood it at the time, both of his parents, who moved to Arizona a few years earlier, had become avid hunters, and in October 2016 they jetted off to a remote nature preserve in the southern African country of Zambia to shoot wild game there.\n\nOn the final day of the trip, Bianca Rudolph suffered a fatal blast to the chest. Larry Rudolph claimed she accidentally shot herself while packing her shotgun to come home.\n\n\"And who wouldn't want to believe that?\" Julian said.\n\nIn the wake of the tragedy, he and his father would only see each other about once a year. Julian was living in Miami, building a personal injury law practice there. His sister was in Pittsburgh, pursuing her own dental career at her father's practice. And Larry Rudolph was still in Arizona, living what Julian saw as a \"nice lifestyle\" with someone he thought was a new girlfriend, Lori Milliron.\n\nHowever, Julian's \"unanswered questions\" lingered, he said.\n\nThen in late 2021, more than five years after Bianca Rudolph's death, the FBI arrested Larry Rudolph on murder and fraud charges.\n\nHe maintained to his children that the FBI had it all wrong and that \"the evidence is going to prove [it],\" Julian recalled.\n\n\"Of course you want to believe that what you're hearing is the truth,\" he added.\n\nSo when Larry Rudolph then asked a federal judge to release him from jail pending trial, both Julian and his sister, AnaBianca, submitted sworn affidavits to the court, expressing their full support for their father.\n\n\"[We] know him better than anyone else, and we know that he is innocent,\" they wrote.\n\nJulian told ABC News that he feels quite differently now.\n\n\"I can't stand by that original statement, because that was before we saw the evidence in the trial,\" he said.\n\nIt's unclear if Julian's sister agrees. She previously declined ABC News requests for an interview and, through Julian, recently declined again.\n\nLarry Rudolph's trial, held in a Denver federal courtroom last year, lasted more than two weeks. Julian and AnaBianca attended all of it.\n\n\"Every day going into that courtroom, I saw something new that broke my heart,\" Julian said.\n\nProsecutors detailed a diabolical plot and a life of lies: Milliron had secretly been Larry Rudolph's mistress for more than a decade. And on the hunting trip to Zambia in 2016, prosecutors said, Larry Rudolph shot his wife so he could collect her life insurance and fund a lavish new life with Milliron, who helped him try to cover it all up. She was convicted alongside Larry Rudolph, sentenced to 17 years in prison for acting as his accessory and for lying to investigators.\n\nProsecutors during the trial presented witness testimony, ballistics tests, and photos from the scene, including photos of Bianca Rudolph's bloody body.\n\n\"Nothing could have prepared us for those visuals, for that testimony,\" Julian said. \"It was horrific.\"\n\nAt the same time, according to Julian, \"the trial was eye-opening,\" and the evidence presented \"brought a lot of clarity and answered a lot of questions for us.\"\n\nFor that, he said, he's eternally \"grateful\" to the federal prosecutors, FBI agents and other U.S. officials who worked on the case and uncovered the truth.\n\nBut some of those same prosecutors are now the ones Julian said are \"hell-bent on fighting us in court.\"\n\nAfter Larry Rudolph murdered his wife, he kept the entire $14 million fortune they had built together over 34 years, even though half of that fortune should have become the property of her estate and passed on to Julian and his sister. Larry Rudolph also collected $4.8 million in life insurance claims from seven different companies, falsely telling them that Bianca had died in an accident.\n\nWhen the Justice Department uncovered Larry Rudolph's murderous scheme, it seized the bulk of his known remaining assets: two multimillion-dollar homes, two luxury cars, and $4.8 million still in bank accounts.\n\nBut lawyers for Larry Rudolph objected in January when the Justice Department proposed using a portion of those seized assets to reimburse the seven insurance companies he defrauded. His lawyers argued in court filings that, had Larry Rudolph not lied about his wife's death, the companies would have still paid out millions, but to his children as the beneficiaries behind their since-disqualified father.\n\nSo, Rudolph's lawyer's claimed, to now repay the insurance companies, instead of Julian and AnaBianca, \"would only serve to harm\" the children.\n\nEight days later, lawyers for Julian and his sister filed their own documents in court, similarly arguing that Julian and his sister should receive the insurance proceeds because under U.S. law they were the ultimate \"victims\" of their father's fraud. That argument failed in court, including on appeal.\n\nIn June, lawyers for Julian and AnaBianca filed revamped legal claims -- this time substantially based on Arizona state law -- seeking not only the insurance proceeds but also a share of Rudolph's confiscated homes and cars, and any money made from selling them, which the lawyers say have appreciated in value.\n\nUnder Arizona law, the key question is who those assets \"justly belong to,\" and allowing anyone but Bianca Rudolph's children to obtain them \"would be unconscionable,\" the lawyers argued in a filing two weeks ago.\n\nThey noted that an Arizona judge recently ordered Larry Rudolph to repay his children the nearly $7 million he took from their mother's estate, plus more than $3 million in estimated interest. And while they've found additional money to cover less than half of that total judgment, the assets seized by the Justice Department are \"the only remaining source\" for Julian and his sister to recover the rest, wrote John Sandweg and Chris Hotaling of the firm Nixon Peabody.\n\nAs part of his sentence, Larry Rudolph was also ordered to pay a $2 million fine, in addition to serving life behind bars and paying the insurance companies $4.8 million in restitution.\n\nIn court two weeks ago, Julian and AnaBianca's lawyers submitted statements from five of those companies -- accounting for three-quarters of the insurance proceeds at issue -- saying that the money they paid out rightfully belongs to Julian and his sister.\n\nThe federal government shouldn't \"profit from our mother's death,\" Julian told ABC News. \"It's the principle,\" he said. \"This is not about money.\"\n\nThe Justice Department disputes that it's trying to profit in any way from Bianca Rudolph's death, and in court documents it has accused Julian and his sister of \"attempting to shortcut\" the \"appropriate procedure,\" saying that if they are the rightful beneficiaries of the insurance policies, they can obtain the money they seek by filing their own claims directly with the insurance companies.\n\nIn an order last month, Senior U.S. District Court Judge William Martinez said he is highly skeptical of Julian and his sister's latest legal arguments, but he also said there are \"issues plaguing both sides,\" and that \"it is only fair to permit both parties a second bite at the apple.\"\n\n\"[I]t would be vastly preferable, and almost certainly far easier for all involved, if the parties could come to an agreement ... without the Court's involvement,\" Martinez added, saying that, even as he weighs the new legal arguments, he is considering whether to appoint an outside mediator to resolve the whole matter.\n\nIn his interview with ABC News, Julian said he's thought \"many times\" about just abandoning his legal battle with the Justice Department.\n\n\"I've said to myself, 'Just move on with your life,'\" he recalled. \"This has been a waking nightmare.\"\n\nBut he said he then remembers his mother, his sister, and the children he hopes to have with his fiancée -- children who will never meet their grandmother, Bianca Rudolph.\n\n\"I owe it to [all of them] to be here to fight,\" he said. \"I want to move on with my life ... but we have to get through this last step.\"\n\nAs for what moving on with his life looks like, Julian said he and his fiancée are planning to elope -- in part, at least, because of what would be missing if they had a more traditional wedding.\n\n\"Nothing will ever bring my mother back. Nothing will bring my father back,\" he said.\n\nABC News' Eva Pilgrim, Mike Repplier and Lindsey Schwartz also contributed to this report.\n\n"
    },
    "Associated Press (AP)-0": {
        "source": "Associated Press (AP)",
        "category": "US News",
        "title": null,
        "date": null,
        "image_url": null,
        "image_path": null,
        "body": null
    },
    "Associated Press (AP)-1": {
        "source": "Associated Press (AP)",
        "category": "US News",
        "title": null,
        "date": null,
        "image_url": null,
        "image_path": null,
        "body": null
    },
    "Associated Press (AP)-2": {
        "source": "Associated Press (AP)",
        "category": "US News",
        "title": null,
        "date": null,
        "image_url": null,
        "image_path": null,
        "body": null
    },
    "Associated Press (AP)-3": {
        "source": "Associated Press (AP)",
        "category": "US News",
        "title": null,
        "date": null,
        "image_url": null,
        "image_path": null,
        "body": null
    },
    "Associated Press (AP)-4": {
        "source": "Associated Press (AP)",
        "category": "US News",
        "title": null,
        "date": null,
        "image_url": null,
        "image_path": null,
        "body": null
    }
}