{
    "US News-0": {
        "url": "https://abcnews.go.com/US/wireStory/new-york-governor-commutes-sentence-rapper-dep-turned-105892590",
        "title": "NY governor commutes sentence of rapper G. Dep who turned self in for killing",
        "image_url": "https://i.abcnewsfe.com/a/f1647a2f-a240-4a0f-bb3b-10800b4f076d/g-dep-gty-jt-231223_1703356408493_hpMain_16x9.jpg?w=992",
        "body": "NEW YORK -- Rapper Travell “G. Dep” Coleman, who walked into a New York police precinct in 2010 and admitted to committing a nearly two-decade-old cold case murder to clear his conscience, has been granted clemency by Gov. Kathy Hochul.\n\nNow 49, Coleman has served 13 of a 15-year-to-life sentence. With his sentence being commuted by the Democratic governor, he will now be allowed to seek parole earlier than his original 2025 date. \n\nColeman is one of 16 individuals granted clemency by Hochul in an announcement made Friday. They include 12 pardons and four commutations. It marked the third time Hochul has granted clemency in 2023.\n\n“Through the clemency process, it is my solemn responsibility as governor to recognize the efforts individuals have made to improve their lives and show that redemption is possible,” Hochul said in a written statement. \n\nThe rapper earned an associate's degree while in prison and facilitated violence prevention and sobriety counseling programs, while also participating in a variety of educational and rehabilitative classes, according to Hochul's office. His clemency application was supported by the prosecutor in the case and the judge who sentenced him.\n\nAs G. Dep, Coleman had hits with “Special Delivery” and “Let’s Get It” and helped popularize a loose-limbed dance called the Harlem shake in the early 2000s. The rapper was one of the rising stars of hip-hop impresario Sean “Diddy” Combs’ Bad Boy Records label in the late 1990s and early 2000s. But his career slumped after his 2001 debut album, “Child of the Ghetto,\" and the rapper became mired in drug use and low-level arrests, his lawyer said in 2011. \n\nAttorney Anthony L. Ricco said at the time that Coleman “had been haunted” by the 1993 fatal shooting of John Henkel and decided to confess to shooting someone as a teenager during a robbery in East Harlem. Henkel was shot three times in the chest outside an apartment complex.\n\nHis brother, Robert Henkel, had demanded Hochul reject the urgings by prosecutor David Drucker to release Coleman, calling it a “farce.” He told the New York Post that “it is one thing to seek (clemency) for drug crimes - but not murder.”",
        "source": "US News",
        "date": null,
        "category": "ABC News"
    },
    "US News-1": {
        "url": "https://abcnews.go.com/US/wireStory/stores-open-closed-christmas-day-2023-hours-walmart-105888847",
        "title": "What stores are open and closed on Christmas Day in 2023? Hours for Walmart, Kroger, CVS and more",
        "image_url": "https://i.abcnewsfe.com/a/18c8a8a1-68e7-4913-9d81-46fe64e819f1/wirestory_6383766a6209b34825df15fda3a20e6c_16x9.jpg?w=992",
        "body": "NEW YORK -- With Christmas right around the corner, you might want to check the list of what stores are open (and closed) twice.\n\nFrom retail to grocery chains, many companies across the U.S. close early on Christmas Eve and shut their doors entirely on Christmas Day — while others opt to cut back hours. But there's also a handful of businesses that stay open on the holiday.\n\nBefore you run out the door this Christmas — whether it's to buy last-minute gifts or simply get out of the house — it's wise to double-check operating hours, which can range by location. When in doubt, call ahead or look up more specific schedules for spots in your neighborhood online.\n\nHere's a rundown of how major chains are operating this Christmas Day.\n\nWalmart will be closed on Christmas Day — and reopen at 6 a.m. Dec. 26.\n\nMost Target stores will be closed on Christmas and reopen at 7 a.m. Dec. 26. You can check location hours here.\n\nAll Costco warehouses in the U.S. are closed on Christmas Day.\n\nMany CVS Pharmacy locations will operate with normal hours on Christmas, but some non-24 locations may be closed or have reduced hours. Customers are encouraged to call ahead or double-check local hours online.\n\nMost Walgreens stores will have adjusted hours of 9am-5pm on Christmas Day. All 24-hour locations will continue to remain open. You can double-check local hours here.\n\nMany Starbucks locations will be open on Christmas, but hours can vary — with the company noting that “stores may occasionally adjust their hours based on business and customer needs” throughout the holiday season. It's best to check ahead online.\n\nMost McDonald’s locations in the U.S. are open on holidays like Christmas, but hours vary by location. Consumers can use the chain’s online store locator to confirm.\n\nMost Kroger stores are closed on Christmas Day, although that can vary depending on store division and location.\n\nMany Albertsons stores will be closed on Christmas — but there will also be locations that remain open with adjusted hours. Select pharmacies may also be closed or have different hours.\n\nHere's some other grocery, convenience and retail stores that are closed on Christmas Day:\n\n1. ALDI: Stores are closed.\n\n2. Harris Teeter: Stores are closed.\n\n3. Home Depot: Stores are closed.\n\n4. IKEA: Stores are closed.\n\n5. Jewel-Osco: Stores and pharmacies are closed.\n\n6. Lowe's: Stores are closed.\n\n7. Macy's: Stores are closed.\n\n8. Meijer: Stores are closed.\n\n9. Publix: Stores are closed.\n\n10. Rite Aid: Stores are closed.\n\n11. Sam's Club: Stores are closed.\n\n12. Sprouts Farmer's Market: Stores are closed.\n\n13. Trader Joe's: Stores are closed.\n\n14. Whole Foods: Stores are closed.\n\nHere are some other stores that are open on Christmas Day (or have select locations that are):\n\n1. Safeway: Many stores are closed, but there will also be open locations with adjusted hours.\n\n2. Sheetz: Stores are open with regular hours (24/7).\n\n3. 7-Eleven: Most stores are open 24/7 (including on Christmas), but some locations’ hours can vary.",
        "source": "US News",
        "date": null,
        "category": "ABC News"
    },
    "US News-2": {
        "url": "https://abcnews.go.com/US/1-dead-2-injured-colorado-mall-shooting-christmas/story?id=105904783",
        "title": "1 dead, 2 seriously injured in Colorado mall shooting on Christmas Eve",
        "image_url": "https://s.abcnews.com/images/International/g-dep-gty-jt-231223_1703356408493_hpMain_1x1_144.jpg",
        "body": "One person has died, and two people were seriously injured in a shooting at The Citadel Mall in Colorado Springs, Colorado, on Christmas Eve, police said Sunday.\n\nThe incident happened around 4:34 p.m. local time and allegedly began with a disagreement between two groups that ended in a shooting.\n\nOne man died on the scene of an apparent gunshot wound, and two were taken to the hospital in serious condition, the Colorado Springs public information officer told ABC News on Sunday night. A female was in stable condition and did not suffer a gunshot wound, they said.\n\nMultiple people were detained following the incident, the officer said.\n\nAuthorities are working to determine if the suspected shooter is among the detained, according to police.\n\nThe police have asked anyone who has info about the incident to call 719 444-7000.\n\nThe incident will not impact the reopening of the Citadel after the Christmas holiday. It is expected to open Tuesday morning as previously planned, police said.\n\nThis is a developing story. Check back for updates.",
        "source": "US News",
        "date": null,
        "category": "ABC News"
    },
    "US News-3": {
        "url": "https://abcnews.go.com/US/wireStory/decaying-pillsbury-mill-illinois-churned-flour-opportunity-now-105897612",
        "title": "Decaying Pillsbury mill in Illinois is now getting new life",
        "image_url": "https://i.abcnewsfe.com/a/7da8a201-7187-42bc-8ff7-095454c9f207/wirestory_4163e35e84c507adfcee97cd44a41431_16x9.jpg?w=992",
        "body": "SPRINGFIELD, Ill. -- It was the dog, stuck atop skyscraping grain silos on Springfield's northeast side in 2019, that forced Chris Richmond's hand.\n\nThe stray had found its way to the top of the behemoth Pillsbury Mills, for decades a flour-churning engine of the central Illinois city's economy but now vacant more than 20 years. Rescue was too risky amid such decay, officials said. \n\nThe brief but precarious appearance by the dog, found dead at ground level days later after ingesting rat poison, represented the hopelessness posed by the vacant campus, Richmond recalled. \n\n“That's when I said, ‘This is just unacceptable in our community,'\" said the 54-year-old retired city fire marshal, whose father's Pillsbury paycheck made him and his brother first-generation college graduates.\n\nA year later, Richmond and allies emerged with a nonprofit called Moving Pillsbury Forward and a five-year, $10 million plan to raze the century-old plant and renew the 18-acre (7.3-hectare) site. \n\nRichmond, the group's president and treasurer, vice president Polly Poskin and secretary Tony DelGiorno have $6 million in commitments and targets for collecting the balance.\n\nHaving already razed two structures, the group expects the wrecking ball to swing even more feverishly next year. Next door to a railyard with nationwide connections, they envision a light industrial future. \n\nMeanwhile, Moving Pillsbury Forward has managed to turn the decrepit site in Illinois’ capital city into a leisure destination verging on cultural phenomenon. \n\nTours have been highly popular and repeated. Oral histories have emerged. Spray-paint vandals, boosted instead of busted, have become artists in residence for nighttime graffiti exhibitions, which more than 1,000 people attended. \n\nRetired University of Illinois archeologist Robert Mazrim has mined artifacts and assembled an “Echoes of Pillsbury” museum beneath a leaking loading dock roof. This month, the plant's towering headhouse is ablaze with holiday lights.\n\nPerhaps the exuberance with which Moving Pillsbury Forward approaches its task sets it apart. But in terms of activist groups pursuing such formidable reclamation aspirations, it’s not unusual, said David Holmes, a Wisconsin-based environmental scientist and brownfields redevelopment consultant. \n\nGovernment funding has expanded to accommodate them. \n\n“You find some high-caliber organizations that are really focused on the areas with the biggest problems, these most-in-need neighborhoods,” Holmes said. “A lot of times, cities (local governments) are focused on their downtowns or whatever gets the mayor the ribbon cutting.”\n\nMinneapolis-based Pillsbury built the Springfield campus in 1929 and expanded it several times through the 1950s. A bakery mix division after World War II turned out the world's first boxed cake mixes. \n\nThere is circumstantial evidence that the Pillsbury doughboy, the brand's seminal mascot, was first drawn by a Springfield plant manager who eschewed credit, not, as the company maintains, in a Chicago ad agency. \n\nPillsbury sold the plant in 1991 to Cargill, which departed a decade later. A scrap dealer ran afoul of the law with improper asbestos disposal in 2015, prompting a $3 million U.S. Environmental Protection Agency cleanup. After the dog's cameo, Moving Pillsbury Forward persuaded the EPA to drop a lien for its cleanup costs and purchased the property for $1.\n\nNow, all that’s left is to sweep up a the remaining asbestos and lead paint chips before pulling down more than 500,000 square feet (46,450 square meters) of factory, including a 242-foot (73.8-meter) headhouse that’s the city’s third-tallest structure and 160 silos, four abreast and standing 100 feet (30.5 meters).\n\n“It’s daunting. Everything about this place is daunting,” Richmond concedes. “But a journey of 1,000 miles starts with the first step, right?”\n\nThe timing is right. There is more money than ever available to mop up America's left-behinds, according to Holmes. \n\nThe 2021 Infrastructure Investment and Jobs Act included $1.2 billion for brownfields cleanup, four times the typical annual allotment The Pillsbury group wants $2.6 million of the total added to what the group already has been promised by the federal, state and Springfield governments.\n\nThe application plays up the intangible benefits: economic and environmental justice availing the 12,000 people who live within 1 mile (1.61 kilometers) of the plant, only 25% of whom have a high school diploma and whose median household income is $25,000.\n\n“It's a tough sell but at some point, there are enough people who have a vision for what it could be that that's a powerful incentive,” Poskin said. “It isn't going to be anything until what's there is gone. No developer is going to take on a $10 million cleanup job.”\n\nThe group also set out to preserve memories of the place they are working to tear down. Ex-workers and neighbors have clamored for spots in ongoing tours and posed for group photos. \n\nIn a historical seniority list on display, next to “Jackson, Ernest, 1937,” is the message, “Hi Grandpa. We are visiting your workplace of 42 yrs.” Richmond and Mazrim have collected more than a dozen oral histories from past employees. Photographers are documenting what remains for historical context.\n\nAnd it's become an unlikely canvas. Minneapolis-based graffiti artists who tag their work “Shock” and “Static” were surreptitiously decorating the place in September when Richmond and Mazrim confronted them. Instead of pressing a trespassing charge, Richmond invited them to stage an exhibition. The nighttime November showing proved so popular that Richmond added a second date.\n\nArtist Eric Rieger, known to fans as HOTTEA, also took part, creating in a “cathedral-like” setting a huge, rectangular grid of black-light-lit neon strings of yarn suspended from the ceiling. His goal was “a sense of really positive energy” reminiscent of the fond memories employees experienced.\n\n“They were so enthusiastic and that’s rare to find nowadays,\" Rieger said the night of the first exhibit Nov. 9. \"I really respect what they did for this community because they're the backbone of America — they were feeding America.”\n\n___\n\nAssociated Press researcher Randy Herschaft in New York contributed.",
        "source": "US News",
        "date": null,
        "category": "ABC News"
    },
    "US News-4": {
        "url": "https://abcnews.go.com/US/hearts-hurt-men-impacted-abortion-restrictions-share-stories/story?id=105869733",
        "title": "'Our hearts hurt': Men impacted by abortion restrictions share their stories ",
        "image_url": "https://i.abcnewsfe.com/a/dff76df7-03c4-4a5d-a969-d0e2c1e98f98/on-the-brink-3-abc-gmh-0037_1702410013260_hpMain_16x9.jpg?w=992",
        "body": "ABC News brought together 18 women from across 10 states who say their medical care was impacted by abortion bans -- bringing some of them to the brink. These women said they have been turned away in medical emergencies for not being sick enough and had their health care delayed or denied due to state laws. \n\nThe women were not alone. Their partners walked alongside them on the journey, and together they faced the life-changing fallout from abortion bans in their home states. This story details these men’s experiences -- in their own words.\n\nStephen Anaya was thrilled when he heard the news that his wife Kristen was pregnant with a girl. The two had been trying to have a baby for more than two years, and both had medical procedures to help make their dream a reality.\n\nBut when Kristen Anaya's water broke earlier than it should have -- when she was only 15 weeks along -- and she lost nearly all her amniotic fluid, the couple faced the heartbreaking news that nothing could be done to save the fetus.\n\nLooking back, Stephen Anaya said that losing their baby, who they named Tylee, was \"devastating\" and hurt him a lot -- but that quickly turned to worry and fear for his wife.\n\n\"When someone tells you -- for me, on my side -- you could potentially lose your wife, after me losing my daughter, was very scary,\" Anaya told ABC News in an interview.\n\n\"I could potentially be losing two family members, and then I'm gonna be in charge of my stepson. And it was just very scary to deal with and then seeing her hour by hour literally get sick,\" Anaya said.\n\nThe Anayas live in Texas, which is one of 21 states currently enforcing strict abortion restrictions after Roe v. Wade was overturned. The state’s laws, which prohibit nearly all abortion care, prevented Kristen Anaya from receiving immediate care when she was first admitted to a hospital because she was not yet sick enough.\n\nWhile the state bans have an exception to save the life of the mother, physicians and lawyers say that the exception is unclear and has, in practice, resulted in care only being provided in the most severe cases, when patients are sick enough.\n\nSo, over the next 24 hours, Kristen Anaya would go into sepsis before doctors were able to give her lifesaving care in line with the medical emergency exception in the state's bans.\n\nThe \"Impact by Nightline\" broadcast, \"On the Brink,\" with exclusive interviews by Diane Sawyer and Rachel Scott, brings viewers inside the raw, intimate, and overlooked conversations playing out in clinics and exam rooms as the country continues to confront the realities of a post-Roe America. It is now streaming on Hulu. \n\nStephen Anaya is one of nine men gathered by ABC News who have never met before but share a common experience they say they would not wish on anyone -- their partners' care has been delayed or denied due to abortion restrictions.\n\nAll of the women’s partners were invited, but not all could make it to Texas.\n\nStephen Anaya remembers watching his wife, with a high fever and shaking uncontrollably, as she lay in the hospital.\n\n\"She's begging me to like cover her. And I'm like, 'I can't -- you can only have a sheet, nurses and doctors said your temperature is too high,'\" Anaya said.\n\n\"We put an ice pack on her and not even like 5 - 10 minutes later, it's melted. All over her body, I had her wrapped in the ice packs,\" Anaya said.\n\nAnaya said he felt angry that the laws were keeping his wife from being able to get the help that she needed.\n\n\"I have to step up and be here for her because I could lose her. And what does this mean? And then [I was] pissed in a way because we were there for help, and we can't get it even though I know the doctor wanted to, I could feel it -- [the doctor] was stuck and her hands were tied,\" Anaya said.\n\nAfter Kristen Anaya was released from the hospital, Stephen Anaya remembers checking her temperature after she fell asleep, worried that she would get sick again. Anaya said he still worries about his wife's health.\n\n\"She's better now -- I see that -- but it's like, how did that impact her long term, of her getting that sick?\" Anaya said.\n\nThe couple is trying to get pregnant again, possibly with the help of a surrogate, but it has been \"nerve-wracking\" and what happened with his wife's last pregnancy is \"100% on our minds,\" he said.\n\n\"What could happen doing the surrogacy thing and putting someone else at risk?\" Anaya said.\n\nThe couple medically cleared a surrogate and Kristen Anaya recently underwent an egg retrieval. They are waiting to find out if the fertilized eggs develop into embryos.\n\nMarco Dalabona and his wife Anabely Lopes, who live in Florida, received terrible news that their fetus was diagnosed with trisomy 18, an anomaly described by doctors as incompatible with life. Lopes was 15 weeks along.\n\n\"When you have to support her, and then you see her in that situation, that you can't do nothing, you feel very weak and then you get sad,\" Dalabona told ABC News' Rachel Scott.\n\n\"It's not only her dream. When you think about family -- we all think about that. It’s not only a girl’s dream to have a child,\" Dalabona said. \"It’s also our dream.\"\n\nBut, because the state prohibits abortions after 15 weeks, Lopes was unable to get care in her home state -- despite Florida's law having exceptions for fatal fetal anomalies.\n\nLopes traveled 1,000 miles from Miami to Washington, D.C., to receive care.\n\nSouth Carolina couple Matthew and Jill Hartle learned their fetus had a birth defect called hypoplastic left heart syndrome -- resulting in multiple severe heart anomalies. But, despite the state's law having exceptions for fetal abnormalities, Jill Hartle said she was unable to get care in her home state.\n\n\"We all made the correct decision to protect our family -- for my daughter, for my wife. And I was told that's incorrect and that's not allowed. And that's not fair. And there was nothing else we could do. And it feels so helpless. And then to add trauma to our already tragic situation -- is an impossible situation,\" Matt Hartle said, during a group interview with the men gathered in Texas.\n\n\"I was not allowed to protect my wife like she deserved,\" Hartle said.\n\n“A lot of us feel like the protectors of the family,” Hartle said. “And then now we have outside sources telling us how to be fathers.”\n\nThe Hartles traveled to Washington, D.C., to get care, but it took them 49 days.\n\n\"We've just been rocks for our spouse. And I -- we didn't really realize others are going through it. We all felt -- at least for me -- I felt really alone during the process. There's no outlets,\" Hartle said.\n\n\"It’s unbelievable how many people -- how many decision-makers -- I’ve come across that say, ‘I had no idea a fetal anomaly exists,'\" Hartle said.\n\nLike Kristen Anaya, Derick Cook's wife Anya Cook suffered preterm premature rupture of membranes, when a pregnant woman’s water breaks and the amniotic fluid is lost before the fetus is viable. But Anya Cook -- who was 16 weeks pregnant -- lives in Florida where a 15-week ban is in effect.\n\nIn states without restrictions, she would have been offered an immediate termination to protect her health, but in Florida she was given antibiotics and sent home, told to return immediately if her symptoms worsened.\n\nCook delivered the fetus alone in the bathroom of a hair salon, hearing her daughter hit the toilet. In the process she lost a life-threatening amount of blood, became critically ill, was put on a ventilator due to blood loss and was in the hospital for six days.\n\n“For me, it’s emotional,” said Cook. \"Because a lot of men step back -- they don’t think this is their issue.”\n\nDerick Cook said almost losing his wife was \"the most traumatizing thing\" he has experienced in his life.\n\n\"Our hearts hurt. We feel the pain. We go through the emotions. Some of us are in counseling. I know I'm in counseling because of this. You know, I wasn't-- I felt like my voice was shut out of this, until I got counseling and was able to talk about it,\" Cook said.\n\n\"They took the privilege of -- of us being the head of the household. And they just took whatever our feelings, and the stuff that we was going through, and they just diminished it,\" Cook said.\n\nClay Blackmon and his wife Alyssa Gonzales received the devastating news that their fetus had trisomy 18. The fetus had two holes in his heart, no nose bone and his brain had not developed.\n\nBut in Alabama, where nearly all abortions have ceased due to a strict ban, they were unable to receive care. The couple drove over 12 hours to Washington, D.C., to a clinic that they said was packed with patients.\n\n\"People were shoving each other out of the way. And a woman, her water broke on the floor. And she was about to give birth,\" Clay Blackmon said.\n\n\"I feel like this is the issue that you run into when you don't give people options. When you make it only certain states, and only these certain places, it becomes very narrow window. And you have all these women that are flooding in there, just trying to have a solution to the tragedy and the trauma that they're facing,\" Blackmon said.\n\nThe couple decided they would not be getting pregnant again -- Gonzales had a surgical sterilization.\n\n\"Why on earth would she wanna risk that again? Because if -- if we were to have another child with a fetal abnormality, then we would have to go through all of this again. She barely got through it the first time,\" Blackmon said.\n\n\"I couldn't be back there to support her in any way and she crumbled. And she could not take that again, nor could I, for that matter. I could never see my wife like that again,\" Blackmon said in a group interview with the eight other men.\n\n\"And it wasn't until today that I spoke with all these men, 'cause men typically like to suppress things. We try to be strong for our women. But I didn't realize how much it affected me until today, and how much of it comes surging back to me,\" Blackmon said.\n\nThomas Stovall said his tragedy has made him see the issue of abortion differently.\n\n\"Some of us were already for abortion, some of us were against it. In my personal opinion, I was 100% against it,\" Stovall said.\n\nStovall said he grew up deeply religious and was against abortion his entire life until he and his wife Chelsea learned their baby was growing without a diaphragm -- a condition that medical experts say is incompatible with life.\n\nStovall said his daughter's diagnosis made him change his mind.\n\n\"The fact that she had no chest cavity, her organs were wrapped around her heart, her -- she was 20 weeks old and had the size of a 2-week-old. And she had less than a 5% chance to even make it to the term. I had to go through such a traumatic trauma experience to change my view,\" Stovall said.\n\n\"We're terrified to have another child. I want a big family. I want kids. But we're terrified,\" Stovall said.\n\nChelsea Stovall later told ABC News that she and her husband do not plan to have more children because of their fear that this could happen again.\n\nAt 12 weeks of pregnancy, John Adkins and his wife received devastating news that their fetus had excess fluid and skin edema -- signs of cystic hygroma -- and that her fetus likely had Turner syndrome -- a rare condition that results from one of the X chromosomes missing. Adkins' doctor told her the fetus would not survive and she was surprised Adkins had not miscarried already.\n\nThe couple was told that if the laws in Idaho were different, she would have just been referred to an abortion clinic. But because Roe had been overturned and Idaho's near-total abortion ban was in effect, they were afraid to refer her to any clinic, even one out of state.\n\n\"We should not be collateral damage. When a family goes through something like this, the state should be there to comfort, and to provide help and resources, not to punish, or to make you flee your own state,\" John Adkins said.\n\n\"I'm a six-generation Idahoan. I'm very proud to be one. I had to leave the state. I had to drive six hours away. Couldn't be with my family. Couldn't be with my friends,\" Adkins said.\n\nWith financial help from family, friends and two abortion funds, the couple was able to finance a trip to Oregon for an abortion.\n\n\"It made me feel like a criminal. It made me feel -- like I was putting myself, my wife in jeopardy, our medical professionals in jeopardy,\" Adkins said.\n\nThe men told ABC News that it is important for them to share their stories.\n\n\"My wife's voice falls on deaf ears too often. And I'm tired of it. And so I think as -- as men, that's -- that's the role now, speak up, and help that future family. I don't want anyone else to go through what we just went through,\" Hartle said.\n\nStovall said they are sharing their story for other women.\n\n\"To fight for the future of our kids, and the future of women, to have a choice. They shouldn't be left with no choices. Like, if your baby is not gonna make it, then; then today, the way the laws work, we're left with really no options. And those women shouldn't be left with no option. And they should be able to say goodbye when they -- when they -- to their child, when they want to, not when somebody else wants to,\" Stovall said.",
        "source": "US News",
        "date": null,
        "category": "ABC News"
    },
    "US News-5": {
        "url": "https://abcnews.go.com/US/florida-mall-shooting-ocala/story?id=105893779",
        "title": "Florida mall shooting: Police urge bystander who took suspect's hat to come forward",
        "image_url": "https://i.abcnewsfe.com/a/878dcaaa-c10a-4d60-b42b-cbfc5b7375fb/ocala-mall-shooting-ht-jt-231223_1703370202515_hpMain.jpg",
        "body": "Police are looking for a suspect, as well as a bystander who took evidence from the crime scene, after a deadly shooting erupted at a Florida mall during the holiday shopping rush.\n\nOne person was killed and another was shot and wounded in the apparent targeted shooting at the Paddock Mall in Ocala Saturday afternoon.\n\nThe suspect, 39-year-old Albert J. Shell Jr., is wanted on charges of premeditated first-degree murder and attempted premeditated first-degree murder, police said Sunday.\n\nThe slain victim, 40-year-old David Nathaniel Barron, was found dead in a common area of the mall when police arrived, authorities said. He is believed to have been the target, Ocala Police Chief Mike Balken said.\n\nA woman was shot and injured and taken to a hospital with non-life-threatening injuries, authorities said. Other injuries stemming from the incident included chest pains and a broken arm, Balken said.\n\nPolice issued a statement Sunday afternoon urging the person who took the suspect's red hat from the mall to come forward.\n\n\"That hat may contain valuable DNA evidence,\" police said. \"If you do not return the hat within the next few hours, we will release your picture ... and you will be arrested with a felony charge of tampering with evidence.\"\n\nThe mall, which was packed with shoppers ahead of the holiday, was evacuated after the gunfire broke out.\n\n\"This is the worst thing we can imagine right now at this time of the year,\" Balken said. \"Somebody has suffered a loss in their family. It's a horrible time of year for this to happen ever. It's especially sad during the holidays.\"\n\nSyriah Williams, 18, told ABC News she was shopping at Bath & Body Works with her mother when she heard several shots ring out and \"chaos erupted.\"\n\n\"The employees opened the back storage area and told everyone to run,\" said Williams, who took cover behind the counters at the store.\n\nOcala Gazette owner Jennifer Hunt Murty told ABC News Radio she was volunteering at a gift-wrapping station when gunfire erupted about 10 feet away from her.\n\n\"We dropped to the ground,\" she said. \"I texted the police chief and said active shooter in the mall, and he responded right away.\"\n\nShe said she texted the chief where the injured victims were so medics could get to them, and after it seemed safe began interviewing people and taking photos.\n\n\"You never know how you're going to react in those situations, but I went to work,\" she said.\n\nPolice recovered a gun from the scene believed to have been used in the shooting, Balken said.\n\nThe mall will be closed Sunday and Monday.\n\nABC News' Layla Ferris contributed to this report.",
        "source": "US News",
        "date": null,
        "category": "ABC News"
    },
    "US News-6": {
        "url": "https://abcnews.go.com/US/wireStory/supreme-court-sideline-now-trumps-lawyers-press-immunity-105898565",
        "title": "With the Supreme Court on sideline for now, Trump's lawyers press immunity claims before lower court",
        "image_url": "https://i.abcnewsfe.com/a/cb454080-f814-46e1-90b0-1969ea5a8992/wirestory_f82dbd294cd7b963dd69f1ecdf90aded_16x9.jpg?w=992",
        "body": "WASHINGTON -- WASHINGTON (AP) — Donald Trump was acting within his role as president when he pressed claims about “alleged fraud and irregularity” in the 2020 election, his lawyers told a federal appeals court in arguing that he is immune from prosecution.\n\nThe attorneys also asserted in a filing late Saturday night that the “historical fallout is tremendous” from the four-count indictment charging Trump with plotting to overturn the election he lost to Democrat Joe Biden. \n\nNo other former president has ever been indicted; Trump has been indicted four times, in both state and federal court, as he campaigns to reclaim the White House.\n\n“The indictment of President Trump threatens to launch cycles of recrimination and politically motivated prosecution that will plague our Nation for many decades to come and stands likely to shatter the very bedrock of our Republic — the confidence of American citizens in an independent judicial system,” the attorneys wrote in a brief filed with the U.S. Court of Appeals for the District of Columbia Circuit. \n\nAt issue before the court, which has set arguments for Jan. 9, is whether Trump is immune from prosecution for what defense lawyers say are official acts that fell within the outer perimeter of a president's duties and responsibilities. \n\nU.S. District Judge Tanya Chutkan earlier this month rejected that argument, siding with prosecutors from special counsel Jack Smith's team and declaring that the office of the presidency \"does not confer a lifelong ‘get-out-of-jail-free’ pass.”\n\nThe appeals court's role in the dispute is center stage after the Supreme Court on Friday rejected a request from Smith to fast-track a decision on the immunity question. After Trump appealed Chutkan's order, Smith urged swift intervention from the high court in an effort to get a speedy decision that could keep the case on track for a trial scheduled to start on March 4.\n\nBut with that request denied, the two sides are advancing their arguments before the appeals court, where a three-judge panel will decide as early as next month whether to affirm or overrule Chutkan's decision.\n\nIn their latest filing, Trump's lawyers say that all of the acts Trump is accused of — including urging the Justice Department to investigate claims of voter fraud and telling state election officials that he believed the contests had been tainted by irregularities — are “quintessential\" presidential acts that protect him from prosecution. \n\n“They all reflect President Trump’s efforts and duties, squarely as Chief Executive of the United States, to advocate for and defend the integrity of the federal election, in accord with his view that it was tainted by fraud and irregularity,” they said.\n\nThey also contend that, under the Constitution, he cannot be criminally prosecuted for conduct for which he was already impeached, but then acquitted, by Congress.\n\nFederal prosecutors, by contrast, say Trump broke the law after the election by scheming to disrupt the Jan. 6, 2021, counting of electoral votes, including by pressing then-Vice President Mike Pence to not certify the results and by participating in a plot to organize slates of fake electors in battleground states won by Biden who would falsely attest that Trump had actually won those states.\n\nThough Trump's lawyers have suggested that he had a good faith basis to be concerned that fraud had affected the election, courts around the country and Trump's own attorney general and other government officials have found no evidence that that was the case.",
        "source": "US News",
        "date": null,
        "category": "ABC News"
    },
    "US News-7": {
        "url": "https://abcnews.go.com/US/wireStory/new-york-governor-vetoes-bill-make-easier-people-105893777",
        "title": "New York governor vetoes bill that would make it easier for people to challenge their convictions",
        "image_url": "https://i.abcnewsfe.com/a/c99025b9-f609-426f-b099-337d2063b125/wirestory_8597ae74b6b40419054272b072a5c472_16x9.jpg?w=992",
        "body": "ALBANY, N.Y. -- New York Gov. Kathy Hochul vetoed a bill days before Christmas that would have made it easier for people who have pleaded guilty to crimes to challenge their convictions, a measure that was favored by criminal justice reformers but fiercely opposed by prosecutors.\n\nThe Democrat said the bill's “sweeping expansion of eligibility for post-conviction relief” would “up-end the judicial system and create an unjustifiable risk of flooding the courts with frivolous claims,\" in a veto letter released Saturday.\n\nUnder existing state law, criminal defendants who plead guilty are usually barred from trying to get their cases reopened based on a new claim of innocence, except in certain circumstances involving new DNA evidence. \n\nThe bill passed by the Legislature in June would have expanded the types of evidence that could be considered proof of innocence, including video footage or evidence of someone else confessing to a crime. Arguments that a person was coerced into a false guilty plea would have also been considered.\n\nProsecutors and advocates for crime victims warned the bill would have opened the floodgates to endless, frivolous legal appeals by the guilty.\n\nErie County District Attorney John Flynn, the president of the District Attorney’s Association of the State of New York, wrote in a letter to Hochul in July that the bill would create “an impossible burden on an already overburdened criminal justice system.”\n\nThe legislation would have benefitted people like Reginald Cameron, who was exonerated in 2023, years after he pleaded guilty to first-degree robbery in exchange for a lesser sentence. He served more than eight years in prison after he was arrested alongside another person in 1994 in the fatal shooting of Kei Sunada, a 22-year-old Japanese immigrant. Cameron, then 19, had confessed after being questioned for several hours without attorneys. \n\nHis conviction was thrown out after prosecutors reinvestigated the case, finding inconsistencies between the facts of the crime and the confessions that were the basis for the conviction. The investigation also found the detective that had obtained Cameron's confessions was also connected to other high-profile cases that resulted in exonerations, including the Central Park Five case.\n\nVarious states including Texas have implemented several measures over the years intended to stop wrongful convictions. Texas amended a statute in 2015 that allows a convicted person to apply for post-conviction DNA testing. In 2017, another amended rule requires law enforcement agencies to electronically record interrogations of suspects in serious felony cases in their entirety.\n\n“We’re pretty out of step when it comes to our post-conviction statute,\" Amanda Wallwin, a state policy advocate at the Innocence Project, said of New York. \n\n“We claim to be a state that cares about racial justice, that cares about justice period. To allow Texas to outmaneuver us is and should be embarrassing,” she said. \n\nIn 2018, New York's highest court affirmed that people who plead guilty cannot challenge their convictions unless they have DNA evidence to support their innocence. That requirement makes it very difficult for defendants to get their cases heard before a judge, even if they have powerful evidence that is not DNA-based.\n\nOver the past three decades, the proportion of criminal cases that make it to trial in New York has steadily declined, according to a report by the New York State Association of Criminal Defense Lawyers. About 99% of misdemeanor charges and 94% of felony charges in the state are resolved by guilty pleas.\n\n“In my work, I know there there are a lot of circumstances where people plead guilty to crimes because they are advised or misadvised by their attorneys at the time,\" said Donna Aldea, a lawyer at law firm Barket Epstein Kearon Aldea & LoTurco. “Sometimes they're afraid that if they go to trial, they'll face much worse consequences, even if they didn't commit the crime.”\n\nShe said the state's criminal justice system right now is framed in a way that makes it impossible for people to challenge their guilty pleas years later when new evidence emerges, or when they're in a better financial position to challenge their convictions. \n\nUnder the bill, those challenging their convictions would be provided court-appointed pro bono representation if they can’t afford an attorney. They’d also be able to request retesting of physical evidence, as well as access to both the defense and prosecutor’s discovery files related to their case.\n\nState Senator Zellnor Myrie, a New York City Democrat who sponsored the bill, said he is considering reintroducing the bill in the next legislative session to give innocent people a “fair chance to reverse a terrible wrong.”\n\nNick Encalada-Malinowski, the civil rights campaign director for VOCAL-NY, a grassroots organization, said the bill would have removed various barriers for folks who got their wrongful conviction cases dismissed on procedural or technical grounds. \n\nThe bill, he said, would have given them a chance to get their cases heard on the merits. \n\n“The problem of wrongful convictions in New York requires a statewide solution,” said Nick Encalada-Malinowski, the civil rights campaign director for VOCAL-NY, a grassroots organization. “We’re trying to have a system where people have an ability no matter where they are, if they’re wrongfully convicted, to get back in courts and argue their cases.\"\n\n___\n\nMaysoon Khan is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues. Follow Maysoon Khan on X, formerly known as Twitter.",
        "source": "US News",
        "date": null,
        "category": "ABC News"
    },
    "US News-8": {
        "url": "https://abcnews.go.com/US/christmas-day-powerball-jackpot-638-million/story?id=105899988",
        "title": "Christmas Day Powerball jackpot reaches $638 million",
        "image_url": "https://i.abcnewsfe.com/a/27e22e5f-6e25-4d1f-a520-75eefc68dc2f/powerball2-02-ap-iwb-221029_1667056093200_hpEmbed_16x9.jpg",
        "body": "Santa might bring an extra gift to one lucky Powerball player this Christmas.\n\nThe Christmas Day jackpot has soared to an estimated $638 million, with an estimated cash value of $321.1 million.\n\nPowerball tickets are $2 each play. The next drawing is set for Monday at 10:59 p.m. ET.\n\nOnly three Powerball jackpots have ever been won on Christmas, according to Powerball. The most recent Christmas Day win was in 2013, when a player in Missouri claimed a $71.5 million jackpot.",
        "source": "US News",
        "date": null,
        "category": "ABC News"
    },
    "US News-9": {
        "url": "https://abcnews.go.com/US/1-dead-2-injured-colorado-mall-shooting-christmas/story?id=105904783",
        "title": "1 dead, 2 seriously injured in Colorado mall shooting on Christmas Eve",
        "image_url": "https://s.abcnews.com/images/International/g-dep-gty-jt-231223_1703356408493_hpMain_1x1_144.jpg",
        "body": "One person has died, and two people were seriously injured in a shooting at The Citadel Mall in Colorado Springs, Colorado, on Christmas Eve, police said Sunday.\n\nThe incident happened around 4:34 p.m. local time and allegedly began with a disagreement between two groups that ended in a shooting.\n\nOne man died on the scene of an apparent gunshot wound, and two were taken to the hospital in serious condition, the Colorado Springs public information officer told ABC News on Sunday night. A female was in stable condition and did not suffer a gunshot wound, they said.\n\nMultiple people were detained following the incident, the officer said.\n\nAuthorities are working to determine if the suspected shooter is among the detained, according to police.\n\nThe police have asked anyone who has info about the incident to call 719 444-7000.\n\nThe incident will not impact the reopening of the Citadel after the Christmas holiday. It is expected to open Tuesday morning as previously planned, police said.\n\nThis is a developing story. Check back for updates.",
        "source": "US News",
        "date": null,
        "category": "ABC News"
    },
    "US News-10": {
        "url": "https://abcnews.go.com/US/wireStory/decaying-pillsbury-mill-illinois-churned-flour-opportunity-now-105897612",
        "title": "Decaying Pillsbury mill in Illinois is now getting new life",
        "image_url": "https://i.abcnewsfe.com/a/7da8a201-7187-42bc-8ff7-095454c9f207/wirestory_4163e35e84c507adfcee97cd44a41431_16x9.jpg?w=992",
        "body": "SPRINGFIELD, Ill. -- It was the dog, stuck atop skyscraping grain silos on Springfield's northeast side in 2019, that forced Chris Richmond's hand.\n\nThe stray had found its way to the top of the behemoth Pillsbury Mills, for decades a flour-churning engine of the central Illinois city's economy but now vacant more than 20 years. Rescue was too risky amid such decay, officials said. \n\nThe brief but precarious appearance by the dog, found dead at ground level days later after ingesting rat poison, represented the hopelessness posed by the vacant campus, Richmond recalled. \n\n“That's when I said, ‘This is just unacceptable in our community,'\" said the 54-year-old retired city fire marshal, whose father's Pillsbury paycheck made him and his brother first-generation college graduates.\n\nA year later, Richmond and allies emerged with a nonprofit called Moving Pillsbury Forward and a five-year, $10 million plan to raze the century-old plant and renew the 18-acre (7.3-hectare) site. \n\nRichmond, the group's president and treasurer, vice president Polly Poskin and secretary Tony DelGiorno have $6 million in commitments and targets for collecting the balance.\n\nHaving already razed two structures, the group expects the wrecking ball to swing even more feverishly next year. Next door to a railyard with nationwide connections, they envision a light industrial future. \n\nMeanwhile, Moving Pillsbury Forward has managed to turn the decrepit site in Illinois’ capital city into a leisure destination verging on cultural phenomenon. \n\nTours have been highly popular and repeated. Oral histories have emerged. Spray-paint vandals, boosted instead of busted, have become artists in residence for nighttime graffiti exhibitions, which more than 1,000 people attended. \n\nRetired University of Illinois archeologist Robert Mazrim has mined artifacts and assembled an “Echoes of Pillsbury” museum beneath a leaking loading dock roof. This month, the plant's towering headhouse is ablaze with holiday lights.\n\nPerhaps the exuberance with which Moving Pillsbury Forward approaches its task sets it apart. But in terms of activist groups pursuing such formidable reclamation aspirations, it’s not unusual, said David Holmes, a Wisconsin-based environmental scientist and brownfields redevelopment consultant. \n\nGovernment funding has expanded to accommodate them. \n\n“You find some high-caliber organizations that are really focused on the areas with the biggest problems, these most-in-need neighborhoods,” Holmes said. “A lot of times, cities (local governments) are focused on their downtowns or whatever gets the mayor the ribbon cutting.”\n\nMinneapolis-based Pillsbury built the Springfield campus in 1929 and expanded it several times through the 1950s. A bakery mix division after World War II turned out the world's first boxed cake mixes. \n\nThere is circumstantial evidence that the Pillsbury doughboy, the brand's seminal mascot, was first drawn by a Springfield plant manager who eschewed credit, not, as the company maintains, in a Chicago ad agency. \n\nPillsbury sold the plant in 1991 to Cargill, which departed a decade later. A scrap dealer ran afoul of the law with improper asbestos disposal in 2015, prompting a $3 million U.S. Environmental Protection Agency cleanup. After the dog's cameo, Moving Pillsbury Forward persuaded the EPA to drop a lien for its cleanup costs and purchased the property for $1.\n\nNow, all that’s left is to sweep up a the remaining asbestos and lead paint chips before pulling down more than 500,000 square feet (46,450 square meters) of factory, including a 242-foot (73.8-meter) headhouse that’s the city’s third-tallest structure and 160 silos, four abreast and standing 100 feet (30.5 meters).\n\n“It’s daunting. Everything about this place is daunting,” Richmond concedes. “But a journey of 1,000 miles starts with the first step, right?”\n\nThe timing is right. There is more money than ever available to mop up America's left-behinds, according to Holmes. \n\nThe 2021 Infrastructure Investment and Jobs Act included $1.2 billion for brownfields cleanup, four times the typical annual allotment The Pillsbury group wants $2.6 million of the total added to what the group already has been promised by the federal, state and Springfield governments.\n\nThe application plays up the intangible benefits: economic and environmental justice availing the 12,000 people who live within 1 mile (1.61 kilometers) of the plant, only 25% of whom have a high school diploma and whose median household income is $25,000.\n\n“It's a tough sell but at some point, there are enough people who have a vision for what it could be that that's a powerful incentive,” Poskin said. “It isn't going to be anything until what's there is gone. No developer is going to take on a $10 million cleanup job.”\n\nThe group also set out to preserve memories of the place they are working to tear down. Ex-workers and neighbors have clamored for spots in ongoing tours and posed for group photos. \n\nIn a historical seniority list on display, next to “Jackson, Ernest, 1937,” is the message, “Hi Grandpa. We are visiting your workplace of 42 yrs.” Richmond and Mazrim have collected more than a dozen oral histories from past employees. Photographers are documenting what remains for historical context.\n\nAnd it's become an unlikely canvas. Minneapolis-based graffiti artists who tag their work “Shock” and “Static” were surreptitiously decorating the place in September when Richmond and Mazrim confronted them. Instead of pressing a trespassing charge, Richmond invited them to stage an exhibition. The nighttime November showing proved so popular that Richmond added a second date.\n\nArtist Eric Rieger, known to fans as HOTTEA, also took part, creating in a “cathedral-like” setting a huge, rectangular grid of black-light-lit neon strings of yarn suspended from the ceiling. His goal was “a sense of really positive energy” reminiscent of the fond memories employees experienced.\n\n“They were so enthusiastic and that’s rare to find nowadays,\" Rieger said the night of the first exhibit Nov. 9. \"I really respect what they did for this community because they're the backbone of America — they were feeding America.”\n\n___\n\nAssociated Press researcher Randy Herschaft in New York contributed.",
        "source": "US News",
        "date": null,
        "category": "ABC News"
    },
    "US News-11": {
        "url": "https://abcnews.go.com/US/florida-mall-shooting-ocala/story?id=105893779",
        "title": "Florida mall shooting: Police urge bystander who took suspect's hat to come forward",
        "image_url": "https://i.abcnewsfe.com/a/878dcaaa-c10a-4d60-b42b-cbfc5b7375fb/ocala-mall-shooting-ht-jt-231223_1703370202515_hpMain.jpg",
        "body": "Police are looking for a suspect, as well as a bystander who took evidence from the crime scene, after a deadly shooting erupted at a Florida mall during the holiday shopping rush.\n\nOne person was killed and another was shot and wounded in the apparent targeted shooting at the Paddock Mall in Ocala Saturday afternoon.\n\nThe suspect, 39-year-old Albert J. Shell Jr., is wanted on charges of premeditated first-degree murder and attempted premeditated first-degree murder, police said Sunday.\n\nThe slain victim, 40-year-old David Nathaniel Barron, was found dead in a common area of the mall when police arrived, authorities said. He is believed to have been the target, Ocala Police Chief Mike Balken said.\n\nA woman was shot and injured and taken to a hospital with non-life-threatening injuries, authorities said. Other injuries stemming from the incident included chest pains and a broken arm, Balken said.\n\nPolice issued a statement Sunday afternoon urging the person who took the suspect's red hat from the mall to come forward.\n\n\"That hat may contain valuable DNA evidence,\" police said. \"If you do not return the hat within the next few hours, we will release your picture ... and you will be arrested with a felony charge of tampering with evidence.\"\n\nThe mall, which was packed with shoppers ahead of the holiday, was evacuated after the gunfire broke out.\n\n\"This is the worst thing we can imagine right now at this time of the year,\" Balken said. \"Somebody has suffered a loss in their family. It's a horrible time of year for this to happen ever. It's especially sad during the holidays.\"\n\nSyriah Williams, 18, told ABC News she was shopping at Bath & Body Works with her mother when she heard several shots ring out and \"chaos erupted.\"\n\n\"The employees opened the back storage area and told everyone to run,\" said Williams, who took cover behind the counters at the store.\n\nOcala Gazette owner Jennifer Hunt Murty told ABC News Radio she was volunteering at a gift-wrapping station when gunfire erupted about 10 feet away from her.\n\n\"We dropped to the ground,\" she said. \"I texted the police chief and said active shooter in the mall, and he responded right away.\"\n\nShe said she texted the chief where the injured victims were so medics could get to them, and after it seemed safe began interviewing people and taking photos.\n\n\"You never know how you're going to react in those situations, but I went to work,\" she said.\n\nPolice recovered a gun from the scene believed to have been used in the shooting, Balken said.\n\nThe mall will be closed Sunday and Monday.\n\nABC News' Layla Ferris contributed to this report.",
        "source": "US News",
        "date": null,
        "category": "ABC News"
    },
    "US News-12": {
        "url": "https://abcnews.go.com/US/wireStory/supreme-court-sideline-now-trumps-lawyers-press-immunity-105898565",
        "title": "With the Supreme Court on sideline for now, Trump's lawyers press immunity claims before lower court",
        "image_url": "https://i.abcnewsfe.com/a/cb454080-f814-46e1-90b0-1969ea5a8992/wirestory_f82dbd294cd7b963dd69f1ecdf90aded_16x9.jpg?w=992",
        "body": "WASHINGTON -- WASHINGTON (AP) — Donald Trump was acting within his role as president when he pressed claims about “alleged fraud and irregularity” in the 2020 election, his lawyers told a federal appeals court in arguing that he is immune from prosecution.\n\nThe attorneys also asserted in a filing late Saturday night that the “historical fallout is tremendous” from the four-count indictment charging Trump with plotting to overturn the election he lost to Democrat Joe Biden. \n\nNo other former president has ever been indicted; Trump has been indicted four times, in both state and federal court, as he campaigns to reclaim the White House.\n\n“The indictment of President Trump threatens to launch cycles of recrimination and politically motivated prosecution that will plague our Nation for many decades to come and stands likely to shatter the very bedrock of our Republic — the confidence of American citizens in an independent judicial system,” the attorneys wrote in a brief filed with the U.S. Court of Appeals for the District of Columbia Circuit. \n\nAt issue before the court, which has set arguments for Jan. 9, is whether Trump is immune from prosecution for what defense lawyers say are official acts that fell within the outer perimeter of a president's duties and responsibilities. \n\nU.S. District Judge Tanya Chutkan earlier this month rejected that argument, siding with prosecutors from special counsel Jack Smith's team and declaring that the office of the presidency \"does not confer a lifelong ‘get-out-of-jail-free’ pass.”\n\nThe appeals court's role in the dispute is center stage after the Supreme Court on Friday rejected a request from Smith to fast-track a decision on the immunity question. After Trump appealed Chutkan's order, Smith urged swift intervention from the high court in an effort to get a speedy decision that could keep the case on track for a trial scheduled to start on March 4.\n\nBut with that request denied, the two sides are advancing their arguments before the appeals court, where a three-judge panel will decide as early as next month whether to affirm or overrule Chutkan's decision.\n\nIn their latest filing, Trump's lawyers say that all of the acts Trump is accused of — including urging the Justice Department to investigate claims of voter fraud and telling state election officials that he believed the contests had been tainted by irregularities — are “quintessential\" presidential acts that protect him from prosecution. \n\n“They all reflect President Trump’s efforts and duties, squarely as Chief Executive of the United States, to advocate for and defend the integrity of the federal election, in accord with his view that it was tainted by fraud and irregularity,” they said.\n\nThey also contend that, under the Constitution, he cannot be criminally prosecuted for conduct for which he was already impeached, but then acquitted, by Congress.\n\nFederal prosecutors, by contrast, say Trump broke the law after the election by scheming to disrupt the Jan. 6, 2021, counting of electoral votes, including by pressing then-Vice President Mike Pence to not certify the results and by participating in a plot to organize slates of fake electors in battleground states won by Biden who would falsely attest that Trump had actually won those states.\n\nThough Trump's lawyers have suggested that he had a good faith basis to be concerned that fraud had affected the election, courts around the country and Trump's own attorney general and other government officials have found no evidence that that was the case.",
        "source": "US News",
        "date": null,
        "category": "ABC News"
    },
    "US News-13": {
        "url": "https://abcnews.go.com/US/wireStory/new-york-governor-vetoes-bill-make-easier-people-105893777",
        "title": "New York governor vetoes bill that would make it easier for people to challenge their convictions",
        "image_url": "https://i.abcnewsfe.com/a/c99025b9-f609-426f-b099-337d2063b125/wirestory_8597ae74b6b40419054272b072a5c472_16x9.jpg?w=992",
        "body": "ALBANY, N.Y. -- New York Gov. Kathy Hochul vetoed a bill days before Christmas that would have made it easier for people who have pleaded guilty to crimes to challenge their convictions, a measure that was favored by criminal justice reformers but fiercely opposed by prosecutors.\n\nThe Democrat said the bill's “sweeping expansion of eligibility for post-conviction relief” would “up-end the judicial system and create an unjustifiable risk of flooding the courts with frivolous claims,\" in a veto letter released Saturday.\n\nUnder existing state law, criminal defendants who plead guilty are usually barred from trying to get their cases reopened based on a new claim of innocence, except in certain circumstances involving new DNA evidence. \n\nThe bill passed by the Legislature in June would have expanded the types of evidence that could be considered proof of innocence, including video footage or evidence of someone else confessing to a crime. Arguments that a person was coerced into a false guilty plea would have also been considered.\n\nProsecutors and advocates for crime victims warned the bill would have opened the floodgates to endless, frivolous legal appeals by the guilty.\n\nErie County District Attorney John Flynn, the president of the District Attorney’s Association of the State of New York, wrote in a letter to Hochul in July that the bill would create “an impossible burden on an already overburdened criminal justice system.”\n\nThe legislation would have benefitted people like Reginald Cameron, who was exonerated in 2023, years after he pleaded guilty to first-degree robbery in exchange for a lesser sentence. He served more than eight years in prison after he was arrested alongside another person in 1994 in the fatal shooting of Kei Sunada, a 22-year-old Japanese immigrant. Cameron, then 19, had confessed after being questioned for several hours without attorneys. \n\nHis conviction was thrown out after prosecutors reinvestigated the case, finding inconsistencies between the facts of the crime and the confessions that were the basis for the conviction. The investigation also found the detective that had obtained Cameron's confessions was also connected to other high-profile cases that resulted in exonerations, including the Central Park Five case.\n\nVarious states including Texas have implemented several measures over the years intended to stop wrongful convictions. Texas amended a statute in 2015 that allows a convicted person to apply for post-conviction DNA testing. In 2017, another amended rule requires law enforcement agencies to electronically record interrogations of suspects in serious felony cases in their entirety.\n\n“We’re pretty out of step when it comes to our post-conviction statute,\" Amanda Wallwin, a state policy advocate at the Innocence Project, said of New York. \n\n“We claim to be a state that cares about racial justice, that cares about justice period. To allow Texas to outmaneuver us is and should be embarrassing,” she said. \n\nIn 2018, New York's highest court affirmed that people who plead guilty cannot challenge their convictions unless they have DNA evidence to support their innocence. That requirement makes it very difficult for defendants to get their cases heard before a judge, even if they have powerful evidence that is not DNA-based.\n\nOver the past three decades, the proportion of criminal cases that make it to trial in New York has steadily declined, according to a report by the New York State Association of Criminal Defense Lawyers. About 99% of misdemeanor charges and 94% of felony charges in the state are resolved by guilty pleas.\n\n“In my work, I know there there are a lot of circumstances where people plead guilty to crimes because they are advised or misadvised by their attorneys at the time,\" said Donna Aldea, a lawyer at law firm Barket Epstein Kearon Aldea & LoTurco. “Sometimes they're afraid that if they go to trial, they'll face much worse consequences, even if they didn't commit the crime.”\n\nShe said the state's criminal justice system right now is framed in a way that makes it impossible for people to challenge their guilty pleas years later when new evidence emerges, or when they're in a better financial position to challenge their convictions. \n\nUnder the bill, those challenging their convictions would be provided court-appointed pro bono representation if they can’t afford an attorney. They’d also be able to request retesting of physical evidence, as well as access to both the defense and prosecutor’s discovery files related to their case.\n\nState Senator Zellnor Myrie, a New York City Democrat who sponsored the bill, said he is considering reintroducing the bill in the next legislative session to give innocent people a “fair chance to reverse a terrible wrong.”\n\nNick Encalada-Malinowski, the civil rights campaign director for VOCAL-NY, a grassroots organization, said the bill would have removed various barriers for folks who got their wrongful conviction cases dismissed on procedural or technical grounds. \n\nThe bill, he said, would have given them a chance to get their cases heard on the merits. \n\n“The problem of wrongful convictions in New York requires a statewide solution,” said Nick Encalada-Malinowski, the civil rights campaign director for VOCAL-NY, a grassroots organization. “We’re trying to have a system where people have an ability no matter where they are, if they’re wrongfully convicted, to get back in courts and argue their cases.\"\n\n___\n\nMaysoon Khan is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues. Follow Maysoon Khan on X, formerly known as Twitter.",
        "source": "US News",
        "date": null,
        "category": "ABC News"
    },
    "US News-14": {
        "url": "https://abcnews.go.com/US/christmas-day-powerball-jackpot-638-million/story?id=105899988",
        "title": "Christmas Day Powerball jackpot reaches $638 million",
        "image_url": "https://i.abcnewsfe.com/a/27e22e5f-6e25-4d1f-a520-75eefc68dc2f/powerball2-02-ap-iwb-221029_1667056093200_hpEmbed_16x9.jpg",
        "body": "Santa might bring an extra gift to one lucky Powerball player this Christmas.\n\nThe Christmas Day jackpot has soared to an estimated $638 million, with an estimated cash value of $321.1 million.\n\nPowerball tickets are $2 each play. The next drawing is set for Monday at 10:59 p.m. ET.\n\nOnly three Powerball jackpots have ever been won on Christmas, according to Powerball. The most recent Christmas Day win was in 2013, when a player in Missouri claimed a $71.5 million jackpot.",
        "source": "US News",
        "date": null,
        "category": "ABC News"
    },
    "US News-15": {
        "url": "https://abcnews.go.com/US/1-dead-4-injured-shooting-houston-club/story?id=105898568",
        "title": "1 dead, 4 injured in shooting outside Houston club",
        "image_url": "https://i.abcnewsfe.com/a/ab77ed03-39c3-4cde-bf2d-0919270ae953/houston-shooting-ht-lv-231224_1703428991570_hpMain_16x9.jpg",
        "body": "One person is dead and four others are wounded from a shooting that stemmed from an apparent altercation outside a Houston club, according to police.\n\nAfter the \"shootout,\" which erupted at about 3 a.m. local time Sunday, one man tried to run away to a service road \"where he collapsed from his wounds,\" Houston Police Assistant Chief Megan Howard said during a news conference. Police did not name the club.\n\nWhen officers responded, they found citizens trying to give first aid to the man, who was lying in the road, Howard said.\n\nThe man, in his 20s, was pronounced dead at the scene, Howard said.\n\nFive young men fled from the shooting in a truck they apparently stole, according to Howard.\n\nFour of the men were dropped off at a hospital with gunshot wounds, Howard said. Three have apparent non-life-threatening injuries and one has more serious injuries, Howard said.\n\nThe driver and the truck have not been found. Police described the vehicle as a 2015 blue Toyota Tundra with license plate JLX0756.\n\nOfficials believe the club was holding an event Saturday night, and authorities are working to determine whether those involved in the shooting were at the event, Howard said.\n\nABC News' Victoria Arancio contributed to this report.",
        "source": "US News",
        "date": null,
        "category": "ABC News"
    },
    "US News-16": {
        "url": "https://abcnews.go.com/US/record-high-temperatures-cross-country-storm-forecast-holiday/story?id=105892108",
        "title": "Record-high temperatures, cross-country storm forecast this holiday weekend",
        "image_url": "https://i.abcnewsfe.com/a/c4d49004-6435-4023-ba07-0ddfb1bc177c/christmas-map-weather-abc-lv-231224_1703433965858_hpEmbed_16x9.jpeg",
        "body": "A white Christmas may not be a reality for a vast majority of Americans this holiday season.\n\nRecord-high temperatures are possible for multiple regions around the United States for the Christmas holiday, while other regions could be hit with heavy rain.\n\nHere's what to expect for weather conditions on Christmas Eve and Christmas Day:\n\nThe Upper Midwest is going to have a very warm Christmas Eve, forecasts show. Some places will see the warmest-ever temperatures recorded in 150 years of record keeping.\n\nOn Sunday, Christmas Eve, records may be broken in some places, like Minneapolis, Minnesota, where the record high is 46 degrees from 1957 and the forecasted high this year is nearly 10 degrees higher than that record, in the middle 50s.\n\nStates like Iowa, Minnesota, Wisconsin and North Dakota are also forecast to reach the 40s and 50s.\n\nOther places like Duluth, Minnesota; Green Bay, Wisconsin; Sioux Falls, South Dakota, and Cedar Rapids, Iowa, may break high temperature records, as well.\n\nOn Christmas Day, Green Bay will be near a record high with temperatures nearing 50 degrees.\n\nNew Year's weekend is also looking quiet for much of America.\n\n A cross-country storm that started bringing snow to the Rockies and rain to the desert Southwest on Saturday has now moved east, with heavy rain expected in the Midwest and South on Sunday and Monday.\n\nThe line of heavy rain stretched from the borders of Canada to Mexico on Sunday morning, moving straight through America's Heartland.\n\nRegions near the Missouri-Kansas border, including Kansas City, may see flooding on Sunday, with more than 3 inches of rainfall possible there.\n\nLater on Sunday and overnight into Monday, cities from New Orleans to Mobile, Alabama, could experience flooding, with more than 3 inches of rain forecast there.\n\nOn Christmas morning, Florida's panhandle will be under flood threat. Heavy rain will span into Georgia, as well, and into South Carolina through the day. Total rainfall accumulation across the Gulf Coast is expected to be 2 to 3 inches with some local areas seeing 4 to 5 inches, forecasts show.\n\nThe rain for this cross-country storm will reach the East Coast on Tuesday and the Northeast later Tuesday and through Wednesday.\n\nThe rain is expected to bring few issues besides wet roads and some ponding possible.\n\nThere will be some lingering showers in the Northeast on Thursday, with lots of dry time, too.\n\nOn New Year's weekend, rain is possible on the West Coast, especially from Northern California to Washington.\n\nSnow was falling from North Dakota to South Dakota and through the Nebraska panhandle into Colorado on Sunday morning, with the heaviest snow coming down in Nebraska and Colorado.\n\nA blizzard warning spanned much of Nebraska and into South Dakota on Sunday morning.\n\nOn Sunday and Monday, parts of northern and central Nebraska are forecast to receive total snow accumulations of 8 to 18 inches, with winds gusting as high as 55 mph. This will lead to whiteout conditions on roadways, along with snow drifting, which will make accumulations appear even greater in size. Power outages are possible.\n\nIn eastern Nebraska, for the Omaha area, total snow and sleet accumulations between 2 inches and 9 inches, and ice accumulations around a light glaze are possible. Winds could also gust as high as 45 mph. These conditions will begin late Sunday and continue through Christmas Day.\n\nOn the back side of the cross-country storm, heavy snow is possible across the plains of South Dakota and Nebraska. Snow accumulations may total 6 to 12 inches, or more, in parts of Nebraska and South Dakota by the end of Tuesday.\n\nSnow will still be coming down in the Plains on Tuesday, with possible ice issues forecast in northern Minnesota.\n\nParts of New Mexico and Arizona have already recorded over half a foot of snow, while places in Colorado, Wyoming and Utah have recorded up to 6 inches, according to the National Weather Service.",
        "source": "US News",
        "date": null,
        "category": "ABC News"
    },
    "US News-17": {
        "url": "https://abcnews.go.com/US/wireStory/man-killed-woman-injured-targeted-afternoon-shooting-florida-105902106",
        "title": "A man is killed and a woman injured in a 'targeted' afternoon shooting at a Florida shopping mall",
        "image_url": "https://i.abcnewsfe.com/a/abb4ad99-1974-4e75-8248-99355b8560b7/wirestory_e382916989321e3d806c065d3129c203_16x9.jpg?w=992",
        "body": "OCALA, Fla. -- Authorities in central Florida issued an arrest warrant Sunday for a 39-year-old man accused of fatally shooting another man at a shopping mall two days before Christmas in which police say the victim was “targeted.”\n\nAs of Sunday afternoon, the suspect hadn't been located, and the Ocala Police Department was offering a $5,000 award for any information leading to his arrest. The arrest warrant was for premeditated first-degree murder and attempted premeditated first-degree murder, the police department said on social media.\n\nOcala Police Chief Mike Balken told reporters Saturday evening that the victim was killed after he was shot multiple times in a common area at Paddock Mall in Ocala, located about 80 miles (127 kilometers) northwest of Orlando. \n\nA woman also was shot in the leg. She was treated at a local hospital and expected to recover, Balken said.\n\nThe suspect fled the scene and left behind the firearm, Balken said.\n\nOcala police posted photos overnight of a person of interest that appear to be taken from a mall security camera. The three images show a male with a red cap and dark clothing. Balken previously said the suspect wore a hooded sweatshirt and a mask partially covering his face. \n\nOn Sunday, the police department urged a person who took the suspect’s hat from the crime scene to turn it over to investigators or they would be charged with tampering with evidence.\n\n“That hat may contain valuable DNA evidence, and we need it back,” the Ocala Police Department said on social media. “We urge you to do the right thing and come forward immediately. Time is of the essence.” \n\nPolice arrived at the mall around 3:40 p.m. Saturday after a call of multiple shots being fired at the mall. \n\n“Officers immediately made entry into the mall (and) ultimately discovered that this was not what we would consider an active shooter,” Balken told reporters.\n\nThe attack was likely a “targeted act of violence” against the man, Balken said. \n\nSeveral other mall patrons suffered injuries during the shooting, with one person having chest pain and another reporting a broken arm, police said. \n\nPolice have asked the public for assistance by submitting mobile phone video of the shooting scene. \n\nThe mall’s corporate owner, WPG, said in a statement that they were working with the Ocala Police Department in the investigation of what happened. The mall was closed Sunday, the day before Christmas.\n\n“We are deeply saddened by this tragedy. Our thoughts are with all those involved,” the statement said. “The safety of our guests, retailers and employees is our top priority.”\n\nThe mall has dozens of stores, including J.C. Penney and Foot Locker.\n\nCalvin and Diana Amos, who were shopping in the J.C. Penney store, told the Ocala Star-Banner that they evacuated the store quickly once they figured out what was going on. They described themselves as scared and apprehensive.",
        "source": "US News",
        "date": null,
        "category": "ABC News"
    }
}