{
    "ABC News-0": {
        "url": "https://abcnews.go.com/US/missing-pregnant-teen-savanah-soto/story?id=105924768",
        "title": "Missing pregnant teen, boyfriend believed to be found dead in possible murder: Police",
        "image_url": "https://i.abcnewsfe.com/a/7006d48d-404a-4d67-a8dc-8707995b7369/Soto-ht-er-231226_1703611324329_hpMain.jpg",
        "body": "A pregnant teenager, who disappeared before she was scheduled to be induced, and her boyfriend are believed to have been found dead Tuesday following a days-long search, police said.\n\nThe bodies of two people believed to be Savanah Nicole Soto, 18, and her boyfriend were found in a vehicle in San Antonio, San Antonio Police Chief Bill McManus told reporters Tuesday evening, calling the case \"very, very perplexing.\"\n\n\"Detectives right now are looking at this as a possible murder, but we don't know for sure,\" McManus said.\n\nThe two bodies were found in the boyfriend's vehicle and are believed to have been there for three to four days, McManus said. Their identities will be officially confirmed by the medical examiner, but they are believed to be Soto and her boyfriend, he said.\n\nThe chief was unable to confirm if the female victim was pregnant and said that would also be left to the medical examiner to determine.\n\nThe vehicle was found on the 5900 block of Danny Kaye Drive in northwest San Antonio, police said. McManus did not know who located it.\n\nSoto was last seen Friday afternoon in Leon Valley, according to the Texas Department of Public Safety. The agency issued a CLEAR Alert -- used to help law enforcement locate someone in imminent danger or whose disappearance is involuntary -- for Soto on Monday.\n\nThe pregnant teen had passed her delivery date which \"caused significant concern among her family members after missing an essential medical appointment,\" the Leon Valley Police Department said in a press release earlier on Tuesday.\n\nSoto's mother, Gloria Cordova, told San Antonio ABC affiliate KSAT that her daughter was scheduled to be induced at a hospital this past Saturday.\n\n\"When I called her all morning she wasn't answering, was going straight to voicemail,\" Cordova told the station. \"We went to the hospital anyways. She was a no-show, and that's when I called the cops.\"\n\nCordova said her daughter's home was clean and had been prepped for the baby's arrival.\n\n\"This is not like her,\" Cordova told KSAT. \"She was so excited to have this baby. The house was already baby-ready.\"\n\n\"There's no reason why she would just get up and go off and do that,\" she added.\n\nCordova said the family is already reeling after her son, Ethan, died last year. The 15-year-old was fatally shot at his home in San Antonio, police said.\n\n\"[Savanah] knows what I went through with Ethan, and I know she doesn't want me to go through this again,\" the mother told KSAT.\n\nAmid the search for her daughter, Cordova said she did not know where the father of the baby was either.\n\n\"I just want her home,\" Cordova said. \"I'm worried about the baby, if she's even had the baby, if she's in danger.\"\n\nThe Leon Valley Police Department said Tuesday morning that it was actively investigating Soto's disappearance and seeking additional witnesses and information.",
        "source": "ABC News",
        "date": null,
        "category": "US News"
    },
    "ABC News-1": {
        "url": "https://abcnews.go.com/US/wireStory/appellate-court-reverses-federal-conviction-former-nebraska-us-105926225",
        "title": "Court reverses former US Rep. Fortenberry conviction of lying to federal authorities",
        "image_url": "https://i.abcnewsfe.com/a/0da4eb7a-b786-4a88-9aef-c7b395de9368/wirestory_87ae8166a867b9f98f4c352748c6c521_16x9.jpg?w=992",
        "body": "LOS ANGELES -- An appellate court on Tuesday reversed a 2022 federal conviction against former Rep. Jeff Fortenberry of Nebraska, ruling that he should not have been tried in Los Angeles. \n\nFortenberry was convicted in March 2022 on charges that he lied to federal authorities about an illegal $30,000 contribution to his campaign from a foreign billionaire at a 2016 Los Angeles fundraiser. He resigned his seat days later following pressure from congressional leaders and Nebraska’s GOP governor.\n\nIn its Tuesday ruling, the U.S. Court of Appeals for the Ninth Circuit wrote that the trial venue of Los Angeles was improper because Fortenberry made the false statements during interviews with federal agents at his home in Lincoln, Nebraska, and in his lawyer’s office in Washington.\n\n“Fortenberry’s convictions are reversed so that he may be retried, if at all, in a proper venue,” the decision said.\n\nA federal jury in Los Angeles found the nine-term Republican guilty of concealing information and two counts of making false statements to authorities. He vowed to appeal from the courthouse steps.\n\nFortenberry and his wife, Celeste Fortenberry, praised the court’s decision.\n\n“We are gratified by the Ninth Circuit’s decision,” Jeff Fortenberry said in a statement. “Celeste and I would like to thank everyone who has stood by us and supported us with their kindness and friendship.”\n\nThom Mrozek, a spokesperson for the U.S. Attorney’s Office in Los Angeles, noted that the appellate court left a path open for future proceedings against Fortenberry.\n\n“The ruling does not preclude a retrial on the charges that then-Congressman Fortenberry made multiple false statements to federal agents,\" Mrozek said in a statement. \"We are evaluating potential next steps before deciding how best to move forward.”\n\nPatricia Hartman, a spokesperson for the U.S. Attorney’s Office for the District of Columbia, declined to comment on the ruling’s potential impact for federal prosecutors in Washington.\n\n“We cannot comment on matters where we don’t have charges filed,” she said in an email Tuesday.\n\nA spokesperson for the U.S. Attorney’s Office in Nebraska did not immediately return a phone message.\n\nFortenberry was charged after denying to the FBI that he was aware he had received illicit funds from Gilbert Chagoury, a Nigerian billionaire of Lebanese descent.\n\nAt trial, prosecutors presented recorded phone conversations in which Fortenberry was repeatedly warned that the contributions came from Gilbert Chagoury, a Nigerian billionaire of Lebanese descent. The donations were funneled through three strawmen at the 2016 fundraiser in Los Angeles.\n\nThe case stemmed from an FBI investigation into $180,000 in illegal campaign contributions to four campaigns from Chagoury, who lived in Paris at the time. Chagoury admitted to the crime in 2019 and agreed to pay a $1.8 million fine.\n\nIt was the first trial of a sitting congressman since Rep. Jim Traficant, D-Ohio, was convicted of bribery and other felony charges in 2002.",
        "source": "ABC News",
        "date": null,
        "category": "US News"
    },
    "ABC News-2": {
        "url": "https://abcnews.go.com/US/1-dead-2-injured-colorado-mall-shooting-christmas/story?id=105904783",
        "title": "Search for suspects continues in Christmas Eve Colorado mall shooting that left 1 dead, 3 hurt ",
        "image_url": "https://i.abcnewsfe.com/a/561dd2a5-0f56-47cb-98e4-bfe51213ef52/shooting-ht-ml-231226_1703602047722_hpMain_16x9.jpg",
        "body": "The search for suspects in a Christmas Eve shooting at The Citadel Mall in Colorado Springs, Colorado, continued Tuesday, with police saying the preliminary investigation indicates the gunfire that left one man dead and two seriously injured was from a \"targeted\" attack.\n\nThe incident occurred around 4:34 p.m. local time on Sunday and allegedly began with a disagreement between two groups that ended in a shooting, according to police.\n\n\"We believe this was a targeted shooting, and the two groups of individuals fighting were known to one another,\" a spokesperson for the Colorado Springs Police Department told ABC News on Tuesday.\n\nOne man died on the scene of an apparent gunshot wound, and two were taken to the hospital in serious condition, police said. A woman was injured but was not shot in the incident and was taken to a hospital in stable condition.\n\nMultiple people were initially detained following the incident, but were released without being charged after being questioned, police said.\n\nThe police have asked anyone who has information about the incident to call them at (719) 444-7000.\n\nThe incident is not expected to impact the previously planned Tuesday reopening of The Citadel Mall, police said.",
        "source": "ABC News",
        "date": null,
        "category": "US News"
    },
    "ABC News-3": {
        "url": "https://abcnews.go.com/US/florida-mall-shooting-ocala/story?id=105893779",
        "title": "Florida mall shooting: Reward up to $10,000 as police hunt for suspect",
        "image_url": "https://i.abcnewsfe.com/a/d6bf7ed0-ca40-468f-bb8e-0168a0e4fdde/david-barron-ht-jef-231225_1703599959712_hpEmbed_4x5.jpg",
        "body": "Police are looking for a suspect, as well as a bystander who took evidence from the crime scene, after a deadly shooting erupted at a Florida mall during the holiday shopping rush.\n\nOne person was killed and another was shot and wounded in the apparent targeted shooting at the Paddock Mall in Ocala Saturday afternoon.\n\nThe suspect, 39-year-old Albert J. Shell Jr., is wanted on charges of premeditated first-degree murder and attempted premeditated first-degree murder, police said.\n\nA $10,000 reward is available for information leading to his arrest.\n\nThe slain victim, 40-year-old David Nathaniel Barron, was found dead in a common area of the mall when police arrived, authorities said. He is believed to have been the target, Ocala Police Chief Mike Balken said.\n\nA woman was shot and injured and taken to a hospital with non-life-threatening injuries, authorities said. Other injuries stemming from the incident included chest pains and a broken arm, Balken said.\n\nPolice issued a statement Sunday urging the person who took the suspect's red hat from the mall to come forward.\n\n\"That hat may contain valuable DNA evidence,\" police said. \"If you do not return the hat within the next few hours, we will release your picture ... and you will be arrested with a felony charge of tampering with evidence.\"\n\nThe mall, which was packed with shoppers ahead of the holiday, was evacuated after the gunfire broke out.\n\n\"This is the worst thing we can imagine right now at this time of the year,\" Balken said. \"Somebody has suffered a loss in their family. It's a horrible time of year for this to happen ever. It's especially sad during the holidays.\"\n\nSyriah Williams, 18, told ABC News she was shopping at Bath & Body Works with her mother when she heard several shots ring out and \"chaos erupted.\"\n\n\"The employees opened the back storage area and told everyone to run,\" said Williams, who took cover behind the counters at the store.\n\nOcala Gazette owner Jennifer Hunt Murty told ABC News Radio she was volunteering at a gift-wrapping station when gunfire erupted about 10 feet away from her.\n\n\"We dropped to the ground,\" she said. \"I texted the police chief and said active shooter in the mall, and he responded right away.\"\n\nShe said she texted the chief where the injured victims were so medics could get to them, and after it seemed safe began interviewing people and taking photos.\n\n\"You never know how you're going to react in those situations, but I went to work,\" she said.\n\nPolice recovered a gun from the scene believed to have been used in the shooting, Balken said.\n\nThe mall will be closed Sunday and Monday.\n\nABC News' Layla Ferris contributed to this report.",
        "source": "ABC News",
        "date": null,
        "category": "US News"
    },
    "ABC News-4": {
        "url": "https://abcnews.go.com/US/dangerous-blizzard-conditions-hit-plains-latest-forecast/story?id=105917178",
        "title": "Dangerous blizzard conditions hit the Plains: Latest forecast",
        "image_url": "https://i.abcnewsfe.com/a/94e1ad94-44f8-4d3d-b911-54be3c85cac0/snowfall-1-ht-bb-231226_1703599097973_hpMain.jpg",
        "body": "An intense winter storm is slamming the Plains with blizzard warnings across Colorado, Wyoming, Kansas, Nebraska and South Dakota.\n\nSnow totals have reached 13 inches in some areas so far and wind gusts have topped 60 mph.\n\nUp to half an inch of ice is coating trees and power lines from Minnesota to North Dakota.\n\nThe blizzard will continue into Wednesday, with more gusty winds and another 4 to 8 inches of snow from South Dakota to Colorado.\n\nThe same storm is also bringing 2 to 4 inches of rain to the South on Tuesday. Flooding is possible in Georgia, South Carolina, North Carolina and Virginia.\n\nSome of this heavy rain will move up the East Coast on Tuesday night. Heavy rain is expected in Washington, D.C., Wednesday morning and in New York City in the afternoon.",
        "source": "ABC News",
        "date": null,
        "category": "US News"
    },
    "ABC News-5": {
        "url": "https://abcnews.go.com/US/wireStory/decaying-pillsbury-mill-illinois-churned-flour-opportunity-now-105897612",
        "title": "Decaying Pillsbury mill in Illinois is now getting new life",
        "image_url": "https://i.abcnewsfe.com/a/7da8a201-7187-42bc-8ff7-095454c9f207/wirestory_4163e35e84c507adfcee97cd44a41431_16x9.jpg?w=992",
        "body": "SPRINGFIELD, Ill. -- It was the dog, stuck atop skyscraping grain silos on Springfield's northeast side in 2019, that forced Chris Richmond's hand.\n\nThe stray had found its way to the top of the behemoth Pillsbury Mills, for decades a flour-churning engine of the central Illinois city's economy but now vacant more than 20 years. Rescue was too risky amid such decay, officials said. \n\nThe brief but precarious appearance by the dog, found dead at ground level days later after ingesting rat poison, represented the hopelessness posed by the vacant campus, Richmond recalled. \n\n“That's when I said, ‘This is just unacceptable in our community,'\" said the 54-year-old retired city fire marshal, whose father's Pillsbury paycheck made him and his brother first-generation college graduates.\n\nA year later, Richmond and allies emerged with a nonprofit called Moving Pillsbury Forward and a five-year, $10 million plan to raze the century-old plant and renew the 18-acre (7.3-hectare) site. \n\nRichmond, the group's president and treasurer, vice president Polly Poskin and secretary Tony DelGiorno have $6 million in commitments and targets for collecting the balance.\n\nHaving already razed two structures, the group expects the wrecking ball to swing even more feverishly next year. Next door to a railyard with nationwide connections, they envision a light industrial future. \n\nMeanwhile, Moving Pillsbury Forward has managed to turn the decrepit site in Illinois’ capital city into a leisure destination verging on cultural phenomenon. \n\nTours have been highly popular and repeated. Oral histories have emerged. Spray-paint vandals, boosted instead of busted, have become artists in residence for nighttime graffiti exhibitions, which more than 1,000 people attended. \n\nRetired University of Illinois archeologist Robert Mazrim has mined artifacts and assembled an “Echoes of Pillsbury” museum beneath a leaking loading dock roof. This month, the plant's towering headhouse is ablaze with holiday lights.\n\nPerhaps the exuberance with which Moving Pillsbury Forward approaches its task sets it apart. But in terms of activist groups pursuing such formidable reclamation aspirations, it’s not unusual, said David Holmes, a Wisconsin-based environmental scientist and brownfields redevelopment consultant. \n\nGovernment funding has expanded to accommodate them. \n\n“You find some high-caliber organizations that are really focused on the areas with the biggest problems, these most-in-need neighborhoods,” Holmes said. “A lot of times, cities (local governments) are focused on their downtowns or whatever gets the mayor the ribbon cutting.”\n\nMinneapolis-based Pillsbury built the Springfield campus in 1929 and expanded it several times through the 1950s. A bakery mix division after World War II turned out the world's first boxed cake mixes. \n\nThere is circumstantial evidence that the Pillsbury doughboy, the brand's seminal mascot, was first drawn by a Springfield plant manager who eschewed credit, not, as the company maintains, in a Chicago ad agency. \n\nPillsbury sold the plant in 1991 to Cargill, which departed a decade later. A scrap dealer ran afoul of the law with improper asbestos disposal in 2015, prompting a $3 million U.S. Environmental Protection Agency cleanup. After the dog's cameo, Moving Pillsbury Forward persuaded the EPA to drop a lien for its cleanup costs and purchased the property for $1.\n\nNow, all that’s left is to sweep up a the remaining asbestos and lead paint chips before pulling down more than 500,000 square feet (46,450 square meters) of factory, including a 242-foot (73.8-meter) headhouse that’s the city’s third-tallest structure and 160 silos, four abreast and standing 100 feet (30.5 meters).\n\n“It’s daunting. Everything about this place is daunting,” Richmond concedes. “But a journey of 1,000 miles starts with the first step, right?”\n\nThe timing is right. There is more money than ever available to mop up America's left-behinds, according to Holmes. \n\nThe 2021 Infrastructure Investment and Jobs Act included $1.2 billion for brownfields cleanup, four times the typical annual allotment The Pillsbury group wants $2.6 million of the total added to what the group already has been promised by the federal, state and Springfield governments.\n\nThe application plays up the intangible benefits: economic and environmental justice availing the 12,000 people who live within 1 mile (1.61 kilometers) of the plant, only 25% of whom have a high school diploma and whose median household income is $25,000.\n\n“It's a tough sell but at some point, there are enough people who have a vision for what it could be that that's a powerful incentive,” Poskin said. “It isn't going to be anything until what's there is gone. No developer is going to take on a $10 million cleanup job.”\n\nThe group also set out to preserve memories of the place they are working to tear down. Ex-workers and neighbors have clamored for spots in ongoing tours and posed for group photos. \n\nIn a historical seniority list on display, next to “Jackson, Ernest, 1937,” is the message, “Hi Grandpa. We are visiting your workplace of 42 yrs.” Richmond and Mazrim have collected more than a dozen oral histories from past employees. Photographers are documenting what remains for historical context.\n\nAnd it's become an unlikely canvas. Minneapolis-based graffiti artists who tag their work “Shock” and “Static” were surreptitiously decorating the place in September when Richmond and Mazrim confronted them. Instead of pressing a trespassing charge, Richmond invited them to stage an exhibition. The nighttime November showing proved so popular that Richmond added a second date.\n\nArtist Eric Rieger, known to fans as HOTTEA, also took part, creating in a “cathedral-like” setting a huge, rectangular grid of black-light-lit neon strings of yarn suspended from the ceiling. His goal was “a sense of really positive energy” reminiscent of the fond memories employees experienced.\n\n“They were so enthusiastic and that’s rare to find nowadays,\" Rieger said the night of the first exhibit Nov. 9. \"I really respect what they did for this community because they're the backbone of America — they were feeding America.”\n\n___\n\nAssociated Press researcher Randy Herschaft in New York contributed.",
        "source": "ABC News",
        "date": null,
        "category": "US News"
    },
    "ABC News-6": {
        "url": "https://abcnews.go.com/US/wireStory/disney-lawsuit-desantis-appointed-government-failing-release-public-105928134",
        "title": "Disney says in lawsuit that DeSantis-appointed government is failing to release public records",
        "image_url": "https://i.abcnewsfe.com/a/bdf4701d-4970-4000-b59a-5684f3521a04/wirestory_9b647df7816ef039eb1ec0085caa2242_16x9.jpg?w=992",
        "body": "ORLANDO, Fla. -- Disney has filed a lawsuit claiming that the oversight government for Walt Disney World, which was taken over by appointees of Gov. Ron DeSantis earlier this year, has failed to release documents and properly preserve records in violation of Florida public records law.\n\nDisney said in the lawsuit filed Friday that the Central Florida Tourism Oversight District, often referred to as CFTOD, has been so slow in fulfilling its public records duties that it has failed to respond completely to a request the company made seven months ago when it paid more than $2,400 to get emails and text messages belonging to the five district board members appointed by DeSantis.\n\nDisney, DeSantis and the DeSantis appointees already are battling for control of the government in two pending lawsuits in federal and state court. \n\nThe public records lawsuit is asking a judge to review any documents that the district claims are exempt from being released, declare that the district is violating state public records law and order the district to release the documents that Disney has requested.\n\n“CFTOD has prevented Disney from discovering the actions of its government through public records requests, in violation of Florida law,” said the lawsuit filed in state court in Orlando. “The Court should grant Disney relief.”\n\nAn email was sent to the Central Florida Tourism Oversight District seeking comment.\n\nThe new lawsuit claims that the district is failing to follow public records laws in other ways, such as allowing the DeSantis-appointed board members to use personal email addresses and texts for district business without a process for making sure they are preserved and failing to make sure board members don't auto-delete messages dealing with district business.\n\nThe feud between DeSantis and Disney started last year after the company publicly opposed the state’s so-called don’t say gay law, which bans classroom lessons on sexual orientation and gender identity in early grades. The law was championed by DeSantis, who is running for the 2024 GOP presidential nomination. In retaliation, DeSantis and Republican legislators took over the district Disney had controlled for more than five decades and installed five board members loyal to the governor. \n\nAround 50 out of about 370 employees have left the Central Florida Tourism Oversight District since it was taken over in February, raising concerns that decades of institutional knowledge are departing with them, along with a reputation for a well-run government.\n\n___\n\nFollow Mike Schneider on X, formerly known as Twitter: @MikeSchneiderAP.",
        "source": "ABC News",
        "date": null,
        "category": "US News"
    },
    "ABC News-7": {
        "url": "https://abcnews.go.com/US/federal-judge-orders-documents-naming-jeffrey-epsteins-associates/story?id=105779882",
        "title": "Federal judge orders documents naming Jeffrey Epstein's associates to be unsealed",
        "image_url": "https://s.abcnews.com/images/US/epstein_hpEmbed_20220311-184030_3x4_992.jpg",
        "body": "A federal judge in New York has ordered a vast unsealing of court documents in early 2024 that will make public the names of scores of Jeffrey Epstein's associates.\n\nThe documents are part of a settled civil lawsuit alleging Epstein's one-time paramour Ghislaine Maxwell facilitated the sexual abuse of Virginia Giuffre. Terms of the 2017 settlement were not disclosed.\n\nMaxwell is currently serving a 20-year prison sentence after she was convicted of sex trafficking and procuring girls for Epstein, who died by suicide in 2019 in a Manhattan jail while awaiting trial on federal sex trafficking charges.\n\nAnyone who did not successfully fight to keep their name out of the civil case could see their name become public -- including Epstein's victims, co-conspirators and innocent associates.\n\nJudge Loretta Preska set the release for Jan. 1, giving anyone who objects to their documents becoming public time to object. Her ruling, though, said that since some of the individuals have given media interviews their names should not stay private.\n\nThe documents may not make clear why a certain individual became associated with Giuffre's lawsuit, but more than 150 people are expected to be identified in hundreds of files that may expose more about Epstein's sex trafficking of women and girls in New York, New Mexico, the U.S. Virgin Islands and elsewhere. Some of the names may simply have been included in depositions, email or legal documents.\n\nSome of the people have already been publicly associated with Epstein. For instance, Harvard law professor Alan Dershowitz is publicly named in the judge's order. Certain minor victims will remain redacted.\n\nMaxwell, a longtime associate of Epstein, was convicted in 2021 of conspiring with Epstein to recruit, groom and abuse minors. In February, she asked the court to overturn her conviction and 20-year prison sentence.\n\nProsecutors subsequently urged a federal appeals court in June to uphold the conviction.\n\nFrom 1994 to 2004, Maxwell and Epstein worked together to identify girls, groom them and then entice them to travel and transport them to Epstein's properties in New York, Florida, New Mexico, and elsewhere, prosecutors said. The girls -- some of whom were as young as 14 years old -- were then sexually abused, often under the guise of a \"massage,\" they said.\n\nGiuffre alleged in her lawsuit against Maxwell that Maxwell recruited her at the age of 16 to years of sexual servitude to Epstein. She also accused Maxwell and Epstein of directing her, between 2000 to 2002, to have sex with a number of their prominent associates, most famously Britain's Prince Andrew. The lawsuit was settled in May 2017, just before a trial was to begin.\n\nPrince Andrew had repeatedly denied the allegations and attacked Giuffre's credibility and motives. He agreed to settle a sexual assault lawsuit from Giuffre last year for an undisclosed sum.\n\n\"Prince Andrew has never intended to malign Ms. Giuffre's character, and he accepts that she has suffered both as an established victim of abuse and as a result of unfair public attacks,\" according to a letter filed from Giuffre's lawyer. \"It is known that Jeffrey Epstein trafficked countless young girls over many years. Prince Andrew regrets his association with Epstein, and commends the bravery of Ms. Giuffre and other survivors in standing up for themselves and others.\"",
        "source": "ABC News",
        "date": null,
        "category": "US News"
    },
    "ABC News-8": {
        "url": "https://abcnews.go.com/US/wireStory/marjorie-taylor-greene-targeted-failed-christmas-swatting-attempt-105913344",
        "title": "Rep. Marjorie Taylor Greene targeted by failed Christmas swatting attempt",
        "image_url": "https://i.abcnewsfe.com/a/067ea562-b61f-467d-8d35-86c689541c4b/wirestory_2081fd3835512cc3180aa1171fc5913d_16x9.jpg?w=992",
        "body": "Republican U.S. Rep. Marjorie Taylor Greene was the target of a swatting attempt at her Georgia residence on Christmas morning, the congresswoman and local police said, marking the latest instance of someone calling in a fake emergency to draw armed officers or SWAT teams to her home.\n\nThe Rome Police Department quickly verified that the call was a hoax and did not send officers to the house, department spokesperson Kelly Madden said.\n\n“I was just swatted. This is like the 8th time. On Christmas with my family here. My local police are the GREATEST and shouldn’t have to deal with this,” Greene wrote in a post on X, formerly Twitter.\n\nA man in New York called the Georgia suicide hotline just before 11 a.m. Monday, claiming that he had shot his girlfriend at Greene's home and was going to kill himself next, Madden said. The call was quickly transferred to police when suicide hotline responders recognized the Georgia congresswoman's address.\n\nThe department said it contacted Greene's private security detail to confirm she was safe and that there was no emergency at her residence. The call was then determined to be a swatting attempt so the police response was canceled en route, Madden explained.\n\n“We determined before our personnel could get to her location that there was no emergency and there was no reason to respond,” she said. “Her security detail had it all under control, and there actually was nothing going on.”\n\nThe congresswoman, who represents the cities of Rome, Dalton and Calhoun in northwest Georgia, spent her first term stripped of committee assignments by the former House Democratic majority over racist comments, her embrace of conspiracy theories and her past endorsement of violence against Democratic officials. She has since gained more influence under the House’s current Republican leadership and continues to be a firebrand for the far-right.\n\nGreene's statement that she has been the target of roughly eight swatting attempts is accurate, Madden said. Past calls claimed that dead bodies had been found in the bathtub and in other areas of her home, which is located about 70 miles (113 kilometers) northwest of Atlanta. Police also responded last year to false reports of shootings outside her residence. \n\nThe department said it sent officers to the house in response to those prior incidents but has since formed a close working relationship with Greene's security detail, which allows officers to better assess the threat level. The criminal investigations division is working to identify Monday's caller and build a case, Madden said.\n\nAnother New York man was sentenced in August to three months in prison for making threatening phone calls to Greene's office in Washington, D.C.\n\nRepublican U.S. Rep. Brandon Williams said in a post on X that he was also targeted by a swatting attempt on Christmas Day. The Cayuga County Sheriff's office said it received a false report of a shooting at the congressman’s home in central New York and sent officers to confirm that there was no present danger. Sheriff Brian Schenck did not immediately respond to phone messages seeking further details.\n\n“Our home was swatted this afternoon,” Williams wrote. “Thanks to the Deputies and Troopers who contacted me before arriving. They left with homemade cookies and spiced nuts! Merry Christmas everyone!”",
        "source": "ABC News",
        "date": null,
        "category": "US News"
    },
    "ABC News-9": {
        "url": "https://abcnews.go.com/US/wireStory/appellate-court-reverses-federal-conviction-former-nebraska-us-105926225",
        "title": "Court reverses former US Rep. Fortenberry conviction of lying to federal authorities",
        "image_url": "https://i.abcnewsfe.com/a/0da4eb7a-b786-4a88-9aef-c7b395de9368/wirestory_87ae8166a867b9f98f4c352748c6c521_16x9.jpg?w=992",
        "body": "LOS ANGELES -- An appellate court on Tuesday reversed a 2022 federal conviction against former Rep. Jeff Fortenberry of Nebraska, ruling that he should not have been tried in Los Angeles. \n\nFortenberry was convicted in March 2022 on charges that he lied to federal authorities about an illegal $30,000 contribution to his campaign from a foreign billionaire at a 2016 Los Angeles fundraiser. He resigned his seat days later following pressure from congressional leaders and Nebraska’s GOP governor.\n\nIn its Tuesday ruling, the U.S. Court of Appeals for the Ninth Circuit wrote that the trial venue of Los Angeles was improper because Fortenberry made the false statements during interviews with federal agents at his home in Lincoln, Nebraska, and in his lawyer’s office in Washington.\n\n“Fortenberry’s convictions are reversed so that he may be retried, if at all, in a proper venue,” the decision said.\n\nA federal jury in Los Angeles found the nine-term Republican guilty of concealing information and two counts of making false statements to authorities. He vowed to appeal from the courthouse steps.\n\nFortenberry and his wife, Celeste Fortenberry, praised the court’s decision.\n\n“We are gratified by the Ninth Circuit’s decision,” Jeff Fortenberry said in a statement. “Celeste and I would like to thank everyone who has stood by us and supported us with their kindness and friendship.”\n\nThom Mrozek, a spokesperson for the U.S. Attorney’s Office in Los Angeles, noted that the appellate court left a path open for future proceedings against Fortenberry.\n\n“The ruling does not preclude a retrial on the charges that then-Congressman Fortenberry made multiple false statements to federal agents,\" Mrozek said in a statement. \"We are evaluating potential next steps before deciding how best to move forward.”\n\nPatricia Hartman, a spokesperson for the U.S. Attorney’s Office for the District of Columbia, declined to comment on the ruling’s potential impact for federal prosecutors in Washington.\n\n“We cannot comment on matters where we don’t have charges filed,” she said in an email Tuesday.\n\nA spokesperson for the U.S. Attorney’s Office in Nebraska did not immediately return a phone message.\n\nFortenberry was charged after denying to the FBI that he was aware he had received illicit funds from Gilbert Chagoury, a Nigerian billionaire of Lebanese descent.\n\nAt trial, prosecutors presented recorded phone conversations in which Fortenberry was repeatedly warned that the contributions came from Gilbert Chagoury, a Nigerian billionaire of Lebanese descent. The donations were funneled through three strawmen at the 2016 fundraiser in Los Angeles.\n\nThe case stemmed from an FBI investigation into $180,000 in illegal campaign contributions to four campaigns from Chagoury, who lived in Paris at the time. Chagoury admitted to the crime in 2019 and agreed to pay a $1.8 million fine.\n\nIt was the first trial of a sitting congressman since Rep. Jim Traficant, D-Ohio, was convicted of bribery and other felony charges in 2002.",
        "source": "ABC News",
        "date": null,
        "category": "US News"
    },
    "ABC News-10": {
        "url": "https://abcnews.go.com/US/1-dead-2-injured-colorado-mall-shooting-christmas/story?id=105904783",
        "title": "Search for suspects continues in Christmas Eve Colorado mall shooting that left 1 dead, 3 hurt ",
        "image_url": "https://i.abcnewsfe.com/a/561dd2a5-0f56-47cb-98e4-bfe51213ef52/shooting-ht-ml-231226_1703602047722_hpMain_16x9.jpg",
        "body": "The search for suspects in a Christmas Eve shooting at The Citadel Mall in Colorado Springs, Colorado, continued Tuesday, with police saying the preliminary investigation indicates the gunfire that left one man dead and two seriously injured was from a \"targeted\" attack.\n\nThe incident occurred around 4:34 p.m. local time on Sunday and allegedly began with a disagreement between two groups that ended in a shooting, according to police.\n\n\"We believe this was a targeted shooting, and the two groups of individuals fighting were known to one another,\" a spokesperson for the Colorado Springs Police Department told ABC News on Tuesday.\n\nOne man died on the scene of an apparent gunshot wound, and two were taken to the hospital in serious condition, police said. A woman was injured but was not shot in the incident and was taken to a hospital in stable condition.\n\nMultiple people were initially detained following the incident, but were released without being charged after being questioned, police said.\n\nThe police have asked anyone who has information about the incident to call them at (719) 444-7000.\n\nThe incident is not expected to impact the previously planned Tuesday reopening of The Citadel Mall, police said.",
        "source": "ABC News",
        "date": null,
        "category": "US News"
    },
    "ABC News-11": {
        "url": "https://abcnews.go.com/US/florida-mall-shooting-ocala/story?id=105893779",
        "title": "Florida mall shooting: Reward up to $10,000 as police hunt for suspect",
        "image_url": "https://i.abcnewsfe.com/a/d6bf7ed0-ca40-468f-bb8e-0168a0e4fdde/david-barron-ht-jef-231225_1703599959712_hpEmbed_4x5.jpg",
        "body": "Police are looking for a suspect, as well as a bystander who took evidence from the crime scene, after a deadly shooting erupted at a Florida mall during the holiday shopping rush.\n\nOne person was killed and another was shot and wounded in the apparent targeted shooting at the Paddock Mall in Ocala Saturday afternoon.\n\nThe suspect, 39-year-old Albert J. Shell Jr., is wanted on charges of premeditated first-degree murder and attempted premeditated first-degree murder, police said.\n\nA $10,000 reward is available for information leading to his arrest.\n\nThe slain victim, 40-year-old David Nathaniel Barron, was found dead in a common area of the mall when police arrived, authorities said. He is believed to have been the target, Ocala Police Chief Mike Balken said.\n\nA woman was shot and injured and taken to a hospital with non-life-threatening injuries, authorities said. Other injuries stemming from the incident included chest pains and a broken arm, Balken said.\n\nPolice issued a statement Sunday urging the person who took the suspect's red hat from the mall to come forward.\n\n\"That hat may contain valuable DNA evidence,\" police said. \"If you do not return the hat within the next few hours, we will release your picture ... and you will be arrested with a felony charge of tampering with evidence.\"\n\nThe mall, which was packed with shoppers ahead of the holiday, was evacuated after the gunfire broke out.\n\n\"This is the worst thing we can imagine right now at this time of the year,\" Balken said. \"Somebody has suffered a loss in their family. It's a horrible time of year for this to happen ever. It's especially sad during the holidays.\"\n\nSyriah Williams, 18, told ABC News she was shopping at Bath & Body Works with her mother when she heard several shots ring out and \"chaos erupted.\"\n\n\"The employees opened the back storage area and told everyone to run,\" said Williams, who took cover behind the counters at the store.\n\nOcala Gazette owner Jennifer Hunt Murty told ABC News Radio she was volunteering at a gift-wrapping station when gunfire erupted about 10 feet away from her.\n\n\"We dropped to the ground,\" she said. \"I texted the police chief and said active shooter in the mall, and he responded right away.\"\n\nShe said she texted the chief where the injured victims were so medics could get to them, and after it seemed safe began interviewing people and taking photos.\n\n\"You never know how you're going to react in those situations, but I went to work,\" she said.\n\nPolice recovered a gun from the scene believed to have been used in the shooting, Balken said.\n\nThe mall will be closed Sunday and Monday.\n\nABC News' Layla Ferris contributed to this report.",
        "source": "ABC News",
        "date": null,
        "category": "US News"
    },
    "ABC News-12": {
        "url": "https://abcnews.go.com/US/dangerous-blizzard-conditions-hit-plains-latest-forecast/story?id=105917178",
        "title": "Dangerous blizzard conditions hit the Plains: Latest forecast",
        "image_url": "https://i.abcnewsfe.com/a/94e1ad94-44f8-4d3d-b911-54be3c85cac0/snowfall-1-ht-bb-231226_1703599097973_hpMain.jpg",
        "body": "An intense winter storm is slamming the Plains with blizzard warnings across Colorado, Wyoming, Kansas, Nebraska and South Dakota.\n\nSnow totals have reached 13 inches in some areas so far and wind gusts have topped 60 mph.\n\nUp to half an inch of ice is coating trees and power lines from Minnesota to North Dakota.\n\nThe blizzard will continue into Wednesday, with more gusty winds and another 4 to 8 inches of snow from South Dakota to Colorado.\n\nThe same storm is also bringing 2 to 4 inches of rain to the South on Tuesday. Flooding is possible in Georgia, South Carolina, North Carolina and Virginia.\n\nSome of this heavy rain will move up the East Coast on Tuesday night. Heavy rain is expected in Washington, D.C., Wednesday morning and in New York City in the afternoon.",
        "source": "ABC News",
        "date": null,
        "category": "US News"
    },
    "ABC News-13": {
        "url": "https://abcnews.go.com/US/wireStory/disney-lawsuit-desantis-appointed-government-failing-release-public-105928134",
        "title": "Disney says in lawsuit that DeSantis-appointed government is failing to release public records",
        "image_url": "https://i.abcnewsfe.com/a/bdf4701d-4970-4000-b59a-5684f3521a04/wirestory_9b647df7816ef039eb1ec0085caa2242_16x9.jpg?w=992",
        "body": "ORLANDO, Fla. -- Disney has filed a lawsuit claiming that the oversight government for Walt Disney World, which was taken over by appointees of Gov. Ron DeSantis earlier this year, has failed to release documents and properly preserve records in violation of Florida public records law.\n\nDisney said in the lawsuit filed Friday that the Central Florida Tourism Oversight District, often referred to as CFTOD, has been so slow in fulfilling its public records duties that it has failed to respond completely to a request the company made seven months ago when it paid more than $2,400 to get emails and text messages belonging to the five district board members appointed by DeSantis.\n\nDisney, DeSantis and the DeSantis appointees already are battling for control of the government in two pending lawsuits in federal and state court. \n\nThe public records lawsuit is asking a judge to review any documents that the district claims are exempt from being released, declare that the district is violating state public records law and order the district to release the documents that Disney has requested.\n\n“CFTOD has prevented Disney from discovering the actions of its government through public records requests, in violation of Florida law,” said the lawsuit filed in state court in Orlando. “The Court should grant Disney relief.”\n\nAn email was sent to the Central Florida Tourism Oversight District seeking comment.\n\nThe new lawsuit claims that the district is failing to follow public records laws in other ways, such as allowing the DeSantis-appointed board members to use personal email addresses and texts for district business without a process for making sure they are preserved and failing to make sure board members don't auto-delete messages dealing with district business.\n\nThe feud between DeSantis and Disney started last year after the company publicly opposed the state’s so-called don’t say gay law, which bans classroom lessons on sexual orientation and gender identity in early grades. The law was championed by DeSantis, who is running for the 2024 GOP presidential nomination. In retaliation, DeSantis and Republican legislators took over the district Disney had controlled for more than five decades and installed five board members loyal to the governor. \n\nAround 50 out of about 370 employees have left the Central Florida Tourism Oversight District since it was taken over in February, raising concerns that decades of institutional knowledge are departing with them, along with a reputation for a well-run government.\n\n___\n\nFollow Mike Schneider on X, formerly known as Twitter: @MikeSchneiderAP.",
        "source": "ABC News",
        "date": null,
        "category": "US News"
    },
    "ABC News-14": {
        "url": "https://abcnews.go.com/US/wireStory/marjorie-taylor-greene-targeted-failed-christmas-swatting-attempt-105913344",
        "title": "Rep. Marjorie Taylor Greene targeted by failed Christmas swatting attempt",
        "image_url": "https://i.abcnewsfe.com/a/067ea562-b61f-467d-8d35-86c689541c4b/wirestory_2081fd3835512cc3180aa1171fc5913d_16x9.jpg?w=992",
        "body": "Republican U.S. Rep. Marjorie Taylor Greene was the target of a swatting attempt at her Georgia residence on Christmas morning, the congresswoman and local police said, marking the latest instance of someone calling in a fake emergency to draw armed officers or SWAT teams to her home.\n\nThe Rome Police Department quickly verified that the call was a hoax and did not send officers to the house, department spokesperson Kelly Madden said.\n\n“I was just swatted. This is like the 8th time. On Christmas with my family here. My local police are the GREATEST and shouldn’t have to deal with this,” Greene wrote in a post on X, formerly Twitter.\n\nA man in New York called the Georgia suicide hotline just before 11 a.m. Monday, claiming that he had shot his girlfriend at Greene's home and was going to kill himself next, Madden said. The call was quickly transferred to police when suicide hotline responders recognized the Georgia congresswoman's address.\n\nThe department said it contacted Greene's private security detail to confirm she was safe and that there was no emergency at her residence. The call was then determined to be a swatting attempt so the police response was canceled en route, Madden explained.\n\n“We determined before our personnel could get to her location that there was no emergency and there was no reason to respond,” she said. “Her security detail had it all under control, and there actually was nothing going on.”\n\nThe congresswoman, who represents the cities of Rome, Dalton and Calhoun in northwest Georgia, spent her first term stripped of committee assignments by the former House Democratic majority over racist comments, her embrace of conspiracy theories and her past endorsement of violence against Democratic officials. She has since gained more influence under the House’s current Republican leadership and continues to be a firebrand for the far-right.\n\nGreene's statement that she has been the target of roughly eight swatting attempts is accurate, Madden said. Past calls claimed that dead bodies had been found in the bathtub and in other areas of her home, which is located about 70 miles (113 kilometers) northwest of Atlanta. Police also responded last year to false reports of shootings outside her residence. \n\nThe department said it sent officers to the house in response to those prior incidents but has since formed a close working relationship with Greene's security detail, which allows officers to better assess the threat level. The criminal investigations division is working to identify Monday's caller and build a case, Madden said.\n\nAnother New York man was sentenced in August to three months in prison for making threatening phone calls to Greene's office in Washington, D.C.\n\nRepublican U.S. Rep. Brandon Williams said in a post on X that he was also targeted by a swatting attempt on Christmas Day. The Cayuga County Sheriff's office said it received a false report of a shooting at the congressman’s home in central New York and sent officers to confirm that there was no present danger. Sheriff Brian Schenck did not immediately respond to phone messages seeking further details.\n\n“Our home was swatted this afternoon,” Williams wrote. “Thanks to the Deputies and Troopers who contacted me before arriving. They left with homemade cookies and spiced nuts! Merry Christmas everyone!”",
        "source": "ABC News",
        "date": null,
        "category": "US News"
    },
    "ABC News-15": {
        "url": "https://abcnews.go.com/US/wireStory/6-year-boy-traveling-visit-grandma-christmas-put-105922495",
        "title": "6-year-old boy traveling to visit grandma for Christmas put on wrong Spirit flight",
        "image_url": "https://s.abcnews.com/images/GMA/GettyImages-1723615538_1703649872232_hpMain_1x1_144.jpg",
        "body": "FORT MYERS, Fla. -- A 6-year-old boy who left on a flight for the Christmas holiday to visit his grandmother in southwest Florida instead was put on the wrong plane and ended up 160 miles away in Orlando, Florida.\n\nWhen the grandmother, Maria Ramos, showed up on Thursday at Southwest Florida International Airport in Fort Myers to greet her grandson who was flying for the first time from Philadelphia, she was told he wasn't on the Spirit Airlines flight. \n\n“I ran inside the plane to the flight attendant and I asked her, ‘Where’s my grandson? He was handed over to you at Philadelphia?’ She said, ‘No, I had no kids with me,'” Ramos told WINK News.\n\nShe then got a call from her grandson from the airport in Orlando, telling her that he had landed.\n\nIn a statement, Spirit Airlines said the boy was under the care and supervision of an airlines employee the entire time, even though he was incorrectly boarded on a flight to Orlando. Once the mistake was discovered, the airlines let the family know, the statement said.\n\n“We take the safety and responsibility of transporting all of our Guests seriously and are conducting an internal investigation,” the statement said. “We apologize to the family for this experience.”",
        "source": "ABC News",
        "date": null,
        "category": "US News"
    },
    "Associated Press (AP)-0": {
        "url": "https://apnews.com/article/biden-kataib-hezbollah-drone-strike-us-military-injured-b4b4480e2cae6e7ad26e88eb625ab397",
        "title": "Biden orders strikes on an Iranian-aligned group after 3 US troops wounded in drone attack in Iraq",
        "image_url": "https://dims.apnews.com/dims4/default/8d9c05b/2147483647/strip/true/crop/5000x3328+0+2/resize/320x213!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F25%2Fd5%2Fdbb7d2c3febcbb17863212e9dade%2Fbe533bd8eb73479eab08133bcce7d37e",
        "body": "WASHINGTON (AP) — U.S. President Joe Biden ordered the United States military to carry out retaliatory airstrikes against Iranian-backed militia groups after three U.S. service members were injured in a drone attack in northern Iraq.\n\nNational Security Council spokesperson Adrienne Watson said one of the U.S. troops suffered critical injuries in the attack that occurred earlier Monday. The Iranian-backed militia Kataib Hezbollah and affiliated groups, under an umbrella of Iranian-backed militants, claimed credit for the attack that utilized a one-way attack drone.\n\nIraqi officials said that U.S. strikes targeting militia sites early Tuesday killed one militant and wounded 18. They came at a time of heightened fears of a regional spillover of the Israel-Hamas war. \n\nIran announced Monday that an Israeli strike on the outskirts of the Syrian capital of Damascus killed one of its top generals, Seyed Razi Mousavi, who had been a close companion of Gen. Qassem Soleimani, the former head of Iran’s elite Quds Force. Soleimani was slain in a U.S. drone strike in Iraq in January 2020.\n\nIranian officials vowed revenge for the killing of Mousavi, but didn’t immediately launch a retaliatory strike. The militia attack Monday in northern Iraq was launched prior to the strike in Syria that killed Mousavi.\n\n\n\n\nBiden, who was spending Christmas at the presidential retreat at Camp David, Maryland, was alerted to the attack by White House national security adviser Jake Sullivan shortly after it occurred Monday and ordered the Pentagon and his top national security aides to prepare response options to the attack on an air base used by American troops in Irbil.\n\nSullivan consulted with U.S. Defense Secretary Lloyd Austin. Biden’s deputy national security adviser, Jon Finer, was with the president at Camp David and convened top aides to review options, according to a U.S. official, who wasn’t authorized to comment publicly and requested anonymity.\n\nWithin hours, Biden convened his national security team for a call in which Austin and Gen. CQ Brown, chair of the Joint Chiefs of Staff, briefed Biden on the response options. Biden opted to target three locations used by Kataib Hezbollah and affiliated groups, the official said.\n\nThe U.S. strikes were carried out at about 4:45 a.m. Tuesday in Iraq, less than 13 hours after the U.S. personnel were attacked. According to U.S. Central Command, the retaliatory strikes on the three sites “destroyed the targeted facilities and likely killed a number of Kataib Hezbollah militants.”\n\n“The President places no higher priority than the protection of American personnel serving in harm’s way,” Watson said. “The United States will act at a time and in a manner of our choosing should these attacks continue.”\n\nThe latest attack on U.S. troops follows months of escalating threats and actions against American forces in the region since the Oct. 7 Hamas attack on Israel that sparked the devastating war in Gaza. \n\nThe dangerous back-and-forth strikes have escalated since Iranian-backed militant groups under the umbrella group called the Islamic Resistance in Iraq and Syria began striking U.S. facilities Oct. 17, the date that a blast at a hospital in Gaza killed hundreds. Iranian-backed militias have carried out more than 100 attacks on U.S. bases in Iraq and Syria since the start of the Israel-Hamas war more than two months ago.\n\nIn November, U.S. fighter jets struck a Kataib Hezbollah operations center and command and control node, following a short-range ballistic missile attack on U.S. forces at Al-Assad Air Base in western Iraq. Iranian-backed militias also carried out a drone attack at the same air base in October, causing minor injuries.\n\nThe U.S. has also blamed Iran, which has funded and trained the Hamas group, for attacks by Yemen’s Houthi militants against commercial and military vessels through a critical shipping choke point in the Red Sea.\n\nThe Biden administration has sought to prevent the Israel-Hamas war from spiraling into a wider regional conflict that either opens up new fronts of Israeli fighting or draws the U.S. in directly. The administration’s measured response — where not every attempt on American troops has been met with a counterattack — has drawn criticism from Republicans. \n\nThe U.S. has thousands of troops in Iraq training Iraqi forces and combating remnants of the Islamic State group, and hundreds in Syria, mostly on the counter-IS mission. They have come under dozens of attacks, though as yet none fatal, since the war began on Oct. 7, with the U.S. attributing responsibility to Iran-backed groups.\n\n“While we do not seek to escalate conflict in the region, we are committed and fully prepared to take further necessary measures to protect our people and our facilities,” Austin said in a statement.\n\nThe clashes put the government of Iraqi Prime Minister Mohammed Shia al-Sudani in a delicate position. He came to power in 2022 with the backing of a coalition of Iranian-backed parties, some of which are associated with the same militias launching the attacks on U.S. bases.\n\nA group of Iranian-backed militias known as the Popular Mobilization Forces were key in the fight against Islamic State militants after the extremist group overran much of Iraq in 2014. The PMF is officially under the command of the Iraqi army, but in practice the militias operate independently.\n\nIn a statement Tuesday, Sudani condemned both the militia attack in Irbil and the U.S. response.\n\nAttacks on “foreign diplomatic mission headquarters and sites hosting military advisers from friendly nations … infringe upon Iraq’s sovereignty and are deemed unacceptable under any circumstances,” the statement said.\n\nHowever, it added that that the retaliatory strikes by the U.S. on “Iraqi military sites” — referring to the militia — “constitute a clear hostile act.” Sudani said some of those injured in the strikes were civilians.\n\nQassim Abdul-Zahra reported from Baghdad.",
        "source": "Associated Press (AP)",
        "date": null,
        "category": "US News"
    },
    "Associated Press (AP)-1": {
        "url": "https://apnews.com/article/christmas-2023-stores-open-closed-6383766a6209b34825df15fda3a20e6c",
        "title": "What stores are open and closed on Christmas Day in 2023? Hours for Walmart, Kroger, CVS and more",
        "image_url": null,
        "body": "NEW YORK (AP) — With Christmas right around the corner, you might want to check the list of what stores are open (and closed) twice.\n\nFrom retail to grocery chains, many companies across the U.S. close early on Christmas Eve and shut their doors entirely on Christmas Day — while others opt to cut back hours. But there’s also a handful of businesses that stay open on the holiday.\n\nBefore you run out the door this Christmas — whether it’s to buy last-minute gifts or simply get out of the house — it’s wise to double-check operating hours, which can range by location. When in doubt, call ahead or look up more specific schedules for spots in your neighborhood online.\n\nHere’s a rundown of how major chains are operating this Christmas Day.\n\n\n\n\nWalmart will be closed on Christmas Day — and reopen at 6 a.m. Dec. 26.\n\nMost Target stores will be closed on Christmas and reopen at 7 a.m. Dec. 26. You can check location hours here.\n\nAll Costco warehouses in the U.S. are closed on Christmas Day.\n\nMany CVS Pharmacy locations will operate with normal hours on Christmas, but some non-24 locations may be closed or have reduced hours. Customers are encouraged to call ahead or double-check local hours online.\n\nMost Walgreens stores will have adjusted hours of 9am-5pm on Christmas Day. All 24-hour locations will continue to remain open. You can double-check local hours here.\n\nMany Starbucks locations will be open on Christmas, but hours can vary — with the company noting that “stores may occasionally adjust their hours based on business and customer needs” throughout the holiday season. It’s best to check ahead online.\n\nMost McDonald’s locations in the U.S. are open on holidays like Christmas, but hours vary by location. Consumers can use the chain’s online store locator to confirm.\n\nMost Kroger stores are closed on Christmas Day, although that can vary depending on store division and location.\n\nMany Albertsons stores will be closed on Christmas — but there will also be locations that remain open with adjusted hours. Select pharmacies may also be closed or have different hours.\n\nHere’s some other grocery, convenience and retail stores that are closed on Christmas Day:\n\n1. ALDI: Stores are closed.\n\n2. Harris Teeter: Stores are closed.\n\n3. Home Depot: Stores are closed.\n\n4. IKEA: Stores are closed.\n\n5. Jewel-Osco: Stores and pharmacies are closed.\n\n6. Lowe’s: Stores are closed.\n\n7. Macy’s: Stores are closed.\n\n8. Meijer: Stores are closed.\n\n9. Publix: Stores are closed.\n\n10. Rite Aid: Stores are closed.\n\n11. Sam’s Club: Stores are closed.\n\n12. Sprouts Farmer’s Market: Stores are closed.\n\n13. Trader Joe’s: Stores are closed.\n\n14. Whole Foods: Stores are closed.\n\nHere are some other stores that are open on Christmas Day (or have select locations that are):\n\n1. Safeway: Many stores are closed, but there will also be open locations with adjusted hours.\n\n2. Sheetz: Stores are open with regular hours (24/7).\n\n3. 7-Eleven: Most stores are open 24/7 (including on Christmas), but some locations’ hours can vary.",
        "source": "Associated Press (AP)",
        "date": null,
        "category": "US News"
    },
    "Associated Press (AP)-2": {
        "url": "https://apnews.com/article/american-citizens-permanent-legal-residents-trapped-gaza-3d1dda48bed40c8b3e0dc2efa11caf9a",
        "title": "Americans beg for help getting family out of Gaza. “I just want to see my mother again,’ a son says",
        "image_url": null,
        "body": "WASHINGTON (AP) — Fadi Sckak has already lost his father to the violence in Gaza. He wants to help his mother escape that fate.\n\n“I just want to see my mother again, that’s the goal,” said Sckak, a university student in Sunnyvale, California. The 25-year-old is one of the Palestinian couple’s three American sons, including an active-duty U.S. soldier serving in South Korea. “Being able to hold her again. I can’t bear to lose her.” \n\nHis mother, Zahra Sckak, 44, was holed up Saturday with an older, ailing American relative in a Gaza City building along with 100 others. She is among what the State Department says are 300 American citizens, permanent legal residents or their parents and young children still trapped by the fighting between Israel and Hamas militants in Gaza.\n\nRelatives in the United States and other advocates are pleading for the Biden administration and Congress to help them flee.\n\nGaza’s Health Ministry has reported more than 20,000 deaths in the fighting and more than 53,600 wounded. According to the United Nations, more than a half-million people are starving in Gaza because of the war.\n\n\n\n\nFadi Sckak’s mother was on her sixth day with only water from the sewers to drink and with little or no food and rescue hopes waning, he said. His dad, Abedalla, was shot and wounded last month, after a bombing forced the family to flee the building where they had been sheltering, and died days later without treatment, he said.\n\nTheir son had listened over the phone as his mother begged for help after the shooting. He could hear his 56-year-old father, who had diabetes and corresponding health problems, in the background, crying out in pain.\n\n“He didn’t deserve a painful experience like that. To die, with no help, no one even trying to help,” Sckak said. \n\nSome U.S. citizens and legal residents and their immediate family are stranded near Gaza’s Rafah crossing into Egypt, desperately waiting for placement on a list of U.S.-government-provided names that would authorize them to leave Gaza. \n\nOthers, like Zahra Schkak, are trapped by fighting, and some are too ill or wounded to reach the crossing. They tell their families in voice messages and sporadic phone calls and texts of danger, hunger and fear.\n\n“This is the part of the missile that fall down on our heads yesterday,” American citizen Borak Alagha, 18, texted his cousin, Yasmeen Elagha, a law student in Chicago, sending a photo of him holding a jagged chunk of metal.\n\n“This is the hole next to the place we are living now,” Alagha said in another text. It showed a deep bomb crater next to their building near Khan Younis, where the family of 10 fled after Israeli officials identified the area as a safe place for civilians.\n\nYasmeen Elagha has reached out to State Department officials and members of a special task force. She has sued to force the U.S. government to do more after hearing from American officials that there is noting more they can do at the moment.\n\n“They are fully leaving them for dead,” she said.\n\nThe State Department said Friday it has helped more than 1,300 people who were eligible for U.S. assistance — American citizens, green-card holders and their immediate family members — make it through the Rafah crossing to Egypt. The department is tracking 300 more still seeking U.S. help to escape; that includes what it says are fewer than 50 U.S. citizens.\n\n“U.S. citizens and their families will make their own decisions and adjust their plans as this difficult situation changes,” the department said in a statement.\n\nThe case of Sckak’s family in Gaza has gotten more attention in Washington, given 24-year-old Ragi Sckak’s Army duty in South Korea.\n\nRep. Ro Khanna, D-Calif., said he has pushed the administration to get Americans out of Gaza. “I know this is a top priority for the administration,” he said in a statement, adding that U.S. officials would “exhaust every option.”\n\nMaria Kari is an immigration lawyer in Houston working on behalf of the stranded American citizens and legal residents. She points to the air and sea charters that the U.S. helped arrange to bring out more than 1,000 Americans and others from Israel after the Hamas attacks on Oct. 7 that started the war.\n\nShe has filed a lawsuit accusing the U.S. government of failing to protect Americans in danger abroad and unconstitutionally denying Palestinian Americans the kind of assistance it gave Israeli Americans.\n\n“We’re not asking them to do anything political here,” she said. “We’re simply saying the State Department has a job. And it’s not doing that job, for one class of citizens.”",
        "source": "Associated Press (AP)",
        "date": null,
        "category": "US News"
    },
    "Associated Press (AP)-3": {
        "url": "https://apnews.com/article/election-2024-misinformation-ai-social-media-trump-6119ee6f498db10603b3664e9ad3e87e",
        "title": "As social media guardrails fade and AI deepfakes go mainstream, experts warn of impact on elections",
        "image_url": null,
        "body": "NEW YORK (AP) — Nearly three years after rioters stormed the U.S. Capitol, the false election conspiracy theories that drove the violent attack remain prevalent on social media and cable news: suitcases filled with ballots, late-night ballot dumps, dead people voting.\n\nExperts warn it will likely be worse in the coming presidential election contest. The safeguards that attempted to counter the bogus claims the last time are eroding, while the tools and systems that create and spread them are only getting stronger.\n\nMany Americans, egged on by former President Donald Trump, have continued to push the unsupported idea that elections throughout the U.S. can’t be trusted. A majority of Republicans (57%) believe Democrat Joe Biden was not legitimately elected president.\n\nMeanwhile, generative artificial intelligence tools have made it far cheaper and easier to spread the kind of misinformation that can mislead voters and potentially influence elections. And social media companies that once invested heavily in correcting the record have shifted their priorities.\n\n“I expect a tsunami of misinformation,” said Oren Etzioni, an artificial intelligence expert and professor emeritus at the University of Washington. “I can’t prove that. I hope to be proven wrong. But the ingredients are there, and I am completely terrified.”\n\n\n\n\nManipulated images and videos surrounding elections are nothing new, but 2024 will be the first U.S. presidential election in which sophisticated AI tools that can produce convincing fakes in seconds are just a few clicks away.\n\nThe fabricated images, videos and audio clips known as deepfakes have started making their way into experimental presidential campaign ads. More sinister versions could easily spread without labels on social media and fool people days before an election, Etzioni said.\n\n“You could see a political candidate like President Biden being rushed to a hospital,” he said. “You could see a candidate saying things that he or she never actually said. You could see a run on the banks. You could see bombings and violence that never occurred.”\n\nHigh-tech fakes already have affected elections around the globe, said Larry Norden, senior director of the elections and government program at the Brennan Center for Justice. Just days before Slovakia’s recent elections, AI-generated audio recordings impersonated a liberal candidate discussing plans to raise beer prices and rig the election. Fact-checkers scrambled to identify them as false, but they were shared as real across social media regardless.\n\nThese tools might also be used to target specific communities and hone misleading messages about voting. That could look like persuasive text messages, false announcements about voting processes shared in different languages on WhatsApp, or bogus websites mocked up to look like official government ones in your area, experts said.\n\nFaced with content that is made to look and sound real, “everything that we’ve been wired to do through evolution is going to come into play to have us believe in the fabrication rather than the actual reality,” said misinformation scholar Kathleen Hall Jamieson, director of the Annenberg Public Policy Center at the University of Pennsylvania.\n\nRepublicans and Democrats in Congress and the Federal Election Commission are exploring steps to regulate the technology, but they haven’t finalized any rules or legislation. That’s left states to enact the only restrictions so far on political AI deepfakes.\n\nA handful of states have passed laws requiring deepfakes to be labeled or banning those that misrepresent candidates. Some social media companies, including YouTube and Meta, which owns Facebook and Instagram, have introduced AI labeling policies. It remains to be seen whether they will be able to consistently catch violators.\n\nIt was just over a year ago that Elon Musk bought Twitter and began firing its executives, dismantling some of its core features and reshaping the social media platform into what’s now known as X.\n\nSince then, he has upended its verification system, leaving public officials vulnerable to impersonators. He has gutted the teams that once fought misinformation on the platform, leaving the community of users to moderate itself. And he has restored the accounts of conspiracy theorists and extremists who were previously banned.\n\nThe changes have been applauded by many conservatives who say Twitter’s previous moderation attempts amounted to censorship of their views. But pro-democracy advocates argue the takeover has shifted what once was a flawed but useful resource for news and election information into a largely unregulated echo chamber that amplifies hate speech and misinformation.\n\nTwitter used to be one of the “most responsible” platforms, showing a willingness to test features that might reduce misinformation even at the expense of engagement, said Jesse Lehrich, co-founder of Accountable Tech, a nonprofit watchdog group.\n\n“Obviously now they’re on the exact other end of the spectrum,” he said, adding that he believes the company’s changes have given other platforms cover to relax their own policies. X didn’t answer emailed questions from The Associated Press, only sending an automated response.\n\nIn the run-up to 2024, X, Meta and YouTube have together removed 17 policies that protected against hate and misinformation, according to a report from Free Press, a nonprofit that advocates for civil rights in tech and media.\n\nIn June, YouTube announced that while it would still regulate content that misleads about current or upcoming elections, it would stop removing content that falsely claims the 2020 election or other previous U.S. elections were marred by “widespread fraud, errors or glitches.” The platform said the policy was an attempt to protect the ability to “openly debate political ideas, even those that are controversial or based on disproven assumptions.”\n\nLehrich said even if tech companies want to steer clear of removing misleading content, “there are plenty of content-neutral ways” platforms can reduce the spread of disinformation, from labeling months-old articles to making it more difficult to share content without reviewing it first.\n\nX, Meta and YouTube also have laid off thousands of employees and contractors since 2020, some of whom have included content moderators.\n\nThe shrinking of such teams, which many blame on political pressure, “sets the stage for things to be worse in 2024 than in 2020,” said Kate Starbird, a misinformation expert at the University of Washington.\n\nMeta explains on its website that it has some 40,000 people devoted to safety and security and that it maintains “the largest independent fact-checking network of any platform.” It also frequently takes down networks of fake social media accounts that aim to sow discord and distrust.\n\n“No tech company does more or invests more to protect elections online than Meta – not just during election periods but at all times,” the posting says.\n\nIvy Choi, a YouTube spokesperson, said the platform is “heavily invested” in connecting people to high-quality content on YouTube, including for elections. She pointed to the platform’s recommendation and information panels, which provide users with reliable election news, and said the platform removes content that misleads voters on how to vote or encourages interference in the democratic process.\n\nThe rise of TikTok and other, less regulated platforms such as Telegram, Truth Social and Gab, also has created more information silos online where baseless claims can spread. Some apps that are particularly popular among communities of color and immigrants, such as WhatsApp and WeChat, rely on private chats, making it hard for outside groups to see the misinformation that may spread.\n\n“I’m worried that in 2024, we’re going to see similar recycled, ingrained false narratives but more sophisticated tactics,” said Roberta Braga, founder and executive director of the Digital Democracy Institute of the Americas. “But on the positive side, I am hopeful there is more social resilience to those things.”\n\nTrump’s front-runner status in the Republican presidential primary is top of mind for misinformation researchers who worry that it will exacerbate election misinformation and potentially lead to election vigilantism or violence.\n\nThe former president still falsely claims to have won the 2020 election.\n\n“Donald Trump has clearly embraced and fanned the flames of false claims about election fraud in the past,” Starbird said. “We can expect that he may continue to use that to motivate his base.”\n\nWithout evidence, Trump has already primed his supporters to expect fraud in the 2024 election, urging them to intervene to “ guard the vote ” to prevent vote rigging in diverse Democratic cities. Trump has a long history of suggesting elections are rigged if he doesn’t win and did so before voting in 2016 and 2020.\n\nThat continued wearing away of voter trust in democracy can lead to violence, said Bret Schafer, a senior fellow at the nonpartisan Alliance for Securing Democracy, which tracks misinformation.\n\n“If people don’t ultimately trust information related to an election, democracy just stops working,” he said. “If a misinformation or disinformation campaign is effective enough that a large enough percentage of the American population does not believe that the results reflect what actually happened, then Jan. 6 will probably look like a warm-up act.”\n\nElection officials have spent the years since 2020 preparing for the expected resurgence of election denial narratives. They’ve dispatched teams to explain voting processes, hired outside groups to monitor misinformation as it emerges and beefed up physical protections at vote-counting centers.\n\nIn Colorado, Secretary of State Jena Griswold said informative paid social media and TV campaigns that humanize election workers have helped inoculate voters against misinformation.\n\n“This is an uphill battle, but we have to be proactive,” she said. “Misinformation is one of the biggest threats to American democracy we see today.”\n\nMinnesota Secretary of State Steve Simon’s office is spearheading #TrustedInfo2024, a new online public education effort by the National Association of Secretaries of State to promote election officials as a trusted source of election information in 2024.\n\nHis office also is planning meetings with county and city election officials and will update a “Fact and Fiction” information page on its website as false claims emerge. A new law in Minnesota will protect election workers from threats and harassment, bar people from knowingly distributing misinformation ahead of elections and criminalize people who non-consensually share deepfake images to hurt a political candidate or influence an election.\n\n“We hope for the best but plan for the worst through these layers of protections,” Simon said.\n\nIn a rural Wisconsin county north of Green Bay, Oconto County Clerk Kim Pytleski has traveled the region giving talks and presentations to small groups about voting and elections to boost voters’ trust. The county also offers equipment tests in public so residents can observe the process.\n\n“Being able to talk directly with your elections officials makes all the difference,” she said. “Being able to see that there are real people behind these processes who are committed to their jobs and want to do good work helps people understand we are here to serve them.”\n\nFernando reported from Chicago. Associated Press writer Christina A. Cassidy in Atlanta contributed to this report.\n\nThe Associated Press receives support from several private foundations to enhance its explanatory coverage of elections and democracy. See more about AP’s democracy initiative here. The AP is solely responsible for all content.",
        "source": "Associated Press (AP)",
        "date": null,
        "category": "US News"
    },
    "Associated Press (AP)-4": {
        "url": "https://apnews.com/article/trump-insurrection-colorado-justices-threat-3f05d134f8cfa14368107fa9dff97117",
        "title": "Police investigating incidents involving Colorado justices after Trump removed from state’s ballot",
        "image_url": "https://dims.apnews.com/dims4/default/c2969af/2147483647/strip/true/crop/3000x1997+0+2/resize/320x213!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F19%2Fc9%2Fef555d105db675bf100f3007f07c%2Fc1d5a7d98c3346338223696165d6f84b",
        "body": "DENVER (AP) — Police said Tuesday they are investigating incidents directed at Colorado Supreme Court justices and providing extra patrols around their homes in Denver following the court’s decision to remove former President Donald Trump from the state’s presidential primary ballot.\n\nThe Denver Police Department declined in an email to provide details about its investigations, citing safety and privacy considerations and because they are ongoing.\n\nThe department “is currently investigating incidents directed at Colorado Supreme Court justices and will continue working with our local, state and federal law enforcement partners to thoroughly investigate any reports of threats or harassment,” the email said.\n\nOfficers responded to the home of one justice on Thursday evening, but police said it appeared to be a “hoax report.” That case is also still being investigated police said.\n\nThe FBI said it is working with local law enforcement on the matter. \n\n\n\n\n“We will vigorously pursue investigations of any threat or use of violence committed by someone who uses extremist views to justify their actions regardless of motivation,” a spokesperson for the Denver’s FBI office, Vikki Migoya, said in a statement. \n\nIn a 4-3 decision last week, Colorado’s highest court overturned a ruling from a district court judge who found that Trump incited an insurrection for his role in the Jan. 6, 2021, attack on the Capitol, but had said he could not be barred from the ballot because it was unclear that U.S. Constitution’s insurrection clause was intended to cover the presidency.\n\nThe state’s highest court didn’t agree, siding with attorneys for six Colorado Republican and unaffiliated voters who argued that it was nonsensical to imagine that the framers of the amendment, fearful of former confederates returning to power, would bar them from low-level offices but not the highest one in the land.\n\nThe court stayed its decision until Jan. 4, or until the U.S. Supreme Court rules on the case. Colorado officials say the issue must be settled by Jan. 5, the deadline for the state to print its presidential primary ballots.",
        "source": "Associated Press (AP)",
        "date": null,
        "category": "US News"
    },
    "Associated Press (AP)-5": {
        "url": "https://apnews.com/article/north-dakota-legislature-abortion-59168cd920ed8e98f0ac9f20e3ca1b93",
        "title": "North Dakota judge to decide whether to temporarily block part of abortion law that limits doctors",
        "image_url": "https://dims.apnews.com/dims4/default/212f469/2147483647/strip/true/crop/3223x2145+93+0/resize/320x213!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7c%2F51%2F8e07816ae2ed11366d203dcf8390%2Fe740bb376d3e4d68bca477c1decdf8dd",
        "body": "BISMARCK, N.D. (AP) — A North Dakota judge said Wednesday he will decide soon whether to temporarily block a part of the state’s revised abortion laws so doctors can perform the procedure to save a patient’s life or health.\n\nThe request for a preliminary injunction asks state District Court Judge Bruce Romanick to bar the state from enforcing the law against physicians who use their “good-faith medical judgment” to perform an abortion because of pregnancy complications that could pose “a risk of infection, hemorrhage, high blood pressure, or which otherwise makes continuing a pregnancy unsafe.”\n\nNorth Dakota outlaws all abortions, except in cases where women could face death or a “serious health risk.” People who perform abortions could be charged with a felony under the law, but patients would not.\n\nPhysicians, to mitigate risk of prosecution, “feel like they must delay offering abortions to their patients until the patients’ health has declined to the point where other physicians could not plausibly disagree that it was necessary to provide an abortion,” Center for Reproductive Rights attorney Meetra Mehdizadeh said.\n\n“Patients and physicians have experienced significant harm,” she said. “For patients, the denial of their constitutional rights and forced additional health risks; and for physicians, the harm of having the threat of criminal prosecution hanging over their head every time they treat a patient with a medical complication.”\n\n\n\n\nThe state’s revised abortion laws also provide an exception for pregnancies caused by rape and incest, but only in the first six weeks, before many women know they are pregnant. It also allows for treatment of ectopic and molar pregnancies, which are nonviable situations.\n\nSpecial Assistant Attorney General Dan Gaustad cited the plaintiffs’ “seven-month delay” in seeking a preliminary injunction, and he disputed the “good-faith medical judgment” language. He told the judge the plaintiffs are asking him “to modify and rewrite the statute under the guise of a preliminary injunction.” The law uses ”reasonable medical judgment.”\n\nThe Red River Women’s Clinic sued the state last year after the U.S. Supreme Court’s Dobbs decision, which overturned the court’s landmark 1973 Roe v. Wade ruling establishing a nationwide right to abortion. The lawsuit targeted the state’s since-repealed trigger ban — a ban designed to go into effect immediately if the court overturned Roe v. Wade — as unconstitutional. The clinic moved from Fargo to neighboring Moorhead, Minnesota, where abortion is legal.\n\nThe judge granted a preliminary injunction blocking the ban from taking effect last year, which the state Supreme Court upheld in March.\n\nChief Justice Jon Jensen wrote in the court’s March decision that “it is clear the citizens of North Dakota have a right to enjoy and defend life and a right to pursue and obtain safety, which necessarily includes a pregnant woman has a fundamental right to obtain an abortion to preserve her life or her health.”\n\nSoon afterward, North Dakota’s Republican-controlled Legislature passed a bill revising the state’s abortion laws, which Gov. Doug Burgum signed into effect in April.\n\nIn June, the clinic filed an amended complaint, joined by several doctors in obstetrics, gynecology and maternal-fetal medicine. A jury trial is scheduled for August 2024.",
        "source": "Associated Press (AP)",
        "date": null,
        "category": "US News"
    },
    "Associated Press (AP)-6": {
        "url": "https://apnews.com/article/abortion-wisconsin-ban-appeal-00e04a5e90931891afd2e0adcd0bcbca",
        "title": "Wisconsin prosecutor appeals ruling that cleared way for abortions to resume in state",
        "image_url": "https://dims.apnews.com/dims4/default/61fe944/2147483647/strip/true/crop/5714x3803+0+2/resize/320x213!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2F14%2F4eaa4c3566bd84276ebba9cdee2a%2F90de4a7c004c4ea1859f6aba5de10e52",
        "body": "MADISON, Wis. (AP) — A Republican district attorney has appealed a court ruling that determined that an 1849 Wisconsin law does not ban abortions, a decision that cleared the way for abortions to resume in the state.\n\nSheboygan County District Attorney Joel Urmanski on Tuesday appealed the ruling from a Dane County judge that said there is no state ban on abortions. The appeal was expected and the case is likely to ultimately be decided by the Wisconsin Supreme Court.\n\nUrmanski asked that the appeal be heard in the state’s Waukesha-based 2nd District Court of Appeals, where three of the four judges are conservative. Appeals are heard by three-judge panels.\n\nAny appeal of a ruling there would go to the state Supreme Court, where liberals hold a 4-3 majority. The most recently elected liberal justice, Janet Protasiewicz, campaigned as a supporter of abortion rights.\n\nThe U.S. Supreme Court’s June 2022 decision to overturn Roe v. Wade, the landmark 1973 decision legalizing abortion, led to Planned Parenthood stopping abortions in Wisconsin. The group cited the state’s 1849 law, which was widely viewed as banning the procedure.\n\n\n\n\nDemocratic Attorney General Josh Kaul sued to overturn the ban, naming Urmanski in Sheboygan County and prosecutors in Dane and Milwaukee counties as defendants. Those are the counties where Planned Parenthood had clinics that offered abortions.\n\nDane County Circuit Judge Dianne Schlipper ruled in July that the 1849 ban doesn’t use the term “abortion” and that the law therefore only prohibits attacking a woman in an attempt to kill her unborn child. She issued her final order earlier this month, which opened the door for the appeal.\n\nPlanned Parenthood reopened clinics in Madison and Milwaukee that perform abortions soon after the July ruling. A third clinic in Sheboygan is scheduled to reopen next week.\n\nDistrict attorneys in all three counties where the clinics are located, including Urmanski, have said they will abide by the judge’s ruling while the case plays out.\n\nMarquette University Law School polls conducted since the Supreme Court overturned Roe v. Wade have shown that a majority of Wisconsin residents opposed that ruling and support legalized abortion.",
        "source": "Associated Press (AP)",
        "date": null,
        "category": "US News"
    },
    "Associated Press (AP)-7": {
        "url": "https://apnews.com/article/catholic-bishops-abortion-rights-ballot-measures-25da70c3dc0912df649744e2482414fc",
        "title": "US Catholic leadership foresees challenges after repeated election defeats for abortion opponents",
        "image_url": null,
        "body": "Repeatedly in recent years, the U.S. Conference of Catholic Bishops has stipulated that “the threat of abortion remains our preeminent priority.” In the face of recent election setbacks for abortion opponents, leading bishops and their lay allies are reassessing how to move forward with that stance.\n\nThe latest rebuff came Nov. 7 in Ohio, when voters decisively approved a constitutional amendment that ensures access to abortion and other forms of reproductive health care. It was the seventh consecutive state where voters decided to protect abortion access since the U.S. Supreme Court overturned the nationwide constitutional right to abortion in June 2022.\n\nThe Ohio result was particularly stinging for abortion opponents, coming in a state where tough anti-abortion measures had been approved by the Republican-controlled legislature.\n\n“Today is a tragic day for women, children, and families in Ohio,” the state’s Catholic bishops said in a joint statement as the outcome became clear.\n\n“We must look ahead,” the bishops added. “Despite the obstacles this amendment presents, the Catholic Church in Ohio will continue to work for policies that defend the most vulnerable, strengthen the child-parent relationship, and support women in need.”\n\n\n\n\nBrian Hickey, executive director of the Catholic Conference of Ohio, noted that support for the abortion-rights amendment was particularly strong among younger voters, signaling that it could take many years to build an anti-abortion majority in the state’s electorate. Exit polls suggested that more than 75% of voters aged 18 to 29 backed the amendment.\n\n“How do we reach this next generation of Ohioans?” Hickey asked during an interview with The Associated Press. “We know there is a lot of work to do.”\n\nThe chairman of the U.S. bishops’ Committee on Pro-life Activities, Bishop Michael Burbidge of Arlington, Virginia, recalled how he and his colleagues celebrated 18 months ago after the Supreme Court — in its so-called Dobbs decision — struck down the much-debated Roe v. Wade ruling of 1973. The result was to end the nationwide right to abortion, and leave it to individual states to decide whether to ban it or allow it.\n\n“There was a moment to celebrate, but we also knew it was only a brief moment, because rightfully this issue is back in the states,” Burbidge said. “These ballot-measure results are very unsettling.”\n\nBurbidge said the Catholic leadership needed to convey more clearly that it is “pro-women” -- even as it supports state legislation aimed at limiting their options regarding unwanted pregnancies.\n\n“Not even our parishioners are aware of all of the support the Catholic Church will give to single moms in need — counseling, financial assistance, housing — so mothers know they are being accompanied,” he told the AP. “We will be with them every step of the way.”\n\n“We look at the results, and they are not favorable,” Burbidge added. “We have a good message to convey. ... Even if it hits some more bumps in the road, some disappointments, eventually we believe that what is true, what is just, will triumph.”\n\n2024 will bring many opportunities for disappointments and triumphs. Abortion is sure to be a key issue in many political contests, and efforts are underway in several states — including Arizona, Arkansas, Florida, Missouri and Nebraska — to get Ohio-style abortion-rights measures on the ballot.\n\nBurbidge and Hickey said the Catholic leadership, as it moved ahead in the abortion debate, should avoid sounding harsh and punitive. Hickey, for example, suggested that abortion restrictions would receive greater public support if they offered exceptions, perhaps allowing abortions for women impregnated by rape.\n\n“We need to have those conversations,” Hickey said. “The Catholic Church is a place for refuge. It’s not a place for condemnation.”\n\nSome Catholic abortion opponents favor an aggressive approach, whether or not it sways voter sentiment.\n\n“The church will never compromise, it cannot compromise. It will always stand for the truth that every single human life is sacred,” said Brian Burch, president of the conservative advocacy group CatholicVote.\n\n“But it’s very clear the public is completely divided on this,” he added. “Recent trends show the public is not willing to go where many pro-life entities had hoped to go in the wake of Dobbs.”\n\nBurch said state legislatures with anti-abortion majorities should avoid punishing women who get abortions. But he approves of penalties against medical personnel who provide abortions, and favors new laws that could punish people for pressuring a woman to get an abortion.\n\n“The abortion divide has become more heightened because of Dobbs,” he said. “There is no question the Democrats will use the issue next year. It’s a political gamble and I hope they’re wrong.”\n\nFrank Pavone, national director of Priests for Life, hopes the Democrats do highlight the issue – and says abortion opponents should engage head-on in the ensuing debate, rather than skirting the issue.\n\n“We need an honest debate about abortion — a debate that starts with a clear, objective and public description of what the abortion procedure is,” Pavone says in a strategy memo he’s distributing to political candidates. “Abortion supporters refuse to describe what they defend ... abortion itself is the last thing they want to talk about.”\n\nPavone was a Catholic priest from 1988 until 2022, when the Vatican removed him from the priesthood for “blasphemous communications” on social media, and persistent disobedience of his bishop. Over many years, he had drawn attention for partisan political activities that accompanied his anti-abortion activism.\n\nIn common with Burbidge, Hickey and Burch, Pavone advocates showing compassion for women considering abortion.\n\nBut Catholics who support abortion rights question how this rhetoric can be reconciled with a stance that would deny these women the freedom to choose for themselves how to proceed.\n\n“Solidarity with women — what does that mean?” asked Jamie Manson, president of Catholics for Choice.\n\n“Women do not have equality in the church. We’re not allowed to lead, to be ordained,” she said. “I don’t know what ‘solidarity’ means when you have an entrenched second-class status for women.”\n\nManson would like to see a new kind of conversation within Catholic ranks.\n\n“Many Catholic women have had an abortion — they have a story to tell,” she said. “What I’m hoping and pushing for is for Catholic leaders to listen to why women made that choice and have no regrets.”\n\nFor now, the U.S. bishops conference has signaled it will press ahead with existing strategies on abortion. Last month, a week after the abortion-rights amendment was approved in Ohio, the bishops elected Daniel Thomas, the bishop of Toledo, Ohio, to succeed Burbidge in November 2024 as chairman of the Committee on Pro-Life Activities. \n\nThomas had forcefully appealed for Ohioans to defeat the amendment, calling it “extreme, dangerous and unacceptable.”\n\nManson depicted the election of Thomas as “ironic,” given that Catholic dioceses in Ohio had spent hundreds of thousands of dollars unsuccessfully opposing the amendment.\n\n“The Catholic bishops are doubling down on their losing abortion strategy through 2024,” she said. “The Catholic Church will continue to spend big in elections — and they will continue to lose.” \n\nAssociated Press religion coverage receives support through the AP’s collaboration with The Conversation US, with funding from Lilly Endowment Inc. The AP is solely responsible for this content.",
        "source": "Associated Press (AP)",
        "date": null,
        "category": "US News"
    },
    "Associated Press (AP)-8": {
        "url": "https://apnews.com/article/blood-donation-donors-gay-bisexual-men-guidelines-f32446a736ae6034cd145054e2cc186e",
        "title": "For years, he couldn’t donate at the blood center where he worked. Under new FDA rules, now he can",
        "image_url": null,
        "body": "VANCOUVER, Wash. (AP) — Over the last six years, blood center employee Dylan Smith was often asked how frequently he gave blood himself. His answer was always the same: As a gay man, he couldn’t.\n\nThat changed this month.\n\nThanks to new federal guidelines finalized in May, gay and bisexual men in monogamous relationships can now donate at many blood centers around the country without abstaining from sex. \n\nBloodworks Northwest, where Smith works as a donor services supervisor, adopted the change on Dec. 6. He and his partner gave blood for the first time the next day. \n\n“It’s been really emotionally difficult just to explain every single time the reason why,” said Smith, 28. “To be able to finally step up and support the mission that I really have just believed in since I started here just makes my heart feel so happy.”\n\n\n\n\nThe new U.S. Food and Drug Administration guidelines are the latest step in a yearslong effort to reverse restrictions that were designed to protect the blood supply from HIV, but which were increasingly criticized as discriminatory following scientific advances that allowed better detection of the virus.\n\nIn 2015, the FDA dropped the lifetime ban on donations from men who have sex with men and replaced it with a one-year abstinence requirement. The agency shortened the abstinence period to three months in 2020 after donations plummeted during the COVID-19 pandemic.\n\nAP correspondent Donna Warder reports.\n\nThe American Red Cross, which accounts for about 40% of blood and blood component donations in the U.S., began implementing the new guidance in August. \n\nAbout half of the 16 independent blood bank organizations that are members of the Alliance for Community Transfusion Services have rolled out the new guidelines, with more expected next year, the organization said.\n\n“It is going to take time,” said Benjamin Prijatel, president of Shepeard Community Blood Center in Augusta, Georgia. “Blood centers and health professionals are going to have to put forth the effort to engage and educate this community in order to overcome years of distrust. That’s the only way this rule change will translate into additional donations.”\n\nThe change puts the emphasis on sexual activity rather than on sexual orientation. All potential donors are screened with a new questionnaire evaluating their HIV risk based on sexual behavior, partners and other factors that can contribute to the spread of blood-borne infections, such as intravenous drug use or recent tattoos or piercings. \n\nPotential donors who report having anal sex with new partners in the last three months are barred from giving until a later date, and anyone who has ever tested positive for HIV will continue to be ineligible. Those taking pills to prevent HIV through sexual contact are still barred until three months after their last dose; the medications, known as PrEP, can delay the detection of the virus, the FDA said.\n\nDonated blood is then tested for HIV, hepatitis C, syphilis and other infectious diseases.\n\nBloodworks Northwest, which supplies blood to more than 90 hospitals in the region, isn’t keeping track of how many newly eligible donors are coming in, said Dr. Kirsten Alcorn, the nonprofit’s co-chief medical officer. But workers have heard plenty of stories from people excited to give.\n\n“It feels very meaningful to many of them to now be able to contribute to somebody’s survival,” Alcorn said.\n\nBloodworks executive Aaron Posey, whose own life was saved by a transfusion when he fell down a set of stairs and broken glass sliced an artery, welcomed the new guidance. He said hospitals and patients need access to a new pool of donors.\n\n“Having always witnessed a shortage in the blood supply, it has at times been very frustrating,” said Posey, who first donated blood during the pandemic when the abstinence period was cut to three months.\n\nSmith learned of the restrictions on gay men giving blood when he was screened while trying to donate his freshman year of college in 2013. The rules blindsided him, he said. It was a long time to wait before he could finally donate with his partner and other friends.\n\n“Just being able to see them donating next to me, smiling next to me ... meant so much,” Smith said.",
        "source": "Associated Press (AP)",
        "date": null,
        "category": "US News"
    },
    "Associated Press (AP)-9": {
        "url": "https://apnews.com/article/florida-desantis-transgender-law-trial-61639592d4c5e8512af3d3b078e40862",
        "title": "DeSantis spread false information while pushing trans health care ban and restrictions, a judge says",
        "image_url": "https://dims.apnews.com/dims4/default/1fd61f3/2147483647/strip/true/crop/5568x3706+0+3/resize/320x213!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F05%2Fd3%2F476ff1fb84400096a6896d7e5d89%2Ffb2a632d15884a2ea5ae626b5b4a5870",
        "body": "TALLAHASSEE, Fla. (AP) — A federal judge hearing a challenge to a transgender health care ban for minors and restrictions for adults noted Thursday that Republican Florida Gov. Ron DeSantis repeatedly spread false information about doctors mutilating children’s genitals even though there’s been no such documented cases.\n\nThe law was sold as defending children from mutilation when it is actually about preventing trans children from getting health care, Judge Robert Hinkle said to Mohammad Jazil, a lawyer for the state.\n\n“When I’m analyzing the governor’s motivation, what should I make of these statements?” Hinkle asked. “This seems to be more than just hyperbole.”\n\nHinkle said he will rule sometime in the new year on whether the Legislature, the Department of Health and presidential candidate DeSantis deliberately targeted transgender people through the new law. He raised some skepticism about the state’s motivation as lawyers gave their closing arguments.\n\nThe trial is challenging Florida’s ban on medical treatment for transgender children, such as hormone therapy or puberty blockers, a law DeSantis touted while seeking the presidency. The law also places restrictions on adult trans care.\n\n\n\n\nJazil said the motivation behind the law was simply public safety in an area that needs more oversight and can have permanent consequences.\n\n“It’s about treating a medical condition; it’s not about targeting transgender individuals,” Jazil said.\n\nJazil added that if the state was targeting transgender people, it could have banned all treatment for adults and children. Hinkle quickly replied that Jazil would have trouble defending such a law.\n\nHinkle, who was appointed by former President Bill Clinton, has temporarily blocked enforcement of the law as it pertains to minors, pending the outcome of the trial. The lawsuit also challenges restrictions placed on adult trans care, which have been allowed to take effect during the trial.\n\nAt least 22 states have now enacted laws restricting or banning gender-affirming medical care for transgender minors, and many of those states face lawsuits. Courts have issued mixed rulings, with the nation’s first law, in Arkansas, struck down by a federal judge who said the ban on care violated the due process rights of transgender youth and their families. \n\nEnforcement is blocked in two states besides Florida, and enforcement is currently allowed in or set to go into effect soon in seven other states.\n\nThomas Redburn, a lawyer representing trans adults and the families of trans children, said DeSantis and the Legislature have shown a pattern of targeting transgender people. He listed other recent laws that affect the community, including restrictions on pronoun use in schools, the teaching of gender identification in schools, restrictions on public bathrooms and the prohibition of trans girls from playing girls sports.",
        "source": "Associated Press (AP)",
        "date": null,
        "category": "US News"
    },
    "Associated Press (AP)-10": {
        "url": "https://apnews.com/article/greece-lgbtq-marriage-orthodox-church-d13cd46d593fad0d7becedee0b0df340",
        "title": "Greek government says it stands by same-sex marriage pledge even after opposition from the Church",
        "image_url": "https://dims.apnews.com/dims4/default/7ed111e/2147483647/strip/true/crop/3599x2396+0+48/resize/320x213!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe9%2F0d%2Fb013c11328b336c0edfe3db6fdc5%2Fc39d5ee171d84e80a1aa00d07e35f0b6",
        "body": "ATHENS, Greece (AP) — Greece’s center-right government said Thursday it would fulfill a commitment to legalize same-sex marriage, sidestepping staunch opposition from the country’s influential Orthodox Church.\n\nThe legislation would be brought to parliament during the house’s current term, which ends in 2027, said government spokesman Pavlos Marinakis.\n\nThe statement comes after the Church’s governing Holy Synod issued a 1,500-word opinion late Wednesday, expressing strong opposition to the proposal. The Church’s main argument centered around the issue of raising children, claiming they are being treated as “accessories” and “companion pets” for gay couples.\n\n“We always listen to the opinions of the Church with respect,” Marinakis said. “But at the same time, we are implementing our policy, and will listen to the views of society, civil society, the citizenry, institutions, and parties in total.”\n\nThe Church argues that extending marriage rights would create a legal obligation to eventually follow up with parental rights under international rights obligations that Greece has signed up to. \n\n\n\n\n“The position of the Church of Greece remains that children have an innate need and therefore a right to grow up with a male father and a female mother. No amount of social modernization and no amount of political correctness can bypass (this),” the Church circular said.\n\n“Children are not companion pets for those who wish to feel like a guardian, and are not ‘accessories’ to formalize or make same-sex cohabitation socially acceptable,” it added. \n\nThe comment drew widespread attention in the Greek news media.\n\nOpinion polls suggest Greeks are evenly divided on the issue of same-sex marriage, but opposed to extending full parental rights to gay couples.\n\nSame-sex marriage is legal in 34 countries globally, according to the Human Rights Campaign Foundation, a U.S. association created to monitor discrimination against LGBTQ+ people. None of the countries on that list are majority Orthodox Christian like Greece, although several have legalized civil partnerships in recent years. \n\nProminent members of Greece’s governing conservatives have publicly expressed support as well as opposition to the government’s commitment while left-wing and center-left opposition parties are generally supportive. \n\nThe country’s left-wing opposition leader, Stefanos Kasselakis, married his male partner in New York in October, several weeks after winning a party leadership election.\n\nGreece legalized same-sex civil partnerships in 2015.",
        "source": "Associated Press (AP)",
        "date": null,
        "category": "US News"
    },
    "Associated Press (AP)-11": {
        "url": "https://apnews.com/article/florida-mall-shooting-e382916989321e3d806c065d3129c203",
        "title": "A man is killed and a woman injured in a ‘targeted’ afternoon shooting at a Florida shopping mall",
        "image_url": null,
        "body": "OCALA, Fla. (AP) — Authorities in central Florida issued an arrest warrant Sunday for a 39-year-old man accused of fatally shooting another man at a shopping mall two days before Christmas in which police say the victim was “targeted.”\n\nAs of Sunday afternoon, the suspect hadn’t been located, and the Ocala Police Department was offering a $5,000 award for any information leading to his arrest. The arrest warrant was for premeditated first-degree murder and attempted premeditated first-degree murder, the police department said on social media.\n\nOcala Police Chief Mike Balken told reporters Saturday evening that the victim was killed after he was shot multiple times in a common area at Paddock Mall in Ocala, located about 80 miles (127 kilometers) northwest of Orlando. \n\nA woman also was shot in the leg. She was treated at a local hospital and expected to recover, Balken said.\n\nThe suspect fled the scene and left behind the firearm, Balken said.\n\n\n\n\nOcala police posted photos overnight of a person of interest that appear to be taken from a mall security camera. The three images show a male with a red cap and dark clothing. Balken previously said the suspect wore a hooded sweatshirt and a mask partially covering his face. \n\nOn Sunday, the police department urged a person who took the suspect’s hat from the crime scene to turn it over to investigators or they would be charged with tampering with evidence.\n\n“That hat may contain valuable DNA evidence, and we need it back,” the Ocala Police Department said on social media. “We urge you to do the right thing and come forward immediately. Time is of the essence.” \n\nPolice arrived at the mall around 3:40 p.m. Saturday after a call of multiple shots being fired at the mall. \n\n“Officers immediately made entry into the mall (and) ultimately discovered that this was not what we would consider an active shooter,” Balken told reporters.\n\nThe attack was likely a “targeted act of violence” against the man, Balken said. \n\nSeveral other mall patrons suffered injuries during the shooting, with one person having chest pain and another reporting a broken arm, police said. \n\nPolice have asked the public for assistance by submitting mobile phone video of the shooting scene. \n\nThe mall’s corporate owner, WPG, said in a statement that they were working with the Ocala Police Department in the investigation of what happened. The mall was closed Sunday, the day before Christmas.\n\n“We are deeply saddened by this tragedy. Our thoughts are with all those involved,” the statement said. “The safety of our guests, retailers and employees is our top priority.”\n\nThe mall has dozens of stores, including J.C. Penney and Foot Locker.\n\nCalvin and Diana Amos, who were shopping in the J.C. Penney store, told the Ocala Star-Banner that they evacuated the store quickly once they figured out what was going on. They described themselves as scared and apprehensive.",
        "source": "Associated Press (AP)",
        "date": null,
        "category": "US News"
    },
    "Associated Press (AP)-12": {
        "url": "https://apnews.com/article/czech-mass-shooting-university-day-of-mourning-17c72a996a64b10215c99e9a6f3afab2",
        "title": "Czech Republic marks a day of mourning for the victims of its worst mass killing",
        "image_url": null,
        "body": "PRAGUE (AP) — The Czech Republic came to a standstill at noon Saturday as people across the country observed a minute of silence for the victims of its worst mass killing  that left 14 dead and questions about the shooter’s motive.\n\nNational flags on public buildings flew at half-staff and bells tolled at noon. President Petr Pavel and speakers of both houses of Parliament attended a Mass for the victims at St. Vitus Cathedral in Prague, the country’s biggest, which was packed. \n\n“We’re all still in a shock in our own ways,” Prague Archbishop Jan Graubner said. “We need to clearly condemn what happened but we also need to look into the future.”\n\n“Nobody should be left alone in these tough moments,” Charles University rector Milena Kralickova said in her remarks toward the end of the Mass. The shooting occurred inside the university’s Faculty of Arts on Thursday. Twenty-five other people were wounded before the gunman killed himself. \n\nPolice and prosecutors said they have evidence the 24-year-old shooter also killed his father earlier in the day and a man and a baby in Prague last week.\n\n\n\n\nSimilar religious services were held in other cities and towns, while Christmas markets in a number of places were closed or reduced their programs amid boosted security measures.\n\nA sea of candles was shining at an impromptu memorial for the victims in front of the university headquarters.\n\n“It’s been a horrible experience for us all but it still can’t be compared with what the victims had to experience at the time of the attack and what their dear ones have to experience now,” said Milos Vystrcil, speaker of the Senate who came to light a candle.\n\n“I think that to help them at this point we express our support and that’s what we’re all doing now.”\n\nThe 14 fatalities are being slowly identified. The university confirmed two staff members were among them, including the head of the Institute of Music Sciences, Lenka Hlávková. First-year student Lucie Špindlerová also was killed, said the Lidove noviny daily, where she worked. \n\nAmong the other students were Aneta Richterová, according to her group of volunteer firefighters in the town of Helichovky; Klára Holcová, 20, a talented shot putter who won nine medals at national championships, the Czech athletics association said; and Magdalena Křístková, her hometown of Roztoky confirmed.\n\nThe shooter was Czech and a student at the Faculty of Arts. Investigators do not suspect a link to any extremist ideology or groups. Officials said they believed he acted alone but his motive is not yet clear.\n\nPreviously, the nation’s worst mass shooting was in 2015, when a gunman opened fire in the southeastern town of Uhersky Brod, killing eight before fatally shooting himself.",
        "source": "Associated Press (AP)",
        "date": null,
        "category": "US News"
    },
    "Associated Press (AP)-13": {
        "url": "https://apnews.com/article/lewiston-maine-mass-shootings-footage-96ecb7b9c02f84505592b55f779be617",
        "title": "Authorities knew Maine shooter was a threat but felt confronting him was unsafe, video shows",
        "image_url": null,
        "body": "PORTLAND, Maine (AP) — Police who declined to confront an Army reservist in the weeks before he killed 18 people in Maine’s deadliest mass shooting feared that doing so would “throw a stick of dynamite on a pool of gas,” according to video released Friday by law enforcement.\n\nThe video, which was released to the Portland Press Herald and then sent to The Associated Press, documents a Sept. 16 call between Sagadahoc County Sheriff’s Sgt. Aaron Skolfield and Army Reserve Capt. Jeremy Reamer. Skolfield was following up with Reamer about the potential threat posed by Robert Card, 40, who carried out the Oct. 25 attacks at a bowling alley and a restaurant. He was found dead two days later of a self-inflicted gunshot wound.\n\nMilitary officials alerted police in September that Card had been hospitalized in July after exhibiting erratic behavior while training, that he still had access to weapons and that he had threatened to “shoot up” an Army reserve center in Saco, a city in southern Maine. The sheriff’s department responded by briefly staking out the Saco facility and going to Card’s home in Bowdoin for what Reamer described as a “welfare check.” \n\n“The only thing I would ask is if you could just document it,” Reamer said. “Just say, ’He was there, he was uncooperative. But we confirmed that he was alive and breathing.’ And then we can go from there. That’s, from my end here, all we’re really looking for.”\n\nSkolfield mentioned Maine’s yellow flag law, which can be used to remove guns from potentially dangerous people, after Reamer said Card had refused medical treatment after his hospitalization.\n\n\n\n\n“So that, obviously, is a hurdle we have to deal with. But at the same time, we don’t want to throw a stick of dynamite on a pool of gas, either — make things worse,” he said.\n\nReamer expressed similar concerns. “I’m a cop myself,” he said. “Obviously, I don’t want you guys to get hurt or do anything that would put you guys in a compromising position.”\n\nAuburn City Councilor Leroy Walker Sr., whose son Joseph Walker was killed in the shootings, expressed frustration with police after seeing the video. Joseph Walker was the manager of Schemengees Bar & Grill, where part of the attack took place.\n\n“I would like to know what we train these people to do. Is it just to deliver mail? Or stop innocent people that may be driving 11 miles (per hour) over the speed limit?” Walker said in a text message, noting that watching the video made him “sick.”\n\nIn the video, Skolfield referred to the Cards as “a big family in this area,” and said he didn’t want to publicize that police were visiting the home. He told Reamer he would reach out to Card’s brother, Ryan, to ensure family members had taken Card’s guns, and a second video shows an officer at the father’s home. After Card’s father said he hadn’t spoken with Ryan in several days, the officer said he would try again later.\n\n“I just wanted to make sure Robert doesn’t do anything foolish at all,” he said.\n\nA report released last week by Sagadahoc Sheriff Joel Merry made clear that local law enforcement knew months before the attack that Card’s mental health was deteriorating. Police were aware of reports that he was paranoid, hearing voices, experiencing psychotic episodes and possibly dealing with schizophrenia.\n\nMerry and Lewiston city officials declined to comment on the release of the videos. \n\nBut Stephanie Sherman, an attorney who has represented several families of survivors of the 2022 mass shooting at an elementary school in Uvalde, Texas, said the videos show officers took a disturbingly casual approach to the threat Card posed. Police had more than enough information to take to a local judge, she said. \n\n“There was a history of problems within the Army, there was a history of institutionalization. The police knew that this person was having hallucinations,” Sherman said. “So there was a whole batch of problems that they quickly could have gotten an order to confiscate the guns, and even possibly put the person in custody. Not criminal custody, but some kind of psychiatric hold.” \n\nSherman said, however, that police tend to rely on immunity, which historically has shielded them from liability when they avoid taking an action such as placing a person in custody. \n\nA former New York Police Department detective sergeant who reviewed the videos for the AP said the events preceding the shooting illustrate the difficulty in applying Maine’s yellow flag law. Lax laws about removing weapons from dangerous people is a problem in numerous states, said Felipe Rodriguez, an adjunct professor at John Jay College of Criminal Justice in New York City.\n\n“The laws are just too convoluted and they are working against each other. That’s the biggest problem we have,” Rodriguez said.\n\nDan Flannery, the director of the Begun Center for Violence Prevention Research and Education at Case Western Reserve University, cautioned that only so much about a police investigation can be gleaned from a few minutes of video.\n\n“There is always context, there is the issue of what is the training and protocol within the division,” Flannery said. “Violent behavior is unfortunately one of the most difficult things to predict.”\n\nBut attorneys for shooting victims’ families said the footage supports a pattern of police ignoring clear warning signs about Card in the weeks prior to the shooting. One of the attorneys, Ben Gideon of Auburn, said “watching that footage, knowing what happened approximately six weeks later, is chilling and surreal.”\n\nThe attorneys said they are looking forward to an independent Army inspector general’s full accounting of the events leading up to the shootings. Some of the information they’ve gathered so far, including the video released Friday, is “highly concerning,” said Travis Brennan, another attorney for the families.\n\n“It’s one example of many of system failures. There is no question here that this is an individual who had overt warning signs,” Brennan said.\n\nThe last patient of 13 who were admitted to Central Maine Medical Center after the shooting has been released, hospital representatives said Friday.\n\nIn addition to the inspector general’s investigation, Gov. Janet Mills appointed an an independent commission led by a former state chief justice to review all aspects of the tragedy. \n\nThe actions of authorities ahead of and during mass shootings have come under increasing scrutiny. Last year, the Air Force was ordered to pay more than $230 million  in damages to survivors and victims’ families for failing to flag a conviction that might have kept the gunman in a 2017 church shooting in Texas from legally buying the weapon he used in the attack. \n\nAfter a gunman fatally shot 19 children and two teachers at the school in Uvalde last year, state lawmakers issued a scathing report faulting law enforcement at every level with failing “to prioritize saving innocent lives over their own safety.” Several officers lost their jobs over the halting and haphazard response, and a state prosecutor is still considering whether to bring criminal charges. ___\n\nRamer reported from Concord, New Hampshire. Associated Press writers Lindsay Whitehurst in Washington, Nick Perry in Meredith, New Hampshire, and Jake Bleiberg in Dallas contributed.\n\nThe name of the county has been corrected to Sagadahoc, instead of Sagadoc.",
        "source": "Associated Press (AP)",
        "date": null,
        "category": "US News"
    },
    "Associated Press (AP)-14": {
        "url": "https://apnews.com/their-lives-were-torn-apart-by-war-in-africa-a-family-hopes-a-new-us-program-will-help-them-reunite-0000018ca491d236a38dfedb562d0000",
        "title": "Their lives were torn apart by war in Africa. A family hopes a new US program will help them reunite",
        "image_url": "https://dims.apnews.com/dims4/default/bf2afd0/2147483647/strip/true/crop/3600x2396+0+2/resize/320x213!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F9d%2F175026154665ad8726c2823366df%2Fap23349767502447.jpg",
        "body": "Worried about his mother’s health, Jacob Mabil tried for months to persuade her to let him start the process that would take her from a sprawling refugee camp where she had spent almost a decade after fleeing violence in South Sudan.\n\nHe wanted her to come live with him and his young family in the U.S. But before she would agree, she asked for a promise: that he would one day also bring the granddaughters she had raised since they were babies.\n\nMabil, now 44, said he would do everything he could. But it turned out that he was allowed to petition only for immediate family members. Though his mom joined him in suburban Fort Worth, Texas, in 2020, his nieces remained in Africa.\n\n“That always killed me,” said Mabil, whose own childhood was ripped apart by civil war in Sudan.\n\nAs the U.S. government transforms the way refugees are being resettled, Mabil and his family now have hope that they will be reunited with two of his nieces, who soon turn 18 and 19. The Biden administration opened the application process this month that lets Americans who have formed groups to privately sponsor refugees request the specific person they want to bring to the U.S.\n\n\n\n\nWhen he was just 8, Mabil was forced to run for his life as soldiers came into his village in what is now South Sudan, setting it on fire as they killed people. He became part of the group of children known as the “lost boys,” who spent years on their own and walked hundreds of miles to flee violence.\n\nMabil, who didn’t even know his mother was alive until shortly after he arrived in the U.S. in his early 20s, said he wants his sister’s daughters to have the same opportunities that he has had.\n\nTraditionally, resettlement agencies have placed refugees in communities, but the push to add private sponsorship as well has come as President Joe Biden works to restore a program that was decimated under former President Donald Trump. The launch at the start of 2023 of the State Department’s Welcome Corps program, which allows everyday Americans the chance to form their own groups to privately sponsor refugees, came after a similar endeavor that let U.S. citizens sponsor Afghans or Ukrainians.\n\n“In many ways it is, I think, one of the most important things that the U.S. resettlement program has ever done,” said Sasha Chanoff, founder and CEO of RefugePoint, a Boston-based nonprofit that helps refugees. “It will allow families who are in desperate need to reunite to do so.”\n\nWith the U.S. hoping to bring in 125,000 refugees this fiscal year, the use of private sponsors expands the capacity of the existing system, said Welcome Corps spokeswoman Monna Kashfi said. She added that the opportunity to apply to sponsor a specific refugee has been greatly anticipated.\n\n“We have heard all throughout the year from people who wanted to know ... when they could submit an application to sponsor someone that they know,” she said.\n\nMabil, his wife and his mother have already joined two family friends to form their own sponsor group to start the process to bring over his two nieces, who were placed in a boarding school when their grandmother left Kakuma refugee camp in Kenya for the U.S. One is set to graduate soon and the other has returned to the camp after graduating.\n\nChanoff said that unaccompanied girls are often “in extraordinary danger” at the camp and regularly kidnapped and sold into marriage.\n\nMabil’s wife, Akuot Leek, 33, is also from South Sudan and spent her childhood traveling from place to place with her family to try to escape violence. She wants the young women to have the same freedom that she had to choose what to do with their lives.\n\nLeek and Mabil began dating after meeting at a wedding in the U.S. and both are college graduates who now work in finance.\n\nMabil was one of about 20,000 youths who joined an odyssey that took them first to Ethiopia, where they spent about three years before a war there forced them to flee again. The survivors eventually made it to Kakuma, where Mabil spent almost a decade before coming to the U.S.\n\n“They had survived bullets and bombs and wild animal attacks and things that you and I can’t imagine to get to Kakuma camp,” said Chanoff, who met Mabil at the camp.\n\nLeek and Mabil say that once his nieces are settled in Texas, they may work to bring over other family members.\n\nMabil’s mother, Adeng Ajang, said living with her son and daughter-in-law and four grandchildren in their comfortable home has made her very happy. Now, the only stress she has in her life is worrying about her granddaughters.\n\n“It was difficult to leave them,” said Ajang as her daughter-in-law translated from the Dinka language. “It was hard.”\n\nAjang said talks to her granddaughters on the phone often. “Sometimes we talk and then we will start to cry,” she said.\n\nFor Mabil, he’s excited and nervous to start the process. “This is my last chance,” he said.\n\nVideo journalist Kendria LaFleur contributed to this report.",
        "source": "Associated Press (AP)",
        "date": null,
        "category": "US News"
    },
    "Associated Press (AP)-15": {
        "url": "https://apnews.com/article/mexico-migration-caravan-7f5d9b8f93f3b22fecf3f0285acd6a82",
        "title": "Migrant caravan in southern Mexico marks Christmas Day by trudging onward",
        "image_url": null,
        "body": "HUIXTLA, Mexico (AP) — Christmas Day meant the same as any other day for thousands of migrants walking through southern Mexico: more trudging under a hot sun. \n\nThere were no presents, and Christmas Eve dinner was a sandwich, a bottle of water and a banana handed out by a local church to some of the migrants in the town of Álvaro Obregón, in the southern state of Chiapas, which borders Guatemala.\n\nMigrants spent Christmas night sleeping on a scrap of cardboard or plastic stretched out under an awning or tent, or the bare ground. \n\nIn the morning, it was waking as usual at 4 a.m., to get an early start and avoid the worst of the heat, walking to the next town, Huixtla, 20 miles (30 kilometers) away.\n\nKarla Ramírez, a migrant from Honduras who was traveling with other adults and four children, got to Álvaro Obregón too late Sunday to get any of the food being given out by the church. So they had to buy whatever little they could afford.\n\n\n\n\n“It was sad: we have never, ever been in the street before,” Ramírez said. “Our Christmas dinner was some mortadella, butter and tomato, with a tortilla.”\n\nMariela Amaya’s seven-year-old son didn’t understand why they had to spend Christmas this way. Amaya, also from Honduras, tugged the hand of her tired, recalcitrant son as they walked.\n\n“They don’t understand why we have to do this to get a better life,” Amaya said. Nor did the governments of Mexico and the United States, she said. \n\n“Why can’t they help us? We need their help,” she said.\n\nWhat little help there was came from local families, one of whom gave out tamales — traditional seasonal fare — and water to the passing migrants.\n\nThe migrants included single adults but also entire families, all eager to reach the U.S. border, angry and frustrated at having to wait weeks or months in the nearby city of Tapachula for documents that might allow them to continue their journey.\n\nMexico claims it doesn’t give out transit visas, but migrants keep hoping to get some sort of document so they could at least take buses to the border.\n\n“This journey has been really hard for us migrants. We need the (Mexican) immigration office and the government to have some pity on us, and give us a safe conduct pass,” said Jessica García, a migrant from Venezuela.\n\nMexico says it detected 680,000 migrants moving through the country in the first 11 months of 2023.\n\nAt around 6,000 people, the migrant caravan that set out Sunday was the largest one since June 2022, when a similarly sized group departed Tapachula. \n\nAnd like the 2022 caravan — which started as U.S. President Joe Biden hosted leaders in Los Angeles for the Summit of the Americas — this year’s Christmas caravan came a few days before U.S. officials are to meet with their Mexican counterparts in Mexico City to explore ways of stemming the number of migrants showing up at the U.S. southwest border.\n\nThe Mexican government has already said it is willing to help try to block migrants from crossing Mexico; the government had little choice, afte r U.S. officials briefly closed two vital Texas railway border crossings, claiming they were overwhelmed by processing migrants.\n\nThat put a chokehold on freight moving from Mexico to the United States, as well as grain needed to feed Mexican livestock moving south. The rail crossings have since been reopened, but the message was clear.\n\nU.S. Secretary of State Antony Blinken is expected to arrive in Mexico City Wednesday to hammer out new agreements to control the surge of migrants seeking entry into the United States. The U.S. delegation will also include Homeland Security Secretary Alejandro Mayorkas and White House homeland security adviser Liz Sherwood-Randall.\n\nThis month, as many as 10,000 migrants were arrested per day at the U.S. southwest border. \n\nIn May, Mexico agreed to take in migrants from countries such as Venezuela, Nicaragua and Cuba who had been turned away by the U.S. for not following rules that provided new legal pathways to asylum and other forms of migration.\n\nBut that deal, aimed at curbing a post-pandemic jump in migration, appears to be insufficient as numbers rise once again, disrupting bilateral trade and stoking anti-migrant sentiment among conservative voters in the U.S.\n\nArrests for illegal crossing topped 2 million in each of the U.S. government’s last two fiscal years, reflecting technological changes that have made it easier for migrants to leave home to escape poverty, natural disasters, political repression and organized crime.\n\nFollow AP’s coverage of Latin America and the Caribbean at https://apnews.com/hub/latin-america",
        "source": "Associated Press (AP)",
        "date": null,
        "category": "US News"
    },
    "Associated Press (AP)-16": {
        "url": "https://apnews.com/article/mexico-us-caravan-migration-5d0846e553799a0f4d9155ccefba89e0",
        "title": "Thousands join migrant caravan in Mexico ahead of Secretary of State Blinken’s visit to the capital",
        "image_url": null,
        "body": "UPDATE: Migrant caravan in southern Mexico marks Christmas Day by trudging onward\n\nTAPACHULA, Mexico (AP) — A sprawling caravan of migrants from Central America, Venezuela, Cuba and other countries trekked through Mexico on Sunday, heading toward the U.S. border. The procession came just days before Secretary of State Antony Blinken arrives in Mexico City to hammer out new agreements to control the surge of migrants seeking entry into the United States.\n\nThe caravan, estimated at around 6,000 people, many of them families with young children, is the largest in more than a year, a clear indication that joint efforts by the Biden administration and President Andrés Manuel López Obrador’s government to deter migration are falling short. \n\nThe Christmas Eve caravan departed from the city of Tapachula, near the country’s southern border with Guatemala. Security forces looked on in what appeared to be a repeat of past tactics when authorities waited for the marchers to tire out and then offered them a form of temporary legal status that is used by many to continue their journey northward. \n\n“We’ve been waiting here for three or four months without an answer,” said Cristian Rivera, traveling alone, having left his wife and child in his native Honduras. “Hopefully with this march there will be a change and we can get the permission we need to head north.”\n\n\n\n\nLópez Obrador in May agreed to take in migrants from countries such as Venezuela, Nicaragua and Cuba turned away by the U.S. for not following rules that provided new legal pathways to asylum and other forms of migration.\n\nBut that deal, aimed at curbing a post-pandemic jump in migration, appears to be insufficient as the number of migrants once again surges, disrupting bilateral trade and stoking anti-migrant sentiment among conservative voters in the U.S.\n\nThis month, as many as 10,000 migrants were arrested per day at the U.S. southwest border. Meanwhile, U.S. Customs and Border Protection had to suspend cross-border rail traffic in the Texas cities of Eagle Pass and El Paso as migrants were riding atop freight trains.\n\nArrests for illegal crossing topped 2 million in each of the U.S. government’s last two fiscal years, reflecting technological changes that have made it easier for migrants to leave home to escape poverty, natural disasters, political repression and organized crime.\n\nOn Friday, López Obrador said he was willing to work again with the U.S. to address concerns about migration. But he also urged the Biden administration to ease sanctions on leftist governments in Cuba and Venezuela — where about 20% of 617,865 migrants encountered nationwide in October and November hail from — and send more aid to developing countries in Latin America and beyond. \n\n“That is what we are going to discuss, it is not just contention,” López Obrador said at a press briefing Friday following a phone conversation the day before with President Joe Biden to pave the way for the high level U.S. delegation.\n\nThe U.S. delegation, which will meet the Mexican president on Wednesday, will also include Homeland Security Secretary Alejandro Mayorkas and White House homeland security adviser Liz Sherwood-Randall.\n\nMexico’s ability to assist the U.S. may be limited, however. In December, the government halted a program to repatriate and transfer migrants inside Mexico due to a lack of funds. So far this year, Mexico has detected more than 680,000 migrants living illegally in the country, while the number of foreigners seeking asylum in the country has reached a record 137,000. \n\nSunday’s caravan was the largest since June 2022, when a similarly sized group departed as Biden hosted leaders in Los Angeles for the Summit of the Americas. Another march departed Mexico in October, coinciding with a summit organized by López Obrador to discuss the migration crisis with regional leaders. A month later, 3,000 migrants blocked for more than 30 hours the main border crossing with Guatemala. \n\nAssociated Press writers Joshua Goodman in Miami and Maria Verza in Mexico City contributed to this report.\n\nhttps://apnews.com/hub/migration",
        "source": "Associated Press (AP)",
        "date": null,
        "category": "US News"
    },
    "Associated Press (AP)-17": {
        "url": "https://apnews.com/article/indiana-driver-trapped-for-days-rescued-d693da8bb3ac9071a8363fb37af3209a",
        "title": "Man trapped for 6 days in wrecked truck in Indiana rescued after being spotted by passersby",
        "image_url": null,
        "body": "PORTAGE, Ind. (AP) — A man who had been trapped for days in his crashed pickup truck was rescued Tuesday after two fishermen spotted the wreckage, Indiana State Police said.\n\nTwo men were scouting fishing locations when they found the man in his badly damaged vehicle, Sgt. Glen Fifield told local news outlets.\n\n“They touched the body, and the person turned their head and started talking to them. So, that got a little rise out of them,” Fifield said.\n\nThe driver told the men he had been trapped since Dec. 20. The pickup had wrecked along Interstate 94 near Portage below an underpass where it could not be seen from the highway above.\n\nThe man, in his 20s, was airlifted to a hospital in South Bend for treatment of life-threatening injuries, Fifield said.\n\nThe driver’s name hasn’t been released. He had not been reported missing, Fifield said.\n\nPortage is about 31 miles (50 kilometers) southeast of Chicago.",
        "source": "Associated Press (AP)",
        "date": null,
        "category": "US News"
    },
    "Associated Press (AP)-18": {
        "url": "https://apnews.com/article/missing-pregnant-woman-dead-san-antonio-40baf2cc0d9aaabcb48bf551ff298b6e",
        "title": "Missing pregnant Texas teen and her boyfriend found dead in a car in San Antonio",
        "image_url": null,
        "body": "SAN ANTONIO, Texas (AP) — A missing pregnant Texas teenager and her boyfriend were found dead in a parked car Tuesday in San Antonio and police said they may have been there for days.\n\nSavanah Nicole Soto, 18, and Matthew Guerra, 22, were reported missing by police in Leon Valley, a few miles northwest of San Antonio suburb.\n\nTwo bodies were found in a Kia Optima matching the description of one belonging to the boyfriend and they may have been there for three or four days, Police Chief William P. McManus said at a news conference. \n\nHe didn’t identify the bodies pending confirmation by the medical examiner but said they were believed to be those of the missing couple. \n\nMcManus didn’t provide other details and said he didn’t know whether a weapon had been found in the car.\n\n\n\n\n“What we’re looking at right now is a very, very perplexing crime scene,” the chief said.\n\n“Detectives right now are looking at this as a possible murder but we don’t know for sure,” he said. “Because of the complexity, the complex crime scene, we can’t say for sure what we have.”\n\nThe bodies were found Tuesday afternoon after someone spotted the car in the parking lot of an apartment complex in San Antonio and alerted the family, KENS-TV reported. Relatives then called police.\n\nSoto was a week overdue to deliver and was scheduled to have an induced labor at a hospital last Saturday night, her family told the station.\n\nGloria Cordova said she last heard from her daughter on Friday afternoon and got no answer when she knocked on her Leon Valley apartment door Saturday afternoon. \n\nLeon Valley police issued a CLEAR Alert for Soto on Monday and later said her boyfriend also was missing. Soto’s family organized a search of the area near her apartment on Christmas night.\n\n“Savanah was so, so happy because she was going to be a mommy. It breaks my heart,” her mother told KENS-TV.",
        "source": "Associated Press (AP)",
        "date": null,
        "category": "US News"
    },
    "Associated Press (AP)-19": {
        "url": "https://apnews.com/article/high-surf-warning-hawaii-75a5196f32a704e1c3b91197a4e5dbd2",
        "title": "National Weather Service warns of high surf for some of Hawaii’s shores",
        "image_url": null,
        "body": "HONOLULU (AP) — The National Service warned Tuesday about high surf — up to 30 feet (9 meters) — along some of Hawaii’s shores.\n\nThe high surfing warning was in effect for north- and west-facing shores of the islands of Oahu, Kauai, Molokai and Niihau and north-facing shores of Maui.\n\nWaves of 10 to 15 feet (3 to 4.5 meters) were expected, building to 25 to 30 feet (7.62 to 9 meters), Tuesday night through Wednesday along north shores. \n\nOcean surges could affect coastal properties and roads, the weather service warning said. “Powerful longshore and rip currents will be present at most beaches,” the warning said. \n\nDerek Wroe, a meteorologist for the weather service in Honolulu, said large waves are not uncommon during Hawaii’s winter months. ",
        "source": "Associated Press (AP)",
        "date": null,
        "category": "US News"
    }
}